[
  {
    "rank": 103,
    "source_id": "28366",
    "title": "Gut",
    "type": "journal",
    "issn": "14683288, 00175749",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "8.874",
    "sjr_quartile": "Q1",
    "h_index": 364,
    "total_docs_2024": 312,
    "total_docs_3years": 1098,
    "total_refs": 10241,
    "total_citations_3years": 16121,
    "citable_docs_3years": 692,
    "citations_per_doc": "14.49",
    "refs_per_doc": "32.82",
    "female_percent": "39.33",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1960-2025",
    "categories": "Gastroenterology (Q1)",
    "areas": "Medicine",
    "scope": "Gut is a leading international journal in gastroenterology and hepatology and has an established reputation for publishing first class clinical research of the alimentary tract, the liver, biliary tree and pancreas. Gut delivers up-to-date, authoritative, clinically oriented coverage in all areas of gastroenterology and hepatology. Regular features include articles describing novel mechanisms of disease and new management strategies, both diagnostic and therapeutic, likely to impact on clinical practice within the foreseeable future by leading authorities."
  },
  {
    "rank": 317,
    "source_id": "19817",
    "title": "British Journal of Sports Medicine",
    "type": "journal",
    "issn": "03063674, 14730480",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "4.724",
    "sjr_quartile": "Q1",
    "h_index": 241,
    "total_docs_2024": 289,
    "total_docs_3years": 877,
    "total_refs": 9811,
    "total_citations_3years": 7484,
    "citable_docs_3years": 530,
    "citations_per_doc": "8.86",
    "refs_per_doc": "33.95",
    "female_percent": "44.73",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1964, 1974-2025",
    "categories": "Medicine (miscellaneous) (Q1); Orthopedics and Sports Medicine (Q1); Physical Therapy, Sports Therapy and Rehabilitation (Q1); Sports Science (Q1)",
    "areas": "Health Professions; Medicine",
    "scope": "British Journal of Sports Medicine (BJSM) is a multi-media portal that provides original research, reviews and debate relating to clinically-relevant aspects of sport and exercise medicine, including physiotherapy, physical therapy and rehabilitation. We contribute to innovation (research), education (teaching and learning) and knowledge translation (implementing research into practice and policy). Our web, print, video and audio material, combined with active social media, serves the international community of clinicians who treat active people."
  },
  {
    "rank": 377,
    "source_id": "21100466864",
    "title": "Journal for ImmunoTherapy of Cancer",
    "type": "journal",
    "issn": "20511426",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "4.220",
    "sjr_quartile": "Q1",
    "h_index": 136,
    "total_docs_2024": 471,
    "total_docs_3years": 1524,
    "total_refs": 20875,
    "total_citations_3years": 14439,
    "citable_docs_3years": 1494,
    "citations_per_doc": "9.10",
    "refs_per_doc": "44.32",
    "female_percent": "43.23",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2013-2025",
    "categories": "Cancer Research (Q1); Immunology (Q1); Immunology and Allergy (Q1); Molecular Medicine (Q1); Oncology (Q1); Pharmacology (Q1)",
    "areas": "Biochemistry, Genetics and Molecular Biology; Immunology and Microbiology; Medicine; Pharmacology, Toxicology and Pharmaceutics",
    "scope": "The Journal for ImmunoTherapy of Cancer (JITC) is the open access, peer reviewed, online journal of the Society for Immunotherapy of Cancer (SITC). The journal publishes articles on all aspects of tumor immunology and cancer immunotherapy and, in doing so, aims to enrich communication and advance scientific understanding among the many stakeholders in this rapidly evolving field. Topics of interest range widely across the basic science-translational-clinical spectrum and include tumor-host interactions, the tumor microenvironment, animal models, predictive and prognostic immune biomarkers, novel pharmaceutical and cellular therapies, vaccines, combination immune-based therapies, and immune-related toxicity."
  },
  {
    "rank": 576,
    "source_id": "16757",
    "title": "Journal of Neurology, Neurosurgery and Psychiatry",
    "type": "journal",
    "issn": "1468330X, 00223050",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "3.379",
    "sjr_quartile": "Q1",
    "h_index": 244,
    "total_docs_2024": 204,
    "total_docs_3years": 673,
    "total_refs": 6829,
    "total_citations_3years": 4392,
    "citable_docs_3years": 490,
    "citations_per_doc": "6.50",
    "refs_per_doc": "33.48",
    "female_percent": "44.23",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1920-1937, 1945-2025",
    "categories": "Neurology (clinical) (Q1); Psychiatry and Mental Health (Q1); Surgery (Q1)",
    "areas": "Medicine",
    "scope": "JNNP's ambition is to publish the most ground-breaking and cutting-edge research from around the world. Encompassing the entire genre of neurological sciences, our focus is on the common disorders (stroke, multiple sclerosis, Parkinson's disease, epilepsy, peripheral neuropathy, subarachnoid haemorrhage and neuropsychiatry), but with a keen interest in the Gordian knots that present themselves in the field, such as ALS.\r\nWith early online publication, regular podcasts and an immense archive collection (with the longest half-life of any journal in clinical neuroscience), JNNP is a trail-blazer and not a follower."
  },
  {
    "rank": 713,
    "source_id": "21101163294",
    "title": "BMJ Mental Health",
    "type": "journal",
    "issn": "27559734",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "3.005",
    "sjr_quartile": "Q1",
    "h_index": 53,
    "total_docs_2024": 86,
    "total_docs_3years": 142,
    "total_refs": 3229,
    "total_citations_3years": 935,
    "citable_docs_3years": 124,
    "citations_per_doc": "6.79",
    "refs_per_doc": "37.55",
    "female_percent": "49.57",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2023-2025",
    "categories": "Psychiatry and Mental Health (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Mental Health (formerly Evidence-Based Mental Health) is an open access, peer reviewed journal publishing evidence-based, innovative research, systematic reviews, and methodological papers in the area of mental health. It facilitates multidisciplinary collaboration among psychiatrists, psychologists and other mental health professionals, encourages debate on clinically relevant topics, and informs real world practice to improve patient and carer outcomes.\r\n\r\nBMJ Mental Health invites submissions in all areas of mental health including digital health; medical statistics; precision mental health; evaluation of psychotherapies; studies in children, young people and in the elderly; forensic psychiatry; health economics; data science and computational mental health."
  },
  {
    "rank": 724,
    "source_id": "51748",
    "title": "BMJ",
    "type": "journal",
    "issn": "09598146, 17561833",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "2.976",
    "sjr_quartile": "Q1",
    "h_index": 519,
    "total_docs_2024": 2824,
    "total_docs_3years": 8465,
    "total_refs": 26338,
    "total_citations_3years": 43402,
    "citable_docs_3years": 4573,
    "citations_per_doc": "2.39",
    "refs_per_doc": "9.33",
    "female_percent": "49.98",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1857-2025",
    "categories": "Medicine (miscellaneous) (Q1)",
    "areas": "Medicine",
    "scope": "The BMJ is defined by its mission: to work towards a healthier world for all. We share that global endeavour with millions of readers working in clinical practice, research, education, government, and with patients and the public too.\r\n\r\nThis mission defines us, far more than the format of our content. After nearly 180 years, our print edition still thrives, and has been joined by podcast, video, tweet, app, website and live events. But, as each of these formats gains ground or declines in importance, the things The BMJ cares about will endure:\r\n\r\n• Improving the creation and dissemination of research evidence\r\n• Improving clinical education and practice\r\n• Advocating for universal, equitable, high quality healthcare\r\n• Championing the health and wellbeing of doctors\r\n• Improving the social and environmental determinants of health."
  },
  {
    "rank": 993,
    "source_id": "21100898934",
    "title": "BMJ Global Health",
    "type": "journal",
    "issn": "20597908",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "2.451",
    "sjr_quartile": "Q1",
    "h_index": 91,
    "total_docs_2024": 356,
    "total_docs_3years": 1539,
    "total_refs": 16580,
    "total_citations_3years": 8805,
    "citable_docs_3years": 1246,
    "citations_per_doc": "4.92",
    "refs_per_doc": "46.57",
    "female_percent": "51.35",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2016-2025",
    "categories": "Health Policy (Q1); Public Health, Environmental and Occupational Health (Q1)",
    "areas": "Medicine",
    "scope": "The journal covers all aspects of global health, with particular interest in submissions that address the underfunded area of non-communicable diseases (NCDs). Research across all study phases and designs is welcome, from study protocols to phase I trials to meta-analyses, including small or specialist studies. The editor welcomes opinionated discussions on controversial topics to stimulate debate.\r\n\r\nBMJ Global Health adheres to BMJ’s rigorous standards of peer-review and papers are considered on the basis of ethical and methodological soundness rather than their novelty, significance, or relevance to any particular group. The journal operates a fast submission process with continuous publication online to ensure that timely, up-to-date research is available worldwide to those who need it."
  },
  {
    "rank": 996,
    "source_id": "19104",
    "title": "Thorax",
    "type": "journal",
    "issn": "14683296, 00406376",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "2.448",
    "sjr_quartile": "Q1",
    "h_index": 259,
    "total_docs_2024": 206,
    "total_docs_3years": 700,
    "total_refs": 5329,
    "total_citations_3years": 3681,
    "citable_docs_3years": 527,
    "citations_per_doc": "5.15",
    "refs_per_doc": "25.87",
    "female_percent": "45.00",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1946-2025",
    "categories": "Pulmonary and Respiratory Medicine (Q1)",
    "areas": "Medicine",
    "scope": "Thorax is one of the world’s leading respiratory medicine journals, publishing clinical and experimental research articles on respiratory medicine, critical care, paediatrics, immunology, pharmacology, pathology, and surgery. Thorax seeks to publish significant advances in scientific understanding, which are likely to impact on clinical practice. This includes articles concerning basic and translational mechanisms with application to clinical material (cell and molecular biology, genetics, epidemiology, and immunology)."
  },
  {
    "rank": 1104,
    "source_id": "17148",
    "title": "Tobacco Control",
    "type": "journal",
    "issn": "09644563, 14683318",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "2.305",
    "sjr_quartile": "Q1",
    "h_index": 147,
    "total_docs_2024": 259,
    "total_docs_3years": 669,
    "total_refs": 9562,
    "total_citations_3years": 2646,
    "citable_docs_3years": 585,
    "citations_per_doc": "4.21",
    "refs_per_doc": "36.92",
    "female_percent": "52.72",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1996-2025",
    "categories": "Health (social science) (Q1); Public Health, Environmental and Occupational Health (Q1)",
    "areas": "Medicine; Social Sciences",
    "scope": "Tobacco Control is an international peer-reviewed journal covering the nature and consequences of tobacco use worldwide; tobacco's effects on population health, the economy, the environment, and society; efforts to prevent and control the global tobacco epidemic through population-level education and policy changes; the ethical dimensions of tobacco control policies; and the activities of the tobacco industry and its allies."
  },
  {
    "rank": 1437,
    "source_id": "19700201434",
    "title": "BMJ Quality and Safety",
    "type": "journal",
    "issn": "20445423, 20445415",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.997",
    "sjr_quartile": "Q1",
    "h_index": 175,
    "total_docs_2024": 126,
    "total_docs_3years": 390,
    "total_refs": 5064,
    "total_citations_3years": 1675,
    "citable_docs_3years": 285,
    "citations_per_doc": "3.99",
    "refs_per_doc": "40.19",
    "female_percent": "60.28",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2011-2025",
    "categories": "Health Policy (Q1); Medicine (miscellaneous) (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Quality & Safety provides a rich mix of news, opinion, debate and research for academics, clinicians, healthcare managers and policy makers. It encourages the science of improvement, debate, and new thinking on improving the quality of healthcare. The journal is led by a patient-focused editorial team with a view towards helping all team members improve their knowledge with the overall goal of improving patient care. The journal integrates the academic and clinical aspects of quality and safety in healthcare by encouraging academics to create evidence and knowledge valued by clinicians and clinicians to value using evidence and knowledge to improve quality."
  },
  {
    "rank": 1537,
    "source_id": "21100869857",
    "title": "Stroke and Vascular Neurology",
    "type": "journal",
    "issn": "20598696, 20598688",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.935",
    "sjr_quartile": "Q1",
    "h_index": 46,
    "total_docs_2024": 116,
    "total_docs_3years": 234,
    "total_refs": 3901,
    "total_citations_3years": 1167,
    "citable_docs_3years": 221,
    "citations_per_doc": "5.47",
    "refs_per_doc": "33.63",
    "female_percent": "34.97",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2016-2025",
    "categories": "Cardiology and Cardiovascular Medicine (Q1); Neurology (clinical) (Q1)",
    "areas": "Medicine",
    "scope": "Stroke and Vascular Neurology is the official journal of the Chinese Stroke Association. Supported by a team of renowned Editors, and fully open access, the journal encourages debate on controversial techniques, issues on health policy and social medicine.\r\n\r\nStroke and Vascular Neurology will appeal to clinical stroke neurologists, neurosurgeons and basic neuroscientists. It will consider submissions of clinical and translational original research, short reports, editorials, and reviews to improve patient care."
  },
  {
    "rank": 1729,
    "source_id": "13736",
    "title": "British Journal of Ophthalmology",
    "type": "journal",
    "issn": "14682079, 00071161",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.806",
    "sjr_quartile": "Q1",
    "h_index": 185,
    "total_docs_2024": 232,
    "total_docs_3years": 979,
    "total_refs": 7224,
    "total_citations_3years": 4609,
    "citable_docs_3years": 961,
    "citations_per_doc": "4.49",
    "refs_per_doc": "31.14",
    "female_percent": "41.56",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1941-2025",
    "categories": "Cellular and Molecular Neuroscience (Q1); Ophthalmology (Q1); Sensory Systems (Q1)",
    "areas": "Medicine; Neuroscience",
    "scope": "The British Journal of Ophthalmology (BJO) is an international peer-reviewed journal for ophthalmologists and visual science specialists describing clinical investigations, clinical observations, and clinically relevant laboratory investigations related to ophthalmology. Main features include articles on both clinical and laboratory sciences, up to date major reviews, editorials, education articles and letters. There are sections for \"Innovations\" and \"Global issues\" where surgical, diagnositic and therapeutic innovations and manuscripts of regional interest to geographic areas of the world respectively, are published."
  },
  {
    "rank": 1741,
    "source_id": "21100878576",
    "title": "BMJ Evidence-Based Medicine",
    "type": "journal",
    "issn": "25154478, 2515446X",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.800",
    "sjr_quartile": "Q1",
    "h_index": 47,
    "total_docs_2024": 77,
    "total_docs_3years": 307,
    "total_refs": 2115,
    "total_citations_3years": 1091,
    "citable_docs_3years": 212,
    "citations_per_doc": "4.14",
    "refs_per_doc": "27.47",
    "female_percent": "48.88",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2025",
    "categories": "Medicine (miscellaneous) (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Evidence-Based Medicine:\r\n\r\nPublishes original evidence based research, insights and opinions on what matters for health care\r\nFocuses on the tools, methods, and concepts that are basic and central to practising evidence-based medicine.\r\nHow we deliver relevant, trustworthy and impactful evidence:\r\n\r\nBy Disseminating relevant research: saving you time and improving your practice – BMJ Evidence-Based Medicine systematically searches international medical journals and applies strict criteria to identify relevant research. Content is critically appraised, leading to a succinct commentary focusing on the paper’s key findings and implications for clinical practice.\r\nBy Providing debate, analysis, and opinion on trusted evidence that matters for better healthcare – BMJ Evidence-Based Medicine debates the uncertainties and controversies in evidence and the research methods that educate and inform practice.\r\nBy Publishing original research that affects practice – BMJ Evidence-Based Medicine publishes the latest research that enhances the practice and understanding of evidence-based healthcare."
  },
  {
    "rank": 1763,
    "source_id": "23217",
    "title": "Heart",
    "type": "journal",
    "issn": "1468201X, 13556037",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.781",
    "sjr_quartile": "Q1",
    "h_index": 214,
    "total_docs_2024": 200,
    "total_docs_3years": 1193,
    "total_refs": 4679,
    "total_citations_3years": 3469,
    "citable_docs_3years": 810,
    "citations_per_doc": "2.86",
    "refs_per_doc": "23.40",
    "female_percent": "34.49",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1942, 1971-1978, 1983-1984, 1986-1990, 1992-2025",
    "categories": "Cardiology and Cardiovascular Medicine (Q1)",
    "areas": "Medicine",
    "scope": "Heart is an international peer reviewed journal that keeps cardiologists up to date with important research advances in cardiovascular disease. New scientific developments are highlighted in editorials and put in context with concise review articles. There is one free Editor’s Choice article in each issue, with open access options available to authors for all articles. Education in Heart articles provide a comprehensive, continuously updated, cardiology curriculum."
  },
  {
    "rank": 1774,
    "source_id": "15896",
    "title": "Journal of Epidemiology and Community Health",
    "type": "journal",
    "issn": "14702738, 0143005X",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.776",
    "sjr_quartile": "Q1",
    "h_index": 199,
    "total_docs_2024": 141,
    "total_docs_3years": 507,
    "total_refs": 4936,
    "total_citations_3years": 2004,
    "citable_docs_3years": 461,
    "citations_per_doc": "3.51",
    "refs_per_doc": "35.01",
    "female_percent": "51.60",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1978-2025",
    "categories": "Epidemiology (Q1); Public Health, Environmental and Occupational Health (Q1)",
    "areas": "Medicine",
    "scope": "Journal of Epidemiology and Community Health is a truly international journal that encompasses all aspects of epidemiology and public health. It publishes original research, opinions and materials concerned with the study and improvement of communities worldwide."
  },
  {
    "rank": 1788,
    "source_id": "21100901769",
    "title": "General Psychiatry",
    "type": "journal",
    "issn": "2517729X, 20965923",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.766",
    "sjr_quartile": "Q1",
    "h_index": 48,
    "total_docs_2024": 74,
    "total_docs_3years": 185,
    "total_refs": 2607,
    "total_citations_3years": 1033,
    "citable_docs_3years": 151,
    "citations_per_doc": "5.80",
    "refs_per_doc": "35.23",
    "female_percent": "39.39",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2025",
    "categories": "Neurology (Q1); Neurology (clinical) (Q1); Psychiatry and Mental Health (Q1)",
    "areas": "Medicine; Neuroscience",
    "scope": "General Psychiatry (GPSYCH) is an open access journal that covers all topics of interest to psychiatrists and other mental health professionals internationally. The journal includes original research, systematic reviews, meta-analyses (that, unlike meta-analyses in other journals, pool results from studies published in Chinese and English), forums on topical issues (with commentaries from Chinese and international authors), case reports, research methods in psychiatry, and a unique section on ‘Biostatistics in Psychiatry’. Original articles on basic research, clinical research, community-based studies, and ecological studies are all considered for publication."
  },
  {
    "rank": 1843,
    "source_id": "21101224867",
    "title": "BMJ Oncology",
    "type": "journal",
    "issn": "27527948",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.731",
    "sjr_quartile": "Q1",
    "h_index": 6,
    "total_docs_2024": 76,
    "total_docs_3years": 39,
    "total_refs": 2978,
    "total_citations_3years": 127,
    "citable_docs_3years": 20,
    "citations_per_doc": "3.26",
    "refs_per_doc": "39.18",
    "female_percent": "41.98",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2022-2025",
    "categories": "Oncology (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Oncology is an open access journal with a mission to optimise cancer care and improve patient outcomes. The journal prioritises high quality original research and review papers across the broad spectrum of cancer research, investigation, treatment and practice.\r\nBMJ Oncology aims to improve cancer outcomes by:\r\n•\tPublishing a broad range of peer-reviewed articles that provide significant clinical, scientific and educational value\r\n•\tReaching a wide international audience through BMJ’s global recognition and clinical following\r\n•\tFacilitating a close interaction between basic, translational and clinical sciences through publication and by fostering interdisciplinary research\r\n•\tProvoking scientific debate and discussion\r\n•\tEncouraging researchers, clinicians, patients and the public to engage with the journal content and contribute through social media and multimedia"
  },
  {
    "rank": 1949,
    "source_id": "21100779230",
    "title": "RMD Open",
    "type": "journal",
    "issn": "20565933",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.685",
    "sjr_quartile": "Q1",
    "h_index": 67,
    "total_docs_2024": 299,
    "total_docs_3years": 682,
    "total_refs": 10096,
    "total_citations_3years": 3100,
    "citable_docs_3years": 639,
    "citations_per_doc": "4.34",
    "refs_per_doc": "33.77",
    "female_percent": "51.15",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2015-2025",
    "categories": "Immunology (Q1); Immunology and Allergy (Q1); Rheumatology (Q1)",
    "areas": "Immunology and Microbiology; Medicine",
    "scope": "RMD Open publishes high quality peer-reviewed original research covering the full spectrum of musculoskeletal disorders, rheumatism and connective tissue diseases, including osteoporosis, spine and rehabilitation. Clinical and epidemiological research, basic and translational medicine, interesting clinical cases, and smaller studies that add to the literature are all considered."
  },
  {
    "rank": 2067,
    "source_id": "19700201513",
    "title": "Journal of NeuroInterventional Surgery",
    "type": "journal",
    "issn": "17598486, 17598478",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.634",
    "sjr_quartile": "Q1",
    "h_index": 90,
    "total_docs_2024": 430,
    "total_docs_3years": 970,
    "total_refs": 10461,
    "total_citations_3years": 3834,
    "citable_docs_3years": 823,
    "citations_per_doc": "3.78",
    "refs_per_doc": "24.33",
    "female_percent": "27.85",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2009-2025",
    "categories": "Medicine (miscellaneous) (Q1); Neurology (clinical) (Q1); Surgery (Q1)",
    "areas": "Medicine",
    "scope": "The Journal of NeuroInterventional Surgery (JNIS) is a leading peer review journal for scientific research and literature pertaining to the field of neurointerventional surgery. The journal launch addressed growing professional interest in neurointerventional techniques for the treatment of a range of neurological and vascular problems including stroke, aneurysms, brain tumors, and spinal disorders."
  },
  {
    "rank": 2090,
    "source_id": "18945",
    "title": "Journal of Medical Genetics",
    "type": "journal",
    "issn": "00222593, 14686244",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.620",
    "sjr_quartile": "Q1",
    "h_index": 194,
    "total_docs_2024": 122,
    "total_docs_3years": 471,
    "total_refs": 4155,
    "total_citations_3years": 1800,
    "citable_docs_3years": 465,
    "citations_per_doc": "3.79",
    "refs_per_doc": "34.06",
    "female_percent": "56.29",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1964-2025",
    "categories": "Genetics (Q1); Genetics (clinical) (Q1)",
    "areas": "Biochemistry, Genetics and Molecular Biology; Medicine",
    "scope": "Journal of Medical Genetics is a leading international peer-reviewed journal covering original research in human genetics, including reviews of and opinion on the latest developments. Articles cover the molecular basis of human disease including germline cancer genetics, clinical manifestations of genetic disorders, applications of molecular genetics to medical practice and the systematic evaluation of such applications worldwide."
  },
  {
    "rank": 2261,
    "source_id": "21100469641",
    "title": "BMJ Open Diabetes Research and Care",
    "type": "journal",
    "issn": "20524897",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.544",
    "sjr_quartile": "Q1",
    "h_index": 59,
    "total_docs_2024": 117,
    "total_docs_3years": 472,
    "total_refs": 4407,
    "total_citations_3years": 2093,
    "citable_docs_3years": 459,
    "citations_per_doc": "4.32",
    "refs_per_doc": "37.67",
    "female_percent": "47.95",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2015-2025",
    "categories": "Endocrinology, Diabetes and Metabolism (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Open Diabetes Research & Care is an open access journal committed to publishing high-quality basic and clinical research articles regarding type 1 and type 2 diabetes and associated complications. Only original research and systematic reviews are accepted. Submissions are subject to rigorous external peer review to ensure the publication of high-quality information.\r\n\r\nThe online-only format allows for continuous updates and serves as an invaluable resource to the multidisciplinary community of endocrinology, public health/prevention and internal medicine. A rapid review process will also ensure that timely, up-to-date research is available internationally.\r\n\r\nBMJ Open Diabetes Research & Care is published by BMJ in partnership with the American Diabetes Association."
  },
  {
    "rank": 2655,
    "source_id": "21948",
    "title": "Regional Anesthesia and Pain Medicine",
    "type": "journal",
    "issn": "10987339, 15328651",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.411",
    "sjr_quartile": "Q1",
    "h_index": 130,
    "total_docs_2024": 299,
    "total_docs_3years": 686,
    "total_refs": 7571,
    "total_citations_3years": 2082,
    "citable_docs_3years": 433,
    "citations_per_doc": "2.49",
    "refs_per_doc": "25.32",
    "female_percent": "34.48",
    "country": "United States",
    "region": "Northern America",
    "coverage": "1998-2025",
    "categories": "Anesthesiology and Pain Medicine (Q1); Medicine (miscellaneous) (Q1)",
    "areas": "Medicine",
    "scope": "Regional Anesthesia & Pain Medicine, the official publication of the American Society of Regional Anesthesia and Pain Medicine (ASRA), is a monthly journal that publishes peer-reviewed scientific and clinical studies to advance the understanding and clinical application of regional techniques for surgical anesthesia and postoperative analgesia. Coverage includes intraoperative regional techniques, perioperative pain, chronic pain, obstetric anesthesia, pediatric anesthesia, outcome studies, and complications.\r\n\r\nPublished for over thirty years, this respected journal also serves as the official publication of the European Society of Regional Anaesthesia and Pain Therapy (ESRA), the Asian and Oceanic Society of Regional Anesthesia (AOSRA), the Latin American Society of Regional Anesthesia (LASRA), the African Society for Regional Anesthesia (AFSRA), and the Academy of Regional Anaesthesia of India (AORA)."
  },
  {
    "rank": 2694,
    "source_id": "21100428281",
    "title": "Lupus Science and Medicine",
    "type": "journal",
    "issn": "20538790",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.401",
    "sjr_quartile": "Q1",
    "h_index": 43,
    "total_docs_2024": 98,
    "total_docs_3years": 243,
    "total_refs": 3853,
    "total_citations_3years": 918,
    "citable_docs_3years": 230,
    "citations_per_doc": "3.49",
    "refs_per_doc": "39.32",
    "female_percent": "57.45",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2014-2025",
    "categories": "Immunology (Q1); Medicine (miscellaneous) (Q1); Rheumatology (Q1)",
    "areas": "Immunology and Microbiology; Medicine",
    "scope": "Lupus Science & Medicine is a global, peer reviewed, open access online journal that provides a central point for publication of basic, clinical, translational, and epidemiological studies of all aspects of lupus and related diseases. It is the first lupus-specific open access journal in the world and was developed in response to the need for a barrier-free forum for publication of groundbreaking studies in lupus.\r\n\r\nThe journal publishes research on lupus from fields including, but not limited to: rheumatology, dermatology, nephrology, immunology, pediatrics, cardiology, hepatology, pulmonology, obstetrics and gynecology, and psychiatry."
  },
  {
    "rank": 2851,
    "source_id": "21101255352",
    "title": "eGastroenterology",
    "type": "journal",
    "issn": "29767296, 27660125",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.358",
    "sjr_quartile": "Q1",
    "h_index": 6,
    "total_docs_2024": 32,
    "total_docs_3years": 25,
    "total_refs": 2738,
    "total_citations_3years": 67,
    "citable_docs_3years": 20,
    "citations_per_doc": "2.68",
    "refs_per_doc": "85.56",
    "female_percent": "39.50",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2023-2025",
    "categories": "Gastroenterology (Q1)",
    "areas": "Medicine",
    "scope": "eGastroenterology dedicates itself to improving clinical diagnosis and treatment of gastrointestinal, hepatobiliary, pancreatic, and esophageal diseases. The main aim of eGastroenterology is to provide a platform for communication among researchers and clinicians engaged in the fields of basic, clinical, and translational medicine research in gastroenterology and hepatology. The ultimate goal is to promote the translation of basic science into clinical practice and to benefit patients through the best scientific evidence available. eGastroenterology publishes up-to-date research of prevention, diagnosis, and treatment advances in all sub-fields of digestive medicine and surgery with: \r\n•\tOriginal research\r\n•\tReview\r\n•\tShort report\r\n•\tGuideline\r\n•\tEditorial\r\n•\tPerspective\r\nTopics of interest include, but are not limited to, the following: \r\n•\tLiver diseases\r\no\tViral hepatitis\r\no\tMASLD/NAFLD\r\no\tAlcohol-related liver diseases\r\no\tCholestatic and biliary diseases\r\n•\tHepatobiliary and pancreatic cancer\r\n•\tPancreas diseases\r\n•\tEsophageal diseases\r\n•\tHepato-pancreato-biliary surgery\r\n•\tTranslational gastroenterology and hepatology\r\n•\tGastrointestinal disorders\r\no\tIrritable bowel syndrome\r\no\tGut microbiota\r\no\tInflammatory bowel disease\r\no\tGI cancer\r\n•\tGastrointestinal endoscope\r\n•\tGut immunity\r\n•\tNutrition\r\n•\tGastrointestinal surgery\r\n•\tEpidemiology"
  },
  {
    "rank": 2867,
    "source_id": "30081",
    "title": "Archives of Disease in Childhood: Fetal and Neonatal Edition",
    "type": "journal",
    "issn": "13592998, 14682052",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.354",
    "sjr_quartile": "Q1",
    "h_index": 137,
    "total_docs_2024": 163,
    "total_docs_3years": 435,
    "total_refs": 4298,
    "total_citations_3years": 1433,
    "citable_docs_3years": 333,
    "citations_per_doc": "3.10",
    "refs_per_doc": "26.37",
    "female_percent": "59.88",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1994-2025",
    "categories": "Medicine (miscellaneous) (Q1); Obstetrics and Gynecology (Q1); Pediatrics, Perinatology and Child Health (Q1)",
    "areas": "Medicine",
    "scope": "Archives of Disease in Childhood is an international peer review journal that aims to keep paediatricians and others up to date with advances in the diagnosis and treatment of childhood diseases as well as advocacy issues such as child protection. It focuses on all aspects of child health and disease from the perinatal period (in the Fetal and Neonatal edition) through to adolescence. ADC includes original research reports, commentaries, reviews of clinical and policy issues, and evidence reports. Areas covered include: community child health, public health, epidemiology, acute paediatrics, advocacy, and ethics."
  },
  {
    "rank": 2938,
    "source_id": "29756",
    "title": "Occupational and Environmental Medicine",
    "type": "journal",
    "issn": "14707926, 13510711",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.338",
    "sjr_quartile": "Q1",
    "h_index": 167,
    "total_docs_2024": 86,
    "total_docs_3years": 383,
    "total_refs": 2586,
    "total_citations_3years": 1193,
    "citable_docs_3years": 346,
    "citations_per_doc": "2.95",
    "refs_per_doc": "30.07",
    "female_percent": "52.23",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1994-2025",
    "categories": "Public Health, Environmental and Occupational Health (Q1)",
    "areas": "Medicine",
    "scope": "Occupational and Environmental Medicine is an international peer reviewed journal covering current developments in occupational and environmental health worldwide. Occupational and Environmental Medicine publishes high-quality research relating to the full range of chemical, physical, ergonomic, biological and psychosocial hazards in the workplace and to environmental contaminants and their health effects. The journal welcomes research aimed at improving the evidence-based practice of occupational and environmental research; including the development and application of novel biological and statistical techniques in addition to evaluation of interventions in controlling occupational and environmental risks."
  },
  {
    "rank": 2964,
    "source_id": "21100869188",
    "title": "BMJ Open Sport and Exercise Medicine",
    "type": "journal",
    "issn": "20557647",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.330",
    "sjr_quartile": "Q1",
    "h_index": 51,
    "total_docs_2024": 186,
    "total_docs_3years": 366,
    "total_refs": 6960,
    "total_citations_3years": 1458,
    "citable_docs_3years": 339,
    "citations_per_doc": "3.19",
    "refs_per_doc": "37.42",
    "female_percent": "40.55",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2015-2025",
    "categories": "Orthopedics and Sports Medicine (Q1); Physical Therapy, Sports Therapy and Rehabilitation (Q1)",
    "areas": "Health Professions; Medicine",
    "scope": "BMJ Open Sport & Exercise Medicine is an open access journal covering all aspects of sport and exercise medicine from physiology to return to play."
  },
  {
    "rank": 3242,
    "source_id": "21100909462",
    "title": "BMJ Health and Care Informatics",
    "type": "journal",
    "issn": "26321009",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.263",
    "sjr_quartile": "Q1",
    "h_index": 49,
    "total_docs_2024": 57,
    "total_docs_3years": 197,
    "total_refs": 1622,
    "total_citations_3years": 866,
    "citable_docs_3years": 173,
    "citations_per_doc": "4.03",
    "refs_per_doc": "28.46",
    "female_percent": "45.92",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2019-2025",
    "categories": "Computer Science Applications (Q1); Health Informatics (Q1); Health Information Management (Q1)",
    "areas": "Computer Science; Health Professions; Medicine",
    "scope": "BMJ Health & Care Informatics publishes international, peer-reviewed, high-quality research and evaluation, reviews, protocols, letters, commentaries and communication articles.\r\n\r\nThe essential scope of the journal is how informatics supports improvements in direct health and care service provision, but also incorporates public health strategies and interventions, implementation of learning health systems and national policy issues.\r\n\r\nA core purpose of the journal is to bring together the academic and practitioner communities, so we invite professionals in health and care informatics who are unfamiliar with the conventions and processes of academic publishing to contact the editorial office for guidance on writing for publication."
  },
  {
    "rank": 3736,
    "source_id": "21100854130",
    "title": "BMJ Open Gastroenterology",
    "type": "journal",
    "issn": "20544774",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.166",
    "sjr_quartile": "Q1",
    "h_index": 39,
    "total_docs_2024": 79,
    "total_docs_3years": 232,
    "total_refs": 3121,
    "total_citations_3years": 779,
    "citable_docs_3years": 225,
    "citations_per_doc": "2.90",
    "refs_per_doc": "39.51",
    "female_percent": "40.41",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2014-2025",
    "categories": "Gastroenterology (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Open Gastroenterology is an online-only, peer-reviewed, open access gastroenterology journal, dedicated to publishing high-quality medical research from all disciplines and therapeutic areas of gastroenterology. It is the open access companion journal of Gut and is co-owned by the British Society of Gastroenterology.\r\n\r\nThe journal publishes all research study types, from study protocols to phase I trials to meta-analyses, including small or specialist studies. Publishing procedures are built around continuous publication, publishing research online as soon as the article is ready."
  },
  {
    "rank": 3800,
    "source_id": "21100455625",
    "title": "Family Medicine and Community Health",
    "type": "journal",
    "issn": "20098774, 23056983",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.154",
    "sjr_quartile": "Q1",
    "h_index": 21,
    "total_docs_2024": 42,
    "total_docs_3years": 107,
    "total_refs": 1478,
    "total_citations_3years": 326,
    "citable_docs_3years": 101,
    "citations_per_doc": "3.81",
    "refs_per_doc": "35.19",
    "female_percent": "49.85",
    "country": "Ireland",
    "region": "Western Europe",
    "coverage": "2013-2025",
    "categories": "Family Practice (Q1); Public Health, Environmental and Occupational Health (Q1)",
    "areas": "Medicine",
    "scope": "Family Medicine and Community Health (FMCH) is a peer-reviewed, open-access journal focusing on the topics of family medicine, general practice and community health. FMCH strives to be a leading international journal that promotes ‘Health Care for All’ through disseminating novel knowledge and best practices in primary care, family medicine, and community health. FMCH publishes original research, review, methodology, commentary, reflection, and case-study from the lens of population health. FMCH’s Asian Focus section features reports of family medicine development in the Asia-pacific region.\r\n\r\nFMCH aims to be an exemplary forum for the timely communication of medical knowledge and skills with the goal of promoting improved health care through the practice of family and community-based medicine globally.\r\n\r\nFMCH aims to serve a diverse audience including researchers, educators, policymakers and leaders of family medicine and community health. We also aim to provide content relevant for researchers working on population health, epidemiology, public policy, disease control and management, preventative medicine and disease burden. FMCH does not impose any article processing charges (APC) or submission charges."
  },
  {
    "rank": 4089,
    "source_id": "21100464778",
    "title": "Open Heart",
    "type": "journal",
    "issn": "20533624, 2398595X",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.107",
    "sjr_quartile": "Q1",
    "h_index": 54,
    "total_docs_2024": 139,
    "total_docs_3years": 534,
    "total_refs": 3922,
    "total_citations_3years": 1400,
    "citable_docs_3years": 520,
    "citations_per_doc": "2.63",
    "refs_per_doc": "28.22",
    "female_percent": "31.37",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2014-2025",
    "categories": "Cardiology and Cardiovascular Medicine (Q1)",
    "areas": "Medicine",
    "scope": "Open Heart is an online-only, open access cardiology journal that aims to be “open” in many ways: open access (free access for all readers), open peer review (unblinded peer review) and open data (data sharing is encouraged). The goal is to ensure maximum transparency and maximum impact on research progress and patient care.\r\n\r\nThe journal is dedicated to publishing high quality, peer reviewed medical research in all disciplines and therapeutic areas of cardiovascular medicine. Research is published across all study phases and designs, from study protocols to phase I trials to meta-analyses, including small or specialist studies. Opinionated discussions on controversial topics are welcomed.\r\n\r\nOpen Heart aims to operate a fast submission and review process with continuous publication online, to ensure timely, up-to-date research is available worldwide. The journal adheres to a rigorous and transparent peer review process, and all articles go through a statistical assessment to ensure robustness of the analyses.\r\n\r\nOpen Heart is an official journal of the British Cardiovascular Society."
  },
  {
    "rank": 4092,
    "source_id": "21100782247",
    "title": "BMJ Open Respiratory Research",
    "type": "journal",
    "issn": "20524439",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.106",
    "sjr_quartile": "Q1",
    "h_index": 45,
    "total_docs_2024": 177,
    "total_docs_3years": 421,
    "total_refs": 6754,
    "total_citations_3years": 1444,
    "citable_docs_3years": 417,
    "citations_per_doc": "3.49",
    "refs_per_doc": "38.16",
    "female_percent": "42.87",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2014-2025",
    "categories": "Pulmonary and Respiratory Medicine (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Open Respiratory Research is a peer-reviewed, open access journal publishing respiratory and critical care medicine. It is the sister journal to Thorax and co-owned by the British Thoracic Society and BMJ. The journal focuses on robustness of methodology and scientific rigour with less emphasis on novelty or perceived impact.\r\n\r\nBMJ Open Respiratory Research operates a rapid review process, with continuous publication online, ensuring timely, up-to-date research is available worldwide.\r\n\r\nThe journal publishes review articles and all research study types:\r\n\r\nBasic science including laboratory based experiments and animal models,\r\nPilot studies or proof of concept,\r\nObservational studies,\r\nStudy protocols,\r\nRegistries,\r\nClinical trials from phase I to multicentre randomised clinical trials,\r\nSystematic reviews and meta-analyses."
  },
  {
    "rank": 4647,
    "source_id": "21100817644",
    "title": "Frontline Gastroenterology",
    "type": "journal",
    "issn": "20414137, 20414145",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.023",
    "sjr_quartile": "Q2",
    "h_index": 31,
    "total_docs_2024": 88,
    "total_docs_3years": 365,
    "total_refs": 2336,
    "total_citations_3years": 748,
    "citable_docs_3years": 282,
    "citations_per_doc": "1.98",
    "refs_per_doc": "26.55",
    "female_percent": "38.44",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2013-2025",
    "categories": "Gastroenterology (Q2); Hepatology (Q2)",
    "areas": "Medicine",
    "scope": "Frontline Gastroenterology publishes articles that accelerate adoption of innovative and best practice in the fields of gastroenterology and hepatology. Frontline Gastroenterology is especially interested in articles on multidisciplinary research and care, focusing on both retrospective assessments of novel models of care as well as putative future directions of best practice. Specifically Frontline Gastroenterology publishes articles in the domains of clinical quality, patient experience, service provision and medical education."
  },
  {
    "rank": 4676,
    "source_id": "24946",
    "title": "Sexually Transmitted Infections",
    "type": "journal",
    "issn": "14723263, 13684973",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "1.019",
    "sjr_quartile": "Q1",
    "h_index": 115,
    "total_docs_2024": 128,
    "total_docs_3years": 432,
    "total_refs": 2450,
    "total_citations_3years": 962,
    "citable_docs_3years": 330,
    "citations_per_doc": "1.86",
    "refs_per_doc": "19.14",
    "female_percent": "54.65",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1940-1942, 1973-1975, 1980-1988, 1992-1994, 1996-2025",
    "categories": "Dermatology (Q1); Infectious Diseases (Q1)",
    "areas": "Medicine",
    "scope": "Sexually Transmitted Infections is the world’s longest running international journal on sexual health. It aims to keep practitioners, trainees and researchers up to date in the prevention, diagnosis and treatment of all STIs and HIV. The journal publishes original research, descriptive epidemiology, evidence-based reviews and comment on the clinical, public health, sociological and laboratory aspects of sexual health from around the world. We also publish educational articles, letters and other material of interest to readers, along with podcasts and other online material. STI provides a high quality editorial service from submission to publication."
  },
  {
    "rank": 4702,
    "source_id": "19800188003",
    "title": "BMJ Open",
    "type": "journal",
    "issn": "20446055",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "1.016",
    "sjr_quartile": "Q1",
    "h_index": 176,
    "total_docs_2024": 3952,
    "total_docs_3years": 13485,
    "total_refs": 165987,
    "total_citations_3years": 36796,
    "citable_docs_3years": 13420,
    "citations_per_doc": "2.38",
    "refs_per_doc": "42.00",
    "female_percent": "51.64",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2011-2025",
    "categories": "Medicine (miscellaneous) (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Open is a medical journal. We consider papers addressing research questions in clinical medicine, public health and epidemiology. We also welcome studies in health services research, health economics, surgery, qualitative research, research methods, medical education, medical publishing and any other field that directly addresses patient outcomes or the practice and delivery of healthcare.\r\n\r\nOur focus is on research that is relevant to patients and clinicians. We do not publish studies conducted in animals, laboratory studies not linked to patient outcomes, papers reporting solely physiological or biomechanical results from healthy participants, anatomy, cell biology or non-clinical psychology.\r\n\r\nAll research study types are considered, from study protocols through phase I trials to meta-analyses. This includes specialist studies and studies reporting negative results."
  },
  {
    "rank": 4992,
    "source_id": "15962",
    "title": "Journal of Medical Ethics",
    "type": "journal",
    "issn": "14734257, 03066800",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.980",
    "sjr_quartile": "Q1",
    "h_index": 93,
    "total_docs_2024": 290,
    "total_docs_3years": 883,
    "total_refs": 7391,
    "total_citations_3years": 2265,
    "citable_docs_3years": 653,
    "citations_per_doc": "2.10",
    "refs_per_doc": "25.49",
    "female_percent": "46.59",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1975-2025",
    "categories": "Arts and Humanities (miscellaneous) (Q1); Health Policy (Q1); Health (social science) (Q1); Issues, Ethics and Legal Aspects (Q1)",
    "areas": "Arts and Humanities; Medicine; Nursing; Social Sciences",
    "scope": "Journal of Medical Ethics is a leading international journal that reflects the whole field of medical ethics. The journal seeks to promote ethical reflection and conduct in scientific research and medical practice. It features articles on various ethical aspects of health care relevant to health care professionals, members of clinical ethics committees, medical ethics professionals, researchers and bioscientists, policy makers and patients.\r\n\r\nSubscribers to the Journal of Medical Ethics also receive Medical Humanities journal at no extra cost. \r\n\r\nJME is the official journal of the Institute of Medical Ethics."
  },
  {
    "rank": 5054,
    "source_id": "14491",
    "title": "Archives of Disease in Childhood",
    "type": "journal",
    "issn": "00039888, 14682044",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.972",
    "sjr_quartile": "Q1",
    "h_index": 169,
    "total_docs_2024": 319,
    "total_docs_3years": 1064,
    "total_refs": 6215,
    "total_citations_3years": 2148,
    "citable_docs_3years": 697,
    "citations_per_doc": "1.88",
    "refs_per_doc": "19.48",
    "female_percent": "57.10",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1930, 1932-2025",
    "categories": "Pediatrics, Perinatology and Child Health (Q1)",
    "areas": "Medicine",
    "scope": "Archives of Disease in Childhood is an international peer review journal that aims to keep paediatricians and others up to date with advances in the diagnosis and treatment of childhood diseases as well as advocacy issues such as child protection. It focuses on all aspects of child health and disease from the perinatal period (in the Fetal and Neonatal edition) through to adolescence. ADC includes original research reports, commentaries, reviews of clinical and policy issues, and evidence reports. Areas covered include: community child health, public health, epidemiology, acute paediatrics, advocacy, and ethics."
  },
  {
    "rank": 5589,
    "source_id": "21101022490",
    "title": "BMJ Nutrition, Prevention and Health",
    "type": "journal",
    "issn": "25165542",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.911",
    "sjr_quartile": "Q1",
    "h_index": 21,
    "total_docs_2024": 55,
    "total_docs_3years": 168,
    "total_refs": 2058,
    "total_citations_3years": 497,
    "citable_docs_3years": 149,
    "citations_per_doc": "2.38",
    "refs_per_doc": "37.42",
    "female_percent": "60.53",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2019-2025",
    "categories": "Health (social science) (Q1); Medicine (miscellaneous) (Q1); Nutrition and Dietetics (Q2)",
    "areas": "Medicine; Nursing; Social Sciences",
    "scope": "BMJ Nutrition, Prevention & Health aims to present the best available evidence of the impact of nutrition and lifestyle factors on the health of individuals and populations. The journal will present robust research on the key determinants of health including the social, economic, and physical environment, as well as lifestyle and behaviour. It will explore dietary factors, exercise and healthcare interventions and technologies, which aim to maintain and improve health and wellbeing and to prevent illness and injury."
  },
  {
    "rank": 5623,
    "source_id": "21100910195",
    "title": "BMJ Open Ophthalmology",
    "type": "journal",
    "issn": "23973269",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.908",
    "sjr_quartile": "Q2",
    "h_index": 28,
    "total_docs_2024": 115,
    "total_docs_3years": 338,
    "total_refs": 3818,
    "total_citations_3years": 791,
    "citable_docs_3years": 332,
    "citations_per_doc": "1.92",
    "refs_per_doc": "33.20",
    "female_percent": "41.76",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2016-2025",
    "categories": "Ophthalmology (Q2)",
    "areas": "Medicine",
    "scope": "BMJ Open Ophthalmology is the online-only, open access companion to British Journal of Ophthalmology. The journal publishes high quality, peer-reviewed articles on basic, translational and clinical science, covering all aspects of ophthalmology and vision science.\r\n\r\nBMJ Open Ophthalmology aims to:\r\n\r\n-Publish a broad range of articles of particular clinical, scientific, educational or surgical value on a rapid publication schedule\r\n-Facilitate a close interaction between basic, translational and clinical sciences through publication and fostering interdisciplinary research\r\n-Provide an interactive digital platform that is freely available, unrestricted and immediately accessible\r\n-Provoke scientific debate and clinical commentary in which the readership, authors and public can engage and contribute through social media and multimedia"
  },
  {
    "rank": 5772,
    "source_id": "21101056543",
    "title": "BMJ Neurology Open",
    "type": "journal",
    "issn": "26326140",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.892",
    "sjr_quartile": "Q2",
    "h_index": 13,
    "total_docs_2024": 97,
    "total_docs_3years": 128,
    "total_refs": 2993,
    "total_citations_3years": 322,
    "citable_docs_3years": 125,
    "citations_per_doc": "2.33",
    "refs_per_doc": "30.86",
    "female_percent": "38.84",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2019-2025",
    "categories": "Neurology (Q2); Neurology (clinical) (Q2)",
    "areas": "Medicine; Neuroscience",
    "scope": "BMJ Neurology Open is an online, peer-reviewed, open access journal, dedicated to publishing research in all areas of clinical neurology and neuroscience. This journal is particularly interested in addressing common diseases and their treatment, or illuminating mechanisms of disease or modes of action of treatments, whether related to their efficacy or their complications. BMJ Neurology Open is also interested in clinical neurology implementation studies which look at how neurological advances can be brought to the patients who need them."
  },
  {
    "rank": 5862,
    "source_id": "21100862741",
    "title": "BMJ Sexual and Reproductive Health",
    "type": "journal",
    "issn": "25152009, 25151991",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.882",
    "sjr_quartile": "Q1",
    "h_index": 48,
    "total_docs_2024": 71,
    "total_docs_3years": 212,
    "total_refs": 1506,
    "total_citations_3years": 454,
    "citable_docs_3years": 156,
    "citations_per_doc": "1.88",
    "refs_per_doc": "21.21",
    "female_percent": "79.69",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2025",
    "categories": "Obstetrics and Gynecology (Q1); Reproductive Medicine (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Sexual & Reproductive Health is a multiprofessional journal that promotes sexual and reproductive health and wellbeing, and best contraceptive practice, worldwide. It publishes research, debate and comment to inform policy and practice, and recognises the importance of professional-patient partnership.\r\n\r\nThe journal was previously known as Journal of Family Planning and Reproductive Health Care."
  },
  {
    "rank": 5911,
    "source_id": "15054",
    "title": "Injury Prevention",
    "type": "journal",
    "issn": "14755785, 13538047",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.878",
    "sjr_quartile": "Q2",
    "h_index": 99,
    "total_docs_2024": 175,
    "total_docs_3years": 317,
    "total_refs": 5569,
    "total_citations_3years": 831,
    "citable_docs_3years": 294,
    "citations_per_doc": "1.96",
    "refs_per_doc": "31.82",
    "female_percent": "51.56",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1995-2025",
    "categories": "Public Health, Environmental and Occupational Health (Q2)",
    "areas": "Medicine",
    "scope": "Since its inception in 1995, Injury Prevention has been the pre-eminent repository of original research and compelling commentary relevant to this increasingly important field. An international peer reviewed journal, it offers the best in science, policy, and public health practice to reduce the burden of injury in all age groups around the world. The journal publishes original research, opinion, debate and special features on the prevention of unintentional, occupational and intentional (violence-related) injuries. Injury Prevention is online only."
  },
  {
    "rank": 6553,
    "source_id": "21100322088",
    "title": "BMJ Supportive and Palliative Care",
    "type": "journal",
    "issn": "2045435X, 20454368",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.820",
    "sjr_quartile": "Q1",
    "h_index": 52,
    "total_docs_2024": 468,
    "total_docs_3years": 650,
    "total_refs": 12652,
    "total_citations_3years": 1345,
    "citable_docs_3years": 564,
    "citations_per_doc": "1.92",
    "refs_per_doc": "27.03",
    "female_percent": "57.01",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2011-2025",
    "categories": "Medical and Surgical Nursing (Q1); Medicine (miscellaneous) (Q2); Oncology (nursing) (Q2)",
    "areas": "Medicine; Nursing",
    "scope": "Published quarterly in print and continuously online, BMJ Supportive & Palliative Care aims to connect many disciplines and specialties throughout the world by providing high quality, clinically relevant research, reviews, comment, information and news of international importance.\r\n\r\nWe hold an inclusive view of supportive and palliative care research and we are able to call on expertise to critique the whole range of methodologies within the subject, including those working in transitional research, clinical trials, epidemiology, behavioural sciences, ethics and health service research. Articles with relevance to clinical practice and clinical service development will be considered for publication.\r\n\r\nIn an international context, many different categories of clinician and healthcare workers do clinical work associated with palliative medicine, specialist or generalist palliative care, supportive care, psychosocial-oncology and end of life care. We wish to engage many specialties, not only those traditionally associated with supportive and palliative care. We hope to extend the readership to doctors, nurses, other healthcare workers and researchers in medical and surgical specialties, including but not limited to cardiology, gastroenterology, geriatrics, neurology, oncology, paediatrics, primary care, psychiatry, psychology, renal medicine, respiratory medicine."
  },
  {
    "rank": 6764,
    "source_id": "15875",
    "title": "Journal of Clinical Pathology",
    "type": "journal",
    "issn": "00219746, 14724146",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.802",
    "sjr_quartile": "Q1",
    "h_index": 158,
    "total_docs_2024": 188,
    "total_docs_3years": 526,
    "total_refs": 5919,
    "total_citations_3years": 1154,
    "citable_docs_3years": 448,
    "citations_per_doc": "1.89",
    "refs_per_doc": "31.48",
    "female_percent": "46.59",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1948-2025",
    "categories": "Pathology and Forensic Medicine (Q1); Medicine (miscellaneous) (Q2)",
    "areas": "Medicine",
    "scope": "Journal of Clinical Pathology (JCP) offers a mix of cutting-edge academic research and practical clinical advice. As one of the few broad scope pathology journals, it enables the busy pathologist to keep up to date with the latest developments in all disciplines of pathology.\r\n\r\nIn addition to original research, JCP publishes a wide range of other content types aimed at the trainee or practising pathologist, including review articles on hot topics, best practice articles for clinical investigations, virtual cases featuring interactive images, in depth summaries of key genes and molecules in pathogenesis, and multi-disciplinary grand rounds cases. Selected articles have accredited online learning modules for self-assessment and CME."
  },
  {
    "rank": 6902,
    "source_id": "29689",
    "title": "Emergency Medicine Journal",
    "type": "journal",
    "issn": "14720213, 14720205",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.789",
    "sjr_quartile": "Q1",
    "h_index": 100,
    "total_docs_2024": 180,
    "total_docs_3years": 653,
    "total_refs": 2849,
    "total_citations_3years": 1048,
    "citable_docs_3years": 456,
    "citations_per_doc": "1.50",
    "refs_per_doc": "15.83",
    "female_percent": "39.60",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1996-2025",
    "categories": "Emergency Medicine (Q1); Critical Care and Intensive Care Medicine (Q2); Medicine (miscellaneous) (Q2)",
    "areas": "Medicine",
    "scope": "The Emergency Medicine Journal is a leading international journal reporting developments and advances in emergency medicine and acute care. It has relevance to all specialties involved in the management of emergencies in the hospital and prehospital environment. Each issue contains editorials, reviews, original research, evidence based reviews, letters and more."
  },
  {
    "rank": 6998,
    "source_id": "21100931312",
    "title": "BMJ Paediatrics Open",
    "type": "journal",
    "issn": "23999772",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.781",
    "sjr_quartile": "Q1",
    "h_index": 35,
    "total_docs_2024": 280,
    "total_docs_3years": 427,
    "total_refs": 8647,
    "total_citations_3years": 979,
    "citable_docs_3years": 397,
    "citations_per_doc": "2.08",
    "refs_per_doc": "30.88",
    "female_percent": "53.24",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2017-2025",
    "categories": "Pediatrics, Perinatology and Child Health (Q1)",
    "areas": "Medicine",
    "scope": "BMJ Paediatrics Open is an open-access journal dedicated to publishing original research, clinical reviews and protocols that deal with any aspect of child health. The provision of child health is multidisciplinary and the journal welcomes papers from all health care professions. Papers dealing with paediatric surgery, paediatric specialties, public health, healthcare provision and qualitative research will all be accepted.\r\n\r\nPublication decisions will be made on the scientific validity, ethical soundness and transparency of the research and whether the paper deserves publication, rather than on its apparent interest to any particular readership.\r\n\r\nWe do not publish studies conducted in animals, case reports or retrospective single centre audits. We do publish pharmacokinetic studies in the paediatric population."
  },
  {
    "rank": 7943,
    "source_id": "21101041869",
    "title": "BMJ Open Science",
    "type": "journal",
    "issn": "23988703",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.711",
    "sjr_quartile": "Q2",
    "h_index": 14,
    "total_docs_2024": 0,
    "total_docs_3years": 23,
    "total_refs": 0,
    "total_citations_3years": 92,
    "citable_docs_3years": 23,
    "citations_per_doc": "2.67",
    "refs_per_doc": "0.00",
    "female_percent": "0.00",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2017-2022",
    "categories": "Medicine (miscellaneous) (Q2)",
    "areas": "Medicine",
    "scope": "BMJ Open Science is an open access, peer-reviewed journal publishing preclinical and basic research that is close to medicine. Our mission is to improve the transparency, integrity and reproducibility of biomedical research. The scope is broad and covers the whole spectrum of preclinical and translational biomedical research.\r\n\r\nWe consider all study types that describe or are relevant to preclinical research, from study protocols through to original research articles, data descriptor articles and systematic reviews. Our editorial policies and partnership initiatives with community projects aim to help the methods, data and results that are published in BMJ Open Science be reproducible. Editors and reviewers will assess manuscripts against scientific and ethical criteria only and will not judge novelty or predict impact."
  },
  {
    "rank": 8054,
    "source_id": "31458",
    "title": "Acupuncture in Medicine",
    "type": "journal",
    "issn": "09645284, 17599873",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.703",
    "sjr_quartile": "Q1",
    "h_index": 57,
    "total_docs_2024": 51,
    "total_docs_3years": 237,
    "total_refs": 1372,
    "total_citations_3years": 446,
    "citable_docs_3years": 150,
    "citations_per_doc": "1.82",
    "refs_per_doc": "26.90",
    "female_percent": "41.62",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1992, 1996-2025",
    "categories": "Complementary and Alternative Medicine (Q1); Medicine (miscellaneous) (Q2); Neurology (clinical) (Q2)",
    "areas": "Medicine",
    "scope": "Acupuncture in Medicine is an international, peer-reviewed journal that aims to promote the scientific understanding of acupuncture and related treatments by publishing scientific investigations of their effectiveness and modes of action as well as articles on their use in health services and clinical practice.\r\n\r\nAcupuncture in Medicine is aimed at Western-trained physicians and other health professionals. The Western understanding of neurophysiology and anatomy is used to interpret the effects of acupuncture. The Journal uses the term ‘Western medical acupuncture’ and largely restricts its published articles to this Western approach. Evidence-based articles on traditional acupuncture (both clinical and theoretical) will, however, be considered. The editorial board welcomes scientific reports, systematic and general reviews, audits, case reports, descriptive and educational papers and other articles that may be of interest to readers."
  },
  {
    "rank": 8759,
    "source_id": "21100897707",
    "title": "Trauma Surgery and Acute Care Open",
    "type": "journal",
    "issn": "23975776",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.656",
    "sjr_quartile": "Q2",
    "h_index": 32,
    "total_docs_2024": 230,
    "total_docs_3years": 311,
    "total_refs": 4687,
    "total_citations_3years": 647,
    "citable_docs_3years": 283,
    "citations_per_doc": "1.69",
    "refs_per_doc": "20.38",
    "female_percent": "42.87",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2016-2025",
    "categories": "Critical Care and Intensive Care Medicine (Q2); Surgery (Q2)",
    "areas": "Medicine",
    "scope": "Trauma Surgery & Acute Care Open is the American Association for the Surgery of Trauma (AAST)’s open access journal dedicated to the rapid publication of peer-reviewed, high-quality trauma and acute care research. Trauma Surgery & Acute Care Open provides an interdisciplinary forum for global issues in trauma and acute care surgery much like its sister journal, Journal of Trauma and Acute Care Surgery. Trauma Surgery & Acute Care Open is dedicated to covering epidemiological, educational, and socioeconomic facets of trauma management and injury prevention and will cover topics of interest and relevance to the global acute care surgery community, as well as affiliated subspecialty physicians and advanced practitioners.\r\n\r\nPapers of interest include:\r\n\r\nReporting of clinical studies\r\nTraining and implementation reports\r\nSurvey-based research\r\nOrthopedic trauma, TBI, injury prevention, public health, global systems development, disaster and mass casualty management\r\nUse of new technologies as they relate to trauma education and treatment\r\nReviews on the following topics: patient management reports in resource-poor settings, pilot studies of new technologies or techniques\r\nClinical case series."
  },
  {
    "rank": 8866,
    "source_id": "18619",
    "title": "Practical Neurology",
    "type": "journal",
    "issn": "14747758, 14747766",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.649",
    "sjr_quartile": "Q2",
    "h_index": 62,
    "total_docs_2024": 138,
    "total_docs_3years": 425,
    "total_refs": 2352,
    "total_citations_3years": 681,
    "citable_docs_3years": 340,
    "citations_per_doc": "1.38",
    "refs_per_doc": "17.04",
    "female_percent": "44.47",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2001-2025",
    "categories": "Medicine (miscellaneous) (Q2); Neurology (clinical) (Q3)",
    "areas": "Medicine",
    "scope": "The essential point of Practical Neurology is that it is practical in the sense of being useful for everyone who sees neurological patients and who wants to keep up to date, and safe, in managing them. In other words this is a journal for jobbing neurologists – which most of us are for at least part of our time – who plough through the tension headaches and funny turns week in and week out."
  },
  {
    "rank": 9532,
    "source_id": "21100932737",
    "title": "BMJ Open Quality",
    "type": "journal",
    "issn": "23996641",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.608",
    "sjr_quartile": "Q2",
    "h_index": 26,
    "total_docs_2024": 252,
    "total_docs_3years": 754,
    "total_refs": 7244,
    "total_citations_3years": 1342,
    "citable_docs_3years": 747,
    "citations_per_doc": "1.73",
    "refs_per_doc": "28.75",
    "female_percent": "61.19",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2025",
    "categories": "Health Policy (Q2); Leadership and Management (Q2); Public Health, Environmental and Occupational Health (Q2)",
    "areas": "Medicine; Nursing",
    "scope": "BMJ Open Quality is dedicated to publishing high quality, peer reviewed healthcare improvement work. Articles covering original research, local, national and international QI projects, value-based healthcare improvement initiatives and educational improvement work are all considered.\r\n\r\nBMJ Open Quality uses continuous publication online, to ensure timely, up-to-date knowledge is available worldwide. The journal adheres to a rigorous and transparent peer review process and papers are considered on the basis of methodological soundness rather than priority or novelty."
  },
  {
    "rank": 11497,
    "source_id": "21100782252",
    "title": "BMJ Innovations",
    "type": "journal",
    "issn": "2055642X, 20558074",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.505",
    "sjr_quartile": "Q3",
    "h_index": 28,
    "total_docs_2024": 18,
    "total_docs_3years": 184,
    "total_refs": 496,
    "total_citations_3years": 327,
    "citable_docs_3years": 166,
    "citations_per_doc": "1.62",
    "refs_per_doc": "27.56",
    "female_percent": "37.25",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2015-2025",
    "categories": "Medicine (miscellaneous) (Q3)",
    "areas": "Medicine",
    "scope": "Healthcare is undergoing a revolution and novel medical technologies are being developed to treat patients in better and faster ways. Mobile revolution has put a handheld computer in pockets of billions and we are ushering in an era of mHealth. In developed and developing world alike healthcare costs are a concern and frugal innovations are being promoted for bringing down the costs of healthcare.\r\n\r\nBMJ Innovations aims to promote innovative research which creates new, cost-effective medical devices, technologies, processes and systems that improve patient care, with particular focus on the needs of patients, physicians, and the health care industry as a whole and act as a platform to catalyse and seed more innovations.\r\n\r\nSubmissions to BMJ Innovations will be considered from all clinical areas of medicine along with business and process innovations that make healthcare accessible and affordable. Submissions from groups of investigators engaged in international collaborations are especially encouraged.\r\n\r\nThe broad areas of innovations that this journal aims to chronicle include but are not limited to:\r\n\r\nMedical devices,\r\nmHealth and wearable health technologies,\r\nAssistive technologies,\r\nDiagnostics,\r\nHealth IT, systems and process innovation."
  },
  {
    "rank": 12043,
    "source_id": "17832",
    "title": "Medical Humanities",
    "type": "journal",
    "issn": "14734265, 1468215X",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.477",
    "sjr_quartile": "Q1",
    "h_index": 37,
    "total_docs_2024": 54,
    "total_docs_3years": 252,
    "total_refs": 3416,
    "total_citations_3years": 350,
    "citable_docs_3years": 241,
    "citations_per_doc": "1.27",
    "refs_per_doc": "63.26",
    "female_percent": "64.96",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1997, 2000-2025",
    "categories": "Philosophy (Q1); Pathology and Forensic Medicine (Q2)",
    "areas": "Arts and Humanities; Medicine",
    "scope": "Medical Humanities presents the international conversation around medicine and its engagement with the humanities and arts, social sciences, health policy, medical education, patient experience and the public at large. Led by Dr Brandy Schillace, the journal publishes scholarly and critical articles on a broad range of topics. These include history of medicine, cultures of medicine, disability studies, gender and the body, communities in crisis, bioethics, and public health."
  },
  {
    "rank": 13333,
    "source_id": "21100901775",
    "title": "BMJ Simulation and Technology Enhanced Learning",
    "type": "journal",
    "issn": "20566697",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.420",
    "sjr_quartile": "Q2",
    "h_index": 20,
    "total_docs_2024": 0,
    "total_docs_3years": 135,
    "total_refs": 0,
    "total_citations_3years": 207,
    "citable_docs_3years": 117,
    "citations_per_doc": "0.00",
    "refs_per_doc": "0.00",
    "female_percent": "0.00",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2015-2021",
    "categories": "Education (Q2); Health Informatics (Q3); Modeling and Simulation (Q3)",
    "areas": "Mathematics; Medicine; Social Sciences",
    "scope": "BMJ Simulation & Technology Enhanced Learning (BMJ STEL) provides a forum to share scholarly practices to advance the use of simulation and technology enhanced learning in the context of health and social care. This includes knowledge translation to improve clinical outcomes, health systems, patient experience and safety.\r\n\r\nBMJ STEL seeks to contribute to research,innovation and knowledge translation drawing on diverse disciplines spanning science,technology, engineering and medicine, alongside the arts, humanities and social sciences."
  },
  {
    "rank": 13424,
    "source_id": "21101041948",
    "title": "BMJ Surgery, Interventions, and Health Technologies",
    "type": "journal",
    "issn": "26314940",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.416",
    "sjr_quartile": "Q2",
    "h_index": 11,
    "total_docs_2024": 14,
    "total_docs_3years": 64,
    "total_refs": 347,
    "total_citations_3years": 113,
    "citable_docs_3years": 57,
    "citations_per_doc": "1.77",
    "refs_per_doc": "24.79",
    "female_percent": "32.73",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2019-2025",
    "categories": "Surgery (Q2); Biomedical Engineering (Q3)",
    "areas": "Engineering; Medicine",
    "scope": "BMJ Surgery, Interventions, & Health Technologies is an open access journal that publishes original research on complex healthcare interventions. Intended to encourage higher standards of science and more rapid dissemination of new knowledge in the field, it provides a high-impact international platform for both early and later stage clinical studies as well as long-term assessment and surveillance studies that meet high standards of design and reporting. It actively promotes the adoption of an IDEAL-based model of an evaluation framework and encourages the submission of studies at progressive stages, with a focus on device-based surgical and invasive treatments."
  },
  {
    "rank": 13589,
    "source_id": "21100939696",
    "title": "BMJ Leader",
    "type": "journal",
    "issn": "2398631X",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.409",
    "sjr_quartile": "Q3",
    "h_index": 19,
    "total_docs_2024": 110,
    "total_docs_3years": 276,
    "total_refs": 3036,
    "total_citations_3years": 363,
    "citable_docs_3years": 193,
    "citations_per_doc": "1.04",
    "refs_per_doc": "27.60",
    "female_percent": "53.95",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2017-2025",
    "categories": "Health Policy (Q3); Leadership and Management (Q3); Strategy and Management (Q3)",
    "areas": "Business, Management and Accounting; Medicine; Nursing",
    "scope": "BMJ Leader is an international, peer-reviewed, online-only journal focusing on leadership in health and care.\r\n\r\nOur overarching purpose is to improve the results and experience delivered by health and care systems for their patients, populations and workforces. To deliver on this purpose, we help to build better leaders – people who are rounded, resilient and equipped with effective leadership skills and knowledge. Just as importantly, we nurture a community of leaders by improving connectivity and encouraging debate.\r\n\r\nBMJ Leader showcases original research and reviews, interpretations of the evidence base, and reflections and debate by practitioners on the key themes of leadership. It is the place to find and contribute evidence, reflection and discussion on the many disciplines that drive leadership in health and care.\r\n\r\nBMJ Leader adheres to the highest possible industry standards concerning publication ethics. To read the journal’s detailed guidelines please see our policies.\r\n\r\nBMJ Leader is the official journal of the Faculty of Medical Leadership and Management."
  },
  {
    "rank": 13684,
    "source_id": "21100982276",
    "title": "BMJ Military Health",
    "type": "journal",
    "issn": "26333775, 26333767",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.405",
    "sjr_quartile": "Q3",
    "h_index": 37,
    "total_docs_2024": 214,
    "total_docs_3years": 441,
    "total_refs": 4449,
    "total_citations_3years": 538,
    "citable_docs_3years": 342,
    "citations_per_doc": "1.27",
    "refs_per_doc": "20.79",
    "female_percent": "32.46",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2025",
    "categories": "Medicine (miscellaneous) (Q3)",
    "areas": "Medicine",
    "scope": "BMJ Military Health is the home of research, reviews and commentary on the key issues in military health from around the globe. Lessons learned from more than a century’s conflicts are supplemented by up to the minute evidence from current practitioners the world over."
  },
  {
    "rank": 13754,
    "source_id": "14492",
    "title": "Archives of Disease in Childhood: Education and Practice Edition",
    "type": "journal",
    "issn": "17430593, 17430585",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.401",
    "sjr_quartile": "Q2",
    "h_index": 43,
    "total_docs_2024": 76,
    "total_docs_3years": 359,
    "total_refs": 1090,
    "total_citations_3years": 260,
    "citable_docs_3years": 240,
    "citations_per_doc": "0.60",
    "refs_per_doc": "14.34",
    "female_percent": "66.23",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2004-2025",
    "categories": "Pediatrics, Perinatology and Child Health (Q2)",
    "areas": "Medicine",
    "scope": "Archives of Disease in Childhood is an international peer review journal that aims to keep paediatricians and others up to date with advances in the diagnosis and treatment of childhood diseases as well as advocacy issues such as child protection. It focuses on all aspects of child health and disease from the perinatal period (in the Fetal and Neonatal edition) through to adolescence. ADC includes original research reports, commentaries, reviews of clinical and policy issues, and evidence reports. Areas covered include: community child health, public health, epidemiology, acute paediatrics, advocacy, and ethics."
  },
  {
    "rank": 15403,
    "source_id": "21101040222",
    "title": "World Journal of Pediatric Surgery",
    "type": "journal",
    "issn": "25165410",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.341",
    "sjr_quartile": "Q3",
    "h_index": 8,
    "total_docs_2024": 39,
    "total_docs_3years": 121,
    "total_refs": 2010,
    "total_citations_3years": 158,
    "citable_docs_3years": 109,
    "citations_per_doc": "1.34",
    "refs_per_doc": "51.54",
    "female_percent": "39.41",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2018-2024",
    "categories": "Pediatrics, Perinatology and Child Health (Q3); Surgery (Q3)",
    "areas": "Medicine",
    "scope": "World Journal of Pediatric Surgery (WJPS) strives to become one of the most credible, authoritative resources publishing significant findings and cutting-edge results in pediatric surgery. WJPS publishes high-quality original research, reviews, and perspectives related to all aspects of pediatric surgery.\r\n\r\nThe journal is particularly interested in interdisciplinary studies including, but not limited to, minimally invasive techniques, robotic surgery, molecular imaging, precision surgery, 3D printing, artificial intelligence, new materials and medical instruments."
  },
  {
    "rank": 15590,
    "source_id": "27689",
    "title": "Evidence-Based Nursing",
    "type": "journal",
    "issn": "13676539, 14689618",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.334",
    "sjr_quartile": "Q3",
    "h_index": 36,
    "total_docs_2024": 274,
    "total_docs_3years": 438,
    "total_refs": 1520,
    "total_citations_3years": 166,
    "citable_docs_3years": 43,
    "citations_per_doc": "0.34",
    "refs_per_doc": "5.55",
    "female_percent": "45.00",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1998-2025",
    "categories": "Fundamentals and Skills (Q3)",
    "areas": "Nursing",
    "scope": "Evidence-Based Nursing systematically searches a wide range of international healthcare journals applying strict criteria for the validity of research and relevance to best nursing practice. Content is critically appraised and the most relevant articles are summarised into succinct expert commentaries, focusing on the papers’ key findings and implications for nursing practice."
  },
  {
    "rank": 16929,
    "source_id": "21101078839",
    "title": "Gynecology and Obstetrics Clinical Medicine",
    "type": "journal",
    "issn": "26671646, 20970587",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.291",
    "sjr_quartile": "Q3",
    "h_index": 6,
    "total_docs_2024": 42,
    "total_docs_3years": 129,
    "total_refs": 1161,
    "total_citations_3years": 116,
    "citable_docs_3years": 112,
    "citations_per_doc": "1.11",
    "refs_per_doc": "27.64",
    "female_percent": "58.46",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2021-2025",
    "categories": "Obstetrics and Gynecology (Q3); Reproductive Medicine (Q3)",
    "areas": "Medicine",
    "scope": "Gynecology and Obstetrics Clinical Medicine is an open access journal which covers the full spectrum of obstetrics and gynecology research. The aim of the Journal is to publish original research (clinical and translational), specifically new developments and breakthroughs in gynecology oncology, oncofertility, pelvic medicine, maternal-fetal health care, reproductive medicine, public health, disease prevention, and cutting-edge research of obstetrics and gynecology worldwide. The journal is also devoted to the publication of clinical and investigative articles to promote the application of new advances and techniques in gynecology and obstetrics.\r\n\r\nContributions falling into the following categories will be considered for publication: research paper, review article, short communication, editorials, short review, case report, practice guidelines, opinion paper, etc. that will have an impact on the understanding of health and disease and that has the potential to change the practice of women's health care."
  },
  {
    "rank": 20137,
    "source_id": "19700201654",
    "title": "BMJ Case Reports",
    "type": "journal",
    "issn": "1757790X",
    "publisher": "BMJ Publishing Group",
    "open_access": true,
    "sjr": "0.219",
    "sjr_quartile": "Q4",
    "h_index": 45,
    "total_docs_2024": 1725,
    "total_docs_3years": 6647,
    "total_refs": 26577,
    "total_citations_3years": 3524,
    "citable_docs_3years": 6153,
    "citations_per_doc": "0.44",
    "refs_per_doc": "15.41",
    "female_percent": "40.85",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "2008-2025",
    "categories": "Medicine (miscellaneous) (Q4)",
    "areas": "Medicine",
    "scope": "BMJ Case Reports is an important educational resource offering a high volume of cases in all disciplines so that healthcare professionals, researchers and others can easily find clinically important information on common and rare conditions. All articles are peer reviewed and copy edited before publication. BMJ Case Reports is not an edition or supplement of the BMJ."
  },
  {
    "rank": 21105,
    "source_id": "20767",
    "title": "Drug and Therapeutics Bulletin",
    "type": "journal",
    "issn": "00126543, 17555248",
    "publisher": "BMJ Publishing Group",
    "open_access": false,
    "sjr": "0.201",
    "sjr_quartile": "Q3",
    "h_index": 17,
    "total_docs_2024": 79,
    "total_docs_3years": 262,
    "total_refs": 939,
    "total_citations_3years": 98,
    "citable_docs_3years": 131,
    "citations_per_doc": "0.40",
    "refs_per_doc": "11.89",
    "female_percent": "42.59",
    "country": "United Kingdom",
    "region": "Western Europe",
    "coverage": "1965-2025",
    "categories": "Pharmacology (medical) (Q3); Medicine (miscellaneous) (Q4)",
    "areas": "Medicine",
    "scope": "Drug and Therapeutics Bulletin is a peer-reviewed journal that provides independent evaluations of, and practical advice on, individual treatments and the overall management of disease for doctors, pharmacists and other healthcare professionals.  DTB summarises the best available evidence to enable readers to make informed and unbiased choices regarding medicines and other treatments to help patients get the best care. DTB content includes opinion pieces, commentaries, summaries of recently published evidence as well as clinical reviews and articles on new medicines."
  }
]