{
  "metadata": {
    "source": "Scimago Journal Rankings",
    "publisher": "World Scientific",
    "totalJournals": 148,
    "lastUpdated": "2025-11-26T11:48:55.139917",
    "version": "1.0"
  },
  "journals": [
    {
      "id": "24598",
      "title": "Mathematical Models and Methods in Applied Sciences",
      "issn": [
        "02182025",
        "17936314"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.991,
        "sjrQuartile": "Q1",
        "hIndex": 97,
        "totalDocs2024": 70,
        "totalDocs3Years": 222,
        "citationsPerDoc": 3.02,
        "totalCitations3Years": 741
      },
      "scope": "The purpose of this journal is to provide a medium of exchange for scientists engaged in applied sciences (physics, mathematical physics, natural, and technological sciences) where there exists a non-trivial interplay between mathematics, mathematical modelling of real systems and mathematical and computer methods oriented towards the qualitative and quantitative analysis of real physical systems. The principal areas of interest of this journal are the following: 1.Mathematical modelling of systems in applied sciences; 2.Mathematical methods for the qualitative and quantitative analysis of models of mathematical physics and technological sciences; 3.Numerical and computer treatment of mathematical models or real systems. Special attention will be paid to the analysis of nonlinearities and stochastic aspects. Within the above limitation, scientists in all fields which employ mathematics are encouraged to submit research and review papers to the journal. Both theoretical and applied papers will be considered for publication. High quality, novelty of the content and potential for the applications to modern problems in applied sciences and technology will be the guidelines for the selection of papers to be published in the journal. This journal publishes only articles with original and innovative contents. Book reviews, announcements and tutorial articles will be featured occasionally.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q1"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 1449
    },
    {
      "id": "24309",
      "title": "International Journal of Neural Systems",
      "issn": [
        "01290657",
        "17936462"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.579,
        "sjrQuartile": "Q1",
        "hIndex": 79,
        "totalDocs2024": 75,
        "totalDocs3Years": 227,
        "citationsPerDoc": 7.05,
        "totalCitations3Years": 1527
      },
      "scope": "The International Journal of Neural Systems is a monthly rigorously peer-reviewed transdisciplinary journal which covers information processing in natural and artificial neural systems. Subjects of special interests are machine learning, computational neuroscience and neurology, and innovative and high-impact articles that cross multiple fields including neurosciences and computer science and engineering. Authors are strongly encouraged to review recent issues of the journal before submission. The journal presents a fresh, undogmatic attitude towards this multi-disciplinary field, aiming to be a forum for novel ideas and improved understanding of collective and cooperative phenomena in systems with computational capabilities.",
      "categories": [
        {
          "name": "Computer Networks and Communications",
          "quartile": "Q1"
        },
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Computer Science",
        "Medicine"
      ],
      "country": "Singapore",
      "coverage": "1993-1997, 1999-2025",
      "rank": 2183
    },
    {
      "id": "74973",
      "title": "Communications in Contemporary Mathematics",
      "issn": [
        "17936683",
        "02191997"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.245,
        "sjrQuartile": "Q1",
        "hIndex": 52,
        "totalDocs2024": 111,
        "totalDocs3Years": 301,
        "citationsPerDoc": 1.31,
        "totalCitations3Years": 391
      },
      "scope": "With traditional boundaries between various specialized fields of mathematics becoming less and less visible, Communications in Contemporary Mathematics (CCM) presents the forefront of research in the fields of: Algebra, Analysis, Applied Mathematics, Dynamical Systems, Geometry, Mathematical Physics, Number Theory, Partial Differential Equations and Topology, among others. It provides a forum to stimulate interactions between different areas. Both original research papers and expository articles will be published.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q1"
        },
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1999-2025",
      "rank": 3333
    },
    {
      "id": "19700172204",
      "title": "Analysis and Applications",
      "issn": [
        "17936861",
        "02195305"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.144,
        "sjrQuartile": "Q1",
        "hIndex": 29,
        "totalDocs2024": 56,
        "totalDocs3Years": 124,
        "citationsPerDoc": 2.41,
        "totalCitations3Years": 286
      },
      "scope": "Analysis and Applications publishes high quality mathematical papers that treat those parts of analysis which have direct or potential applications to the physical and biological sciences and engineering. Some of the topics from analysis include approximation theory, asymptotic analysis, calculus of variations, integral equations, integral transforms, ordinary and partial differential equations, delay differential equations, and perturbation methods. The primary aim of the journal is to encourage the development of new techniques and results in applied analysis.",
      "categories": [
        {
          "name": "Analysis",
          "quartile": "Q1"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2010-2025",
      "rank": 3857
    },
    {
      "id": "12000154480",
      "title": "Journal of Mathematical Logic",
      "issn": [
        "17936691",
        "02190613"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.129,
        "sjrQuartile": "Q1",
        "hIndex": 17,
        "totalDocs2024": 34,
        "totalDocs3Years": 75,
        "citationsPerDoc": 0.96,
        "totalCitations3Years": 66
      },
      "scope": "The Journal of Mathematical Logic (JML) provides an important forum for the communication of original contributions in all areas of mathematical logic and its applications. It aims at publishing papers at the highest level of mathematical creativity and sophistication. JML intends to represent the most important and innovative developments in the subject.",
      "categories": [
        {
          "name": "Logic",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2007-2025",
      "rank": 3952
    },
    {
      "id": "18134",
      "title": "American Journal of Chinese Medicine",
      "issn": [
        "0192415X",
        "17936853"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.09,
        "sjrQuartile": "Q1",
        "hIndex": 82,
        "totalDocs2024": 98,
        "totalDocs3Years": 288,
        "citationsPerDoc": 5.8,
        "totalCitations3Years": 1696
      },
      "scope": "The American Journal of Chinese Medicine, which is defined in its broadest sense possible, publishes original articles and essays relating to traditional or ethnomedicine of all cultures. Areas of particular interest include: Basic scientific and clinical research in indigenous medical techniques, therapeutic procedures, medicinal plants, and traditional medical theories and concepts; Multidisciplinary study of medical practice and health care, especially from historical, cultural, public health, and socioeconomic perspectives; International policy implications of comparative studies of medicine in all cultures, including such issues as health in developing countries, affordability and transferability of health-care techniques and concepts; Translating scholarly ancient texts or modern publications on ethnomedicine. The American Journal of Chinese Medicine will consider for publication a broad range of scholarly contributions, including original scientific research papers, review articles, editorial comments, social policy statements, brief news items, bibliographies, research guides, letters to the editors, book reviews, and selected reprints.",
      "categories": [
        {
          "name": "Complementary and Alternative Medicine",
          "quartile": "Q1"
        },
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Medicine"
      ],
      "country": "Singapore",
      "coverage": "1974-1977, 1979-2025",
      "rank": 4192
    },
    {
      "id": "21100975685",
      "title": "Annals of Financial Economics",
      "issn": [
        "20104952",
        "20104960"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 1.088,
        "sjrQuartile": "Q1",
        "hIndex": 19,
        "totalDocs2024": 15,
        "totalDocs3Years": 76,
        "citationsPerDoc": 4.58,
        "totalCitations3Years": 348
      },
      "scope": "The AFE is an international journal with the goal of advancing the knowledge and understanding of the practice of financial economics through the publication of a high-quality and practitioner-relevant journal. This journal offers a specialized forum for applied research on investments in various financial markets, market microstructures, asset pricing and regulation of financial markets. Papers employing econometric or empirical methods in the research design and focusing on empirical testing of both financial theories and applications in financial economics are encouraged. This journal is not suitable for papers devoted solely to pure theory or survey articles with inadequate econometric analysis. The AFE serves as a bridge between academic research and practice by seeking academically rigorous papers that have direct relevance to practitioners, a forum for presenting the perspectives of practitioners, academics and regulators on financial economics and its applications.",
      "categories": [
        {
          "name": "Business and International Management",
          "quartile": "Q1"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q1"
        },
        {
          "name": "Finance",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2005-2009, 2011-2024",
      "rank": 4203
    },
    {
      "id": "23347",
      "title": "Journal of Environmental Assessment Policy and Management",
      "issn": [
        "17575605",
        "14643332"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.907,
        "sjrQuartile": "Q1",
        "hIndex": 36,
        "totalDocs2024": 20,
        "totalDocs3Years": 52,
        "citationsPerDoc": 2.93,
        "totalCitations3Years": 251
      },
      "scope": "The journal welcomes original papers from academics and practitioners alike, and particularly encourages submissions that draw on experience from legal and policy analysis, case studies, case law and sectoral studies. Appropriate review papers are also encouraged from time to time. Papers should generally be 5000-7000 words, though more substantial papers will be considered. Contributions reflect the interdisciplinary emphasis which is fundamental to the journal. Papers will be double-blind refereed using an appropriate cross-section of reviewers drawn from the target interests. The journal aims for a turn-around time of six months from submission to publication to ensure rapid dissemination and dynamic discussion of ideas and results. Book reviews are also included. JEAPM will be of interest to academics working in interdisciplinary fields across the social, natural and engineering sciences; policy and decision makers in national and local government and relevant agencies; environmental consultants; business strategists and managers concerned with environmental performance and improvement; and environmental and consumer non-governmental organisations. The Editorial Board provides a unique mix of expertise from both the academic community and a full range of interested parties.",
      "categories": [
        {
          "name": "Geography, Planning and Development",
          "quartile": "Q1"
        },
        {
          "name": "Management, Monitoring, Policy and Law",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Environmental Science",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2003-2025",
      "rank": 5632
    },
    {
      "id": "21100409617",
      "title": "Bulletin of Mathematical Sciences",
      "issn": [
        "16643607",
        "16643615"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.855,
        "sjrQuartile": "Q1",
        "hIndex": 24,
        "totalDocs2024": 22,
        "totalDocs3Years": 54,
        "citationsPerDoc": 2.56,
        "totalCitations3Years": 106
      },
      "scope": "The Bulletin of Mathematical Sciences, a peer-reviewed, open access journal, will publish original research work of highest quality and of broad interest in all branches of mathematical sciences. The Bulletin will publish well-written expository articles (40-50 pages) of exceptional value giving the latest state of the art on a specific topic, and short articles (up to 15 pages) containing significant results of wider interest. Most of the expository articles will be invited. The Bulletin of Mathematical Sciences is launched by King Abdulaziz University, Jeddah, Saudi Arabia.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q1"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2011-2025",
      "rank": 6152
    },
    {
      "id": "6100153017",
      "title": "Journal of Hyperbolic Differential Equations",
      "issn": [
        "17936993",
        "02198916"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.733,
        "sjrQuartile": "Q1",
        "hIndex": 36,
        "totalDocs2024": 28,
        "totalDocs3Years": 76,
        "citationsPerDoc": 1.02,
        "totalCitations3Years": 68
      },
      "scope": "This journal publishes original research papers on nonlinear hyperbolic problems and related topics, of mathematical and/or physical interest. Specifically, it invites papers on the theory and numerical analysis of hyperbolic conservation laws and of hyperbolic partial differential equations arising in mathematical physics. The Journal welcomes contributions in: Theory of nonlinear hyperbolic systems of conservation laws, addressing the issues of well-posedness and qualitative behavior of solutions, in one or several space dimensions. Hyperbolic differential equations of mathematical physics, such as the Einstein equations of general relativity, Dirac equations, Maxwell equations, relativistic fluid models, etc. Lorentzian geometry, particularly global geometric and causal theoretic aspects of spacetimes satisfying the Einstein equations. Nonlinear hyperbolic systems arising in continuum physics such as: hyperbolic models of fluid dynamics, mixed models of transonic flows, etc. General problems that are dominated (but not exclusively driven) by finite speed phenomena, such as dissipative and dispersive perturbations of hyperbolic systems, and models from statistical mechanics and other probabilistic models relevant to the derivation of fluid dynamical equations. Convergence analysis of numerical methods for hyperbolic equations: finite difference schemes, finite volumes schemes, etc.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q1"
        },
        {
          "name": "Analysis",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2004-2024",
      "rank": 7637
    },
    {
      "id": "21100827839",
      "title": "Unmanned Systems",
      "issn": [
        "23013850",
        "23013869"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.731,
        "sjrQuartile": "Q1",
        "hIndex": 32,
        "totalDocs2024": 146,
        "totalDocs3Years": 83,
        "citationsPerDoc": 4.07,
        "totalCitations3Years": 362
      },
      "scope": "An unmanned system is a machine or device that is equipped with necessary data processing units, sensors, automatic control, and communications systems and is capable of performing missions autonomously without human intervention. Unmanned systems include unmanned aircraft, ground robots, underwater explorers, satellites, and other unconventional structures. Unmanned Systems (US) aims to cover all subjects related to the development of automatic machine systems, which include advanced technologies in unmanned hardware platforms (aerial, ground, underwater and unconventional platforms), unmanned software systems, energy systems, modeling and control, communications systems, computer vision systems, sensing and information processing, navigation and path planning, computing, information fusion, multi-agent systems, mission management, machine intelligence, artificial intelligence, and innovative application case studies. US welcomes original manuscripts in the following categories: research papers, which disseminate scientific findings contributing to solving technical issues underlying the development of unmanned systems; review articles and state-of-the-art surveys, which describe the latest in basic theories, principles, and innovative applications; short articles, which discuss the latest significant achievements and the future trends; and book reviews. Special issues related to the topics of US are welcome. A short proposal should be sent to the Editors-in-Chief. It should include a tentative title; the information of the Guest Editor(s); purpose and scope; possible contributors; and a tentative timetable. If the proposal is accepted, the Guest Editor(s) will be responsible for the special issue and should follow the normal US review process. Copies of the reviewed papers and the reviewers' comments should be given to the Editors-in-Chief for recording purposes.",
      "categories": [
        {
          "name": "Aerospace Engineering",
          "quartile": "Q1"
        },
        {
          "name": "Automotive Engineering",
          "quartile": "Q1"
        },
        {
          "name": "Control and Optimization",
          "quartile": "Q1"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Engineering",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2013-2025",
      "rank": 7670
    },
    {
      "id": "98456",
      "title": "International Journal of Structural Stability and Dynamics",
      "issn": [
        "02194554",
        "17936764"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.701,
        "sjrQuartile": "Q1",
        "hIndex": 56,
        "totalDocs2024": 605,
        "totalDocs3Years": 739,
        "citationsPerDoc": 4.41,
        "totalCitations3Years": 3039
      },
      "scope": "The aim of this journal is to provide a unique forum for the publication and rapid dissemination of original research on stability and dynamics of structures. Papers that deal with conventional land-based structures, aerospace structures, marine structures, as well as biostructures and micro- and nano-structures are considered. Papers devoted to all aspects of structural stability and dynamics (both transient and vibration response), ranging from mathematical formulations, novel methods of solutions, to experimental investigations and practical applications in civil, mechanical, aerospace, marine, bio- and nano-engineering will be published. The important subjects of structural stability and structural dynamics are placed together in this journal because they share somewhat fundamental elements. In recognition of the considerable research interests and recent proliferation of papers in these subjects, it is hoped that the journal may help bring together papers focused on related subjects, including the state-of-the-art surveys, so as to provide a more effective medium for disseminating the latest developments to researchers and engineers. This journal features a section for technical notes that allows researchers to publish their initial findings or new ideas more speedily. Discussions of papers and concepts will also be published so that researchers can have a vibrant and timely communication with others.",
      "categories": [
        {
          "name": "Building and Construction",
          "quartile": "Q1"
        },
        {
          "name": "Ocean Engineering",
          "quartile": "Q1"
        },
        {
          "name": "Aerospace Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Civil and Structural Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Mechanical Engineering",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Engineering",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2004-2025",
      "rank": 8079
    },
    {
      "id": "29716",
      "title": "Reviews in Mathematical Physics",
      "issn": [
        "17936659",
        "0129055X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.695,
        "sjrQuartile": "Q2",
        "hIndex": 57,
        "totalDocs2024": 87,
        "totalDocs3Years": 150,
        "citationsPerDoc": 1.44,
        "totalCitations3Years": 251
      },
      "scope": "Reviews in Mathematical Physics fills the need for a review journal in the field, but also accepts original research papers of high quality. The review papers - introductory and survey papers - are of relevance not only to mathematical physicists, but also to mathematicians and theoretical physicists interested in interdisciplinary topics. Original research papers are not subject to page limitations provided they are of importance to this readership. It is desirable that such papers have an expository part understandable to a wider readership than experts. Papers with the character of a scientific letter are usually not suitable for RMP.",
      "categories": [
        {
          "name": "Mathematical Physics",
          "quartile": "Q2"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 8175
    },
    {
      "id": "19900192310",
      "title": "International Journal of Applied Mechanics",
      "issn": [
        "17588251",
        "1758826X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.665,
        "sjrQuartile": "Q2",
        "hIndex": 55,
        "totalDocs2024": 125,
        "totalDocs3Years": 332,
        "citationsPerDoc": 3.11,
        "totalCitations3Years": 1021
      },
      "scope": "The journal has as its objective the publication and wide electronic dissemination of innovative and consequential research in applied mechanics. IJAM welcomes high-quality original research papers in all aspects of applied mechanics from contributors throughout the world. The journal aims to promote the international exchange of new knowledge and recent development information in all aspects of applied mechanics. In addition to covering the classical branches of applied mechanics, namely solid mechanics, fluid mechanics, thermodynamics, and material science, the journal also encourages contributions from newly emerging areas such as biomechanics, electromechanics, the mechanical behavior of advanced materials, nanomechanics, and many other inter-disciplinary research areas in which the concepts of applied mechanics are extensively applied and developed.",
      "categories": [
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Mechanical Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Mechanics of Materials",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science"
      ],
      "country": "Singapore",
      "coverage": "2009-2025",
      "rank": 8612
    },
    {
      "id": "28472",
      "title": "Fractals",
      "issn": [
        "17936543",
        "0218348X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.636,
        "sjrQuartile": "Q1",
        "hIndex": 70,
        "totalDocs2024": 272,
        "totalDocs3Years": 1093,
        "citationsPerDoc": 3.1,
        "totalCitations3Years": 3384
      },
      "scope": "The investigation of phenomena involving complex geometry, patterns and scaling has gone through a spectacular development and applications in the past decades. For this relatively short time, geometrical and/or temporal scaling have been shown to represent the common aspects of many processes occurring in an unusually diverse range of fields including physics, mathematics, biology, chemistry, economics, engineering and technology, and human behavior. As a rule, the complex nature of a phenomenon is manifested in the underlying intricate geometry which in most of the cases can be described in terms of objects with non-integer (fractal) dimension. In other cases, the distribution of events in time or various other quantities show specific scaling behavior, thus providing a better understanding of the relevant factors determining the given processes. Using fractal geometry and scaling as a language in the related theoretical, numerical and experimental investigations, it has been possible to get a deeper insight into previously intractable problems. Among many others, a better understanding of growth phenomena, turbulence, iterative functions, colloidal aggregation, biological pattern formation, stock markets and inhomogeneous materials has emerged through the application of such concepts as scale invariance, self-affinity and multifractality. The main challenge of the journal devoted exclusively to the above kinds of phenomena lies in its interdisciplinary nature; it is our commitment to bring together the most recent developments in these fields so that a fruitful interaction of various approaches and scientific views on complex spatial and temporal behaviors in both nature and society could take place.",
      "categories": [
        {
          "name": "Multidisciplinary",
          "quartile": "Q1"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Geometry and Topology",
          "quartile": "Q2"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics",
        "Multidisciplinary"
      ],
      "country": "Singapore",
      "coverage": "1995-2025",
      "rank": 9065
    },
    {
      "id": "21100821159",
      "title": "Climate Change Economics",
      "issn": [
        "20100086",
        "20100078"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.628,
        "sjrQuartile": "Q2",
        "hIndex": 35,
        "totalDocs2024": 34,
        "totalDocs3Years": 74,
        "citationsPerDoc": 2.63,
        "totalCitations3Years": 192
      },
      "scope": "Climate Change Economics (CCE) publishes theoretical and empirical papers devoted to analyses of mitigation, adaptation, impacts, and other issues related to the policy and management of greenhouse gases. CCE is specifically devoted to papers in economics although it is understood that authors may need to rely on other fields for important insights. The journal is interested in papers examining the issue at every scale from local to global and papers from around the world are encouraged. CCE is also interested in both original research and review papers and welcomes comments discussing previous articles.",
      "categories": [
        {
          "name": "Economics and Econometrics",
          "quartile": "Q2"
        },
        {
          "name": "Management, Monitoring, Policy and Law",
          "quartile": "Q2"
        },
        {
          "name": "Global and Planetary Change",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance",
        "Environmental Science"
      ],
      "country": "Singapore",
      "coverage": "2010-2024",
      "rank": 9208
    },
    {
      "id": "23244",
      "title": "International Journal of Mathematics",
      "issn": [
        "17936519",
        "0129167X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.618,
        "sjrQuartile": "Q2",
        "hIndex": 47,
        "totalDocs2024": 102,
        "totalDocs3Years": 328,
        "citationsPerDoc": 0.69,
        "totalCitations3Years": 228
      },
      "scope": "The International Journal of Mathematics publishes original papers in mathematics in general, but giving a preference to those in the areas of mathematics represented by the editorial board. The journal has been published monthly except in June and December to bring out new results without delay. Occasionally, expository papers of exceptional value may also be published. The first issue appeared in March 1990.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 9385
    },
    {
      "id": "21101021536",
      "title": "Journal of Industrial Integration and Management",
      "issn": [
        "24248630",
        "24248622"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.597,
        "sjrQuartile": "Q1",
        "hIndex": 30,
        "totalDocs2024": 36,
        "totalDocs3Years": 90,
        "citationsPerDoc": 5.86,
        "totalCitations3Years": 464
      },
      "scope": "The Journal of Industrial Integration and Management: Innovation & Entrepreneurship focuses on the technological innovation and entrepreneurship of the current transition towards industrial integration and informatization. This journal aims to provide insights into challenges, issues, and solutions related to industrial integration and industrial informatization through an interdisciplinary forum for researchers, practitioners, and policy makers from perspectives of innovation and entrepreneurship. The Journal of Industrial Integration and Management: Innovation & Entrepreneurship welcomes papers on innovation and entrepreneurship related to industrial integration and informatization. Empirical research and case study methods, as well as techniques developed in the mathematical sciences, computer science, manufacturing engineering, and industrial integration-centric engineering management are integral to this journal.",
      "categories": [
        {
          "name": "Engineering (miscellaneous)",
          "quartile": "Q1"
        },
        {
          "name": "Business and International Management",
          "quartile": "Q2"
        },
        {
          "name": "Management of Technology and Innovation",
          "quartile": "Q2"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2016-2025",
      "rank": 9719
    },
    {
      "id": "12337",
      "title": "International Journal of Bifurcation and Chaos",
      "issn": [
        "17936551",
        "02181274"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.596,
        "sjrQuartile": "Q1",
        "hIndex": 120,
        "totalDocs2024": 242,
        "totalDocs3Years": 826,
        "citationsPerDoc": 2.45,
        "totalCitations3Years": 1870
      },
      "scope": "The International Journal of Bifurcation and Chaos is widely regarded as a leading journal in the exciting fields of chaos theory and nonlinear science. Represented by an international editorial board comprising top researchers from a wide variety of disciplines, it is setting high standards in scientific and production quality. The journal has been reputedly acclaimed by the scientific community around the world, and has featured many important papers by leading researchers from various areas of applied sciences and engineering. The discipline of chaos theory has created a universal paradigm, a scientific parlance, and a mathematical tool for grappling with complex dynamical phenomena. In every field of applied sciences (astronomy, atmospheric sciences, biology, chemistry, economics, geophysics, life and medical sciences, physics, social sciences, ecology, etc.) and engineering (aerospace, chemical, electronic, civil, computer, information, mechanical, software, telecommunication, etc.), the local and global manifestations of chaos and bifurcation have burst forth in an unprecedented universality, linking scientists heretofore unfamiliar with one another's fields, and offering an opportunity to reshape our grasp of reality.",
      "categories": [
        {
          "name": "Multidisciplinary",
          "quartile": "Q1"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Engineering (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Engineering",
        "Mathematics",
        "Multidisciplinary"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 9733
    },
    {
      "id": "11800154589",
      "title": "Journal of Algebra and its Applications",
      "issn": [
        "17936829",
        "02194988"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.585,
        "sjrQuartile": "Q2",
        "hIndex": 32,
        "totalDocs2024": 551,
        "totalDocs3Years": 840,
        "citationsPerDoc": 0.74,
        "totalCitations3Years": 649
      },
      "scope": "The Journal of Algebra and Its Applications will publish papers both on theoretical and on applied aspects of Algebra. There is special interest in papers that point out innovative links between areas of Algebra and fields of application. As the field of Algebra continues to experience tremendous growth and diversification, we intend to provide the mathematical community with a central source for information on both the theoretical and the applied aspects of the discipline. While the journal will be primarily devoted to the publication of original research, extraordinary expository articles that encourage communication between algebraists and experts on areas of application as well as those presenting the state of the art on a given algebraic sub-discipline will be considered.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q2"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 9923
    },
    {
      "id": "23230",
      "title": "International Journal of Algebra and Computation",
      "issn": [
        "02181967",
        "17936500"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.565,
        "sjrQuartile": "Q2",
        "hIndex": 37,
        "totalDocs2024": 55,
        "totalDocs3Years": 214,
        "citationsPerDoc": 0.6,
        "totalCitations3Years": 144
      },
      "scope": "The International Journal of Algebra and Computation publishes high quality original research papers in combinatorial, algorithmic and computational aspects of algebra (including combinatorial and geometric group theory and semigroup theory, algorithmic aspects of universal algebra, computational and algorithmic commutative algebra, probabilistic models related to algebraic structures, random algebraic structures), and gives a preference to papers in the areas of mathematics represented by the editorial board.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 10289
    },
    {
      "id": "79036",
      "title": "Pacific Symposium on Biocomputing",
      "issn": [
        "23356928",
        "23356936"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.563,
        "sjrQuartile": "Q2",
        "hIndex": 81,
        "totalDocs2024": 56,
        "totalDocs3Years": 134,
        "citationsPerDoc": 0.96,
        "totalCitations3Years": 179
      },
      "scope": "The Pacific Symposium on Biocomputing (PSB) is an international, multidisciplinary conference for the presentation and discussion of current research in the theory and application of computational methods in problems of biological significance.",
      "categories": [
        {
          "name": "Biomedical Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Medicine"
      ],
      "country": "United States",
      "coverage": "1996-2005, 2012-2025",
      "rank": 10340
    },
    {
      "id": "12441",
      "title": "Open Systems and Information Dynamics",
      "issn": [
        "17937191",
        "12301612"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.533,
        "sjrQuartile": "Q2",
        "hIndex": 36,
        "totalDocs2024": 19,
        "totalDocs3Years": 68,
        "citationsPerDoc": 1.34,
        "totalCitations3Years": 75
      },
      "scope": "The aim of this journal is to promote interdisciplinary research in mathematics, physics, engineering and life sciences centered around the issues of broadly understood information processing, storage and transmission, in both quantum and classical settings. Our special interest lies in the information-theoretic approach to phenomena dealing with dynamics and thermodynamics, control, communication, filtering, memory and cooperative behaviour, etc., in open complex systems. The following topics are particularly welcome: theory of quantum information, including entropy, entanglement and measurement, quantum communication, computing and cryptography; open systems, decoherence, classical and quantum noise; bioinformatics; information/entropy flow in complex dynamical systems; complexity theory of classical and quantum systems; other models of information processing. Understandably, this list does not exclude other possible topics. The journal is intended to present theoretically oriented material (even purely mathematical) as well as contributions of applied character.",
      "categories": [
        {
          "name": "Computational Mechanics",
          "quartile": "Q2"
        },
        {
          "name": "Fluid Flow and Transfer Processes",
          "quartile": "Q2"
        },
        {
          "name": "Information Systems",
          "quartile": "Q2"
        },
        {
          "name": "Mathematical Physics",
          "quartile": "Q2"
        },
        {
          "name": "Mechanics of Materials",
          "quartile": "Q2"
        },
        {
          "name": "Physical and Theoretical Chemistry",
          "quartile": "Q2"
        },
        {
          "name": "Statistics and Probability",
          "quartile": "Q2"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Chemical Engineering",
        "Chemistry",
        "Computer Science",
        "Engineering",
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1992-1995, 1997-2024",
      "rank": 10906
    },
    {
      "id": "11700154720",
      "title": "International Journal of Number Theory",
      "issn": [
        "17937310",
        "17930421"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.531,
        "sjrQuartile": "Q2",
        "hIndex": 27,
        "totalDocs2024": 165,
        "totalDocs3Years": 375,
        "citationsPerDoc": 0.55,
        "totalCitations3Years": 228
      },
      "scope": "This journal publishes original research papers and review articles on all areas of Number Theory, including elementary number theory, analytic number theory, algebraic number theory, arithmetic algebraic geometry, geometry of numbers, diophantine equations, diophantine approximation, transcendental number theory, probabilistic number theory, modular forms, multiplicative number theory, additive number theory, partitions, and computational number theory.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 10949
    },
    {
      "id": "21100198432",
      "title": "International Journal of Biomathematics",
      "issn": [
        "17935245",
        "17937159"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.527,
        "sjrQuartile": "Q2",
        "hIndex": 38,
        "totalDocs2024": 204,
        "totalDocs3Years": 283,
        "citationsPerDoc": 2.13,
        "totalCitations3Years": 613
      },
      "scope": "The goal of this journal is to present the latest achievements in biomathematics, facilitate international academic exchanges and promote the development of biomathematics. Its research fields include mathematical ecology, infectious disease dynamical system, biostatistics and bioinformatics. Only original papers will be considered. Submission of a manuscript indicates a tacit understanding that the paper is not actively under consideration for publication with other journals. As submission and reviewing processes are handled electronically whenever possible, the journal promises rapid publication of articles. The International Journal of Biomathematics is published bimonthly.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 11030
    },
    {
      "id": "21101167539",
      "title": "Guidance, Navigation and Control",
      "issn": [
        "27374807",
        "27374920"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.52,
        "sjrQuartile": "Q2",
        "hIndex": 9,
        "totalDocs2024": 40,
        "totalDocs3Years": 76,
        "citationsPerDoc": 2.02,
        "totalCitations3Years": 192
      },
      "scope": "Guidance, Navigation and Control (GNC) will report on advances in the understanding and utilization of guidance, navigation and control theories, technologies and systems. The journal serves as a platform for academic exchange by experts, scholars and researchers in these fields. The following subjects are of particular interest to the journal: -Modeling , analysis and design of dynamics, control and guidance systems- Stability, optimization, electronics, avionics, and information processing related to various vehicle systems (marine, ground, aeronautical, and astronautical systems)- Theoretical and empirical research in guidance, navigation and control technologies- Application of guidance, navigation and control technologies to real-world problems",
      "categories": [
        {
          "name": "Aerospace Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Safety, Risk, Reliability and Quality",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2021-2025",
      "rank": 11176
    },
    {
      "id": "15900154757",
      "title": "Journal of Earthquake and Tsunami",
      "issn": [
        "17937116",
        "17934311"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.52,
        "sjrQuartile": "Q2",
        "hIndex": 26,
        "totalDocs2024": 43,
        "totalDocs3Years": 100,
        "citationsPerDoc": 2.6,
        "totalCitations3Years": 279
      },
      "scope": "Journal of Earthquake and Tsunami provides a common forum for scientists and engineers working in the areas of earthquakes and tsunamis to communicate and interact with one another and thereby enhance the opportunities for such cross-fertilization of ideas. The Journal publishes original papers pertaining to state-of-the-art research and development in Geological and Seismological Setting; Ground Motion, Site and Building Response; Tsunami Generation, Propagation, Damage and Mitigation, as well as Education and Risk Management following an earthquake or a tsunami. We welcome papers in the following categories: Geological and Seismological Aspects Tectonics: (Geology - earth processes) Fault processes and earthquake generation: seismology (earthquake processes) Earthquake wave propagation: geophysics Remote sensing Earthquake Engineering Geotechnical hazards and response Effects on buildings and structures Risk analysis and management Retrofitting and remediation Education and awareness Material Behaviour Soil Reinforced concrete Steel Tsunamis Tsunamigenic sources Tsunami propagation: Physical oceanography Run-up and damage: wave hydraulics.",
      "categories": [
        {
          "name": "Geophysics",
          "quartile": "Q2"
        },
        {
          "name": "Geotechnical Engineering and Engineering Geology",
          "quartile": "Q2"
        },
        {
          "name": "Oceanography",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Earth and Planetary Sciences"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 11180
    },
    {
      "id": "21100825516",
      "title": "Random Matrices: Theory and Application",
      "issn": [
        "20103263",
        "20103271"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.511,
        "sjrQuartile": "Q2",
        "hIndex": 22,
        "totalDocs2024": 25,
        "totalDocs3Years": 105,
        "citationsPerDoc": 0.66,
        "totalCitations3Years": 79
      },
      "scope": "Random Matrix Theory (RMT) has a long and rich history and has, especially in recent years, shown to have important applications in many diverse areas of mathematics, science, and engineering. The scope of RMT and its applications include the areas of classical analysis, probability theory, statistical analysis of big data, as well as connections to graph theory, number theory, representation theory, and many areas of mathematical physics. Applications of Random Matrix Theory continue to present themselves and new applications are welcome in this journal. Some examples are orthogonal polynomial theory, free probability, integrable systems, growth models, wireless communications, signal processing, numerical computing, complex networks, economics, statistical mechanics, and quantum theory. Special issues devoted to single topic of current interest will also be considered and published in this journal.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q2"
        },
        {
          "name": "Discrete Mathematics and Combinatorics",
          "quartile": "Q2"
        },
        {
          "name": "Statistics and Probability",
          "quartile": "Q2"
        },
        {
          "name": "Statistics, Probability and Uncertainty",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Decision Sciences",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2012-2025",
      "rank": 11390
    },
    {
      "id": "28074",
      "title": "International Journal of Modern Physics D",
      "issn": [
        "02182718",
        "17936594"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.51,
        "sjrQuartile": "Q2",
        "hIndex": 97,
        "totalDocs2024": 112,
        "totalDocs3Years": 549,
        "citationsPerDoc": 2.0,
        "totalCitations3Years": 982
      },
      "scope": "Gravitation, astrophysics and cosmology are exciting and rapidly advancing fields of research. This journal aims to accommodate and promote this expansion of information and ideas and it features research papers and reviews on theoretical, observational and experimental findings in these fields. Among the topics covered are general relativity, quantum gravity, gravitational experiments, quantum cosmology, observational cosmology, particle cosmology, large scale structure, high energy astrophysics, compact objects, cosmic particles and radiation.",
      "categories": [
        {
          "name": "Mathematical Physics",
          "quartile": "Q2"
        },
        {
          "name": "Astronomy and Astrophysics",
          "quartile": "Q3"
        },
        {
          "name": "Space and Planetary Science",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Earth and Planetary Sciences",
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 11403
    },
    {
      "id": "4700152703",
      "title": "Stochastics and Dynamics",
      "issn": [
        "02194937",
        "17936799"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.503,
        "sjrQuartile": "Q2",
        "hIndex": 28,
        "totalDocs2024": 51,
        "totalDocs3Years": 215,
        "citationsPerDoc": 0.75,
        "totalCitations3Years": 175
      },
      "scope": "This interdisciplinary journal is devoted to publishing high quality papers in modeling, analyzing, quantifying and predicting stochastic phenomena in science and engineering from a dynamical system's point of view. Papers can be about theory, experiments, algorithms, numerical simulation and applications. Papers studying the dynamics of stochastic phenomena by means of random or stochastic ordinary, partial or functional differential equations or random mappings are particularly welcome, and so are studies of stochasticity in deterministic systems.",
      "categories": [
        {
          "name": "Modeling and Simulation",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2005-2025",
      "rank": 11536
    },
    {
      "id": "21100826328",
      "title": "Journal of Astronomical Instrumentation",
      "issn": [
        "22511725",
        "22511717"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.496,
        "sjrQuartile": "Q2",
        "hIndex": 31,
        "totalDocs2024": 9,
        "totalDocs3Years": 65,
        "citationsPerDoc": 1.43,
        "totalCitations3Years": 101
      },
      "scope": "The Journal of Astronomical Instrumentation (JAI) publishes papers describing instruments and components being proposed, developed, under construction and in use. JAI also publishes papers that describe facility operations, lessons learned in design, construction, and operation, algorithms and their implementations, and techniques, including calibration, that are fundamental elements of instrumentation. The journal focuses on astronomical instrumentation topics in all wavebands (Radio to Gamma-Ray) and includes the disciplines of Heliophysics, Space Weather, Lunar and Planetary Science, Exoplanet Exploration, and Astroparticle Observation (cosmic rays, cosmic neutrinos, etc.). Concepts, designs, components, algorithms, integrated systems, operations, data archiving techniques and lessons learned applicable but not limited to the following platforms are pertinent to this journal. Example topics are listed below each platform, and it is recognized that many of these topics are relevant to multiple platforms. Relevant platforms include: Ground-based observatories[...] Stratospheric aircraft[...] Balloons and suborbital rockets[...] Space-based observatories and systems[...] Landers and rovers, and other planetary-based instrument concepts[...]",
      "categories": [
        {
          "name": "Instrumentation",
          "quartile": "Q2"
        },
        {
          "name": "Astronomy and Astrophysics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2012-2025",
      "rank": 11675
    },
    {
      "id": "29577",
      "title": "Journal of Biological Systems",
      "issn": [
        "17936470",
        "02183390"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.487,
        "sjrQuartile": "Q2",
        "hIndex": 39,
        "totalDocs2024": 70,
        "totalDocs3Years": 125,
        "citationsPerDoc": 1.7,
        "totalCitations3Years": 228
      },
      "scope": "The Journal of Biological Systems is published quarterly. The goal of the Journal is to promote interdisciplinary approaches in Biology and in Medicine, and the study of biological situations with a variety of tools, including mathematical and general systems methods. The Journal solicits original research papers and survey articles in areas that include (but are not limited to): Complex systems studies; isomorphies; nonlinear dynamics; entropy; mathematical tools and systems theories with applications in Biology and Medicine. Interdisciplinary approaches in Biology and Medicine; transfer of methods from one discipline to another; integration of biological levels, from atomic to molecular, macromolecular, cellular, and organic levels; animal biology; plant biology. Environmental studies; relationships between individuals, populations, communities and ecosystems; bioeconomics, management of renewable resources; hierarchy theory; integration of spatial and time scales. Evolutionary biology; co-evolutions; genetics and evolution; branching processes and phyllotaxis. Medical systems; physiology; cardiac modeling; computer models in Medicine; cancer research; epidemiology. Numerical simulations and computations; numerical study and analysis of biological data. Epistemology; history of science. The journal will also publish book reviews.",
      "categories": [
        {
          "name": "Agricultural and Biological Sciences (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Ecology",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Agricultural and Biological Sciences",
        "Environmental Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 11843
    },
    {
      "id": "21100198447",
      "title": "Journal of Topology and Analysis",
      "issn": [
        "17937167",
        "17935253"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.485,
        "sjrQuartile": "Q2",
        "hIndex": 21,
        "totalDocs2024": 78,
        "totalDocs3Years": 163,
        "citationsPerDoc": 0.37,
        "totalCitations3Years": 77
      },
      "scope": "This journal is devoted to topology and analysis, broadly defined to include, for instance, differential geometry, geometric topology, geometric analysis, geometric group theory, index theory, noncommutative geometry, and aspects of probability on discrete structures, and geometry of Banach spaces. We welcome all excellent papers that have a geometric and/or analytic flavor that fosters the interactions between these fields. Papers published in this journal should break new ground or represent definitive progress on problems of current interest. On rare occasion, we will also accept survey papers.",
      "categories": [
        {
          "name": "Analysis",
          "quartile": "Q2"
        },
        {
          "name": "Geometry and Topology",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2009-2025",
      "rank": 11880
    },
    {
      "id": "4700152646",
      "title": "International Journal of Information Technology and Decision Making",
      "issn": [
        "17936845",
        "02196220"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.478,
        "sjrQuartile": "Q2",
        "hIndex": 57,
        "totalDocs2024": 89,
        "totalDocs3Years": 226,
        "citationsPerDoc": 2.42,
        "totalCitations3Years": 612
      },
      "scope": "International Journal of Information Technology and Decision Making (IJITDM) provides a global forum for exchanging research findings and case studies which bridge the latest information technology and various decision-making techniques. It promotes how information technology improves decision techniques as well as how the development of decision-making tools affects the information technology era. The journal is peer-reviewed and publishes both high-quality academic (theoretical or empirical) and practical papers in the broad ranges of information technology related topics including, but not limited to the following:  Artificial Intelligence and Decision Making  Bio-informatics and Medical Decision Making  Cluster Computing and Performance  Data Mining and Web Mining  Data Warehouse and Applications  Database Performance Evaluation  Decision Making and Distributed Systems  Decision Making and Electronic Transaction and Payment  Decision Making of Internet Companies  Decision Making on Information Security  Decision Models for Electronic Commerce  Decision Models for Internet Based on Companies  Decision Support Systems  Decision Technologies in Information System Design  Digital Library Designs  Economic Decisions and Information Systems  Enterprise Computing and Evaluation  Fuzzy Logic and Internet  Group Decision Making and Software  Habitual Domain and Information Technology  Human Computer Interaction  Information Ethics and Legal Evaluations  Information Overload  Information Policy Making  Information Retrieval Systems  Information Technology and Organizational Behavior  Intelligent Agents Technologies  Intelligent and Fuzzy Information Processing  Internet Service and Training  Knowledge Representation Models  Making Decision through Internet  Multimedia and Decision Making [...]",
      "categories": [
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2002, 2005-2025",
      "rank": 12029
    },
    {
      "id": "29804",
      "title": "International Journal of Accounting",
      "issn": [
        "22133933",
        "10944060"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.476,
        "sjrQuartile": "Q2",
        "hIndex": 71,
        "totalDocs2024": 25,
        "totalDocs3Years": 58,
        "citationsPerDoc": 2.18,
        "totalCitations3Years": 142
      },
      "scope": "The aim of The International Journal of Accounting is to advance the academic and professional understanding of accounting theory, policies and practice from the international perspective and viewpoint. The Journal editorial recognizes that international accounting is influenced by a variety of forces, e.g., governmental, political and economic. Thus, the primary criterion for manuscript evaluation is the incremental contribution to international accounting literature and the forces that impact the field. The Journal aims at understanding the present and potential ability of accounting to aid in analyzing and interpreting international economic transactions and the economic consequences of such reporting. These transactions may be within a profit or non-profit environment. The Journal encourages a broad view of the origins and development of accounting with an emphasis on its functions in an increasingly interdependent global economy. The Journal also welcomes manuscripts that help explain current international accounting practices, with related theoretical justifications, and identify criticisms of current policies and practice. Other than occasional commissioned papers or special issues, all the manuscripts published in the Journal are selected by the editors after the normal double-blind refereeing process.",
      "categories": [
        {
          "name": "Finance",
          "quartile": "Q2"
        },
        {
          "name": "Accounting",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 12069
    },
    {
      "id": "21100457432",
      "title": "Journal of Advanced Dielectrics",
      "issn": [
        "2010135X",
        "20101368"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.475,
        "sjrQuartile": "Q2",
        "hIndex": 28,
        "totalDocs2024": 57,
        "totalDocs3Years": 153,
        "citationsPerDoc": 2.56,
        "totalCitations3Years": 378
      },
      "scope": "The Journal of Advanced Dielectrics is an international peer-reviewed journal for original contributions on the understanding and applications of dielectrics in modern electronic devices and systems. The journal seeks to provide an interdisciplinary forum for the rapid communication of novel research of high quality in, but not limited to, the following topics: Fundamentals of dielectrics (ab initio or first-principles calculations, density functional theory, phenomenological approaches). Polarization and related phenomena (spontaneous polarization, domain structure, polarization reversal). Dielectric relaxation (universal relaxation law, relaxor ferroelectrics, giant permittivity, flexoelectric effect). Ferroelectric materials and devices (single crystals and ceramics). Thin/thick films and devices (ferroelectric memory devices, capacitors). Piezoelectric materials and applications (lead-based piezo-ceramics and crystals, lead-free piezoelectrics). Pyroelectric materials and devices Multiferroics (single phase multiferroics, composite ferromagnetic ferroelectric materials). Electrooptic and photonic materials. Energy harvesting and storage materials (polymer, composite, super-capacitor). Phase transitions and structural characterizations. Microwave and milimeterwave dielectrics. Nanostructure, size effects and characterizations. Engineering dielectrics for high voltage applications (insulation, electrical breakdown). Modeling (microstructure evolution and microstructure-property relationships, multiscale modeling of dielectrics).",
      "categories": [
        {
          "name": "Ceramics and Composites",
          "quartile": "Q2"
        },
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q2"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q2"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2015-2025",
      "rank": 12089
    },
    {
      "id": "19900192592",
      "title": "Journal of Innovative Optical Health Sciences",
      "issn": [
        "17935458",
        "17937205"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.458,
        "sjrQuartile": "Q2",
        "hIndex": 34,
        "totalDocs2024": 67,
        "totalDocs3Years": 196,
        "citationsPerDoc": 2.57,
        "totalCitations3Years": 470
      },
      "scope": "JIOHS serves as an international forum for the publication of the latest developments in all areas of photonics in biology and medicine. JIOHS will consider for publication original papers in all disciplines of photonics in biology and medicine, including but not limited to: -Photonic therapeutics and diagnostics- Optical clinical technologies and systems- Tissue optics- Laser-tissue interaction and tissue engineering- Biomedical spectroscopy- Advanced microscopy and imaging- Nanobiophotonics and optical molecular imaging- Multimodal and hybrid biomedical imaging- Micro/nanofabrication- Medical microsystems- Optical coherence tomography- Photodynamic therapy. JIOHS provides a vehicle to help professionals, graduates, engineers, academics and researchers working in the field of intelligent photonics in biology and medicine to disseminate information on the state-of-the-art technique.",
      "categories": [
        {
          "name": "Atomic and Molecular Physics, and Optics",
          "quartile": "Q2"
        },
        {
          "name": "Biomedical Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q3"
        },
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science",
        "Medicine",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 12453
    },
    {
      "id": "21100828447",
      "title": "Interdisciplinary Mathematical Sciences",
      "issn": [
        "17931355"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.449,
        "sjrQuartile": "Q2",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 2,
        "citationsPerDoc": 1.0,
        "totalCitations3Years": 2
      },
      "scope": "This book series will include expository books, textbooks and research monographs dealing with the interactions between mathematical sciences and other scientific disciplines such as engineering sciences, physical sciences, life sciences and social sciences.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q2"
        },
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2016-2017, 2019-2020, 2023",
      "rank": 12662
    },
    {
      "id": "4700152702",
      "title": "International Journal of Geometric Methods in Modern Physics",
      "issn": [
        "17936977",
        "02198878"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.432,
        "sjrQuartile": "Q2",
        "hIndex": 47,
        "totalDocs2024": 372,
        "totalDocs3Years": 771,
        "citationsPerDoc": 2.26,
        "totalCitations3Years": 1694
      },
      "scope": "This journal publishes short communications, research and review articles devoted to all applications of geometric methods (including commutative and non-commutative Differential Geometry, Riemannian Geometry, Finsler Geometry, Complex Geometry, Lie Groups and Lie Algebras, Bundle Theory, Homology an Cohomology, Algebraic Geometry, Global Analysis, Category Theory, Operator Algebra and Topology) in all fields of Mathematical and Theoretical Physics, including in particular: Classical Mechanics (Lagrangian, Hamiltonian, Poisson formulations); Quantum Mechanics (also semi-classical approximations); Hamiltonian Systems of ODE's and PDE's and Integrability; Variational Structures of Physics and Conservation Laws; Thermodynamics of Systems and Continua (also Quantum Thermodynamics and Statistical Physics); General Relativity and other Geometric Theories of Gravitation; geometric models for Particle Physics; Supergravity and Supersymmetric Field Theories; Classical and Quantum Field Theory (also quantization over curved backgrounds); Gauge Theories; Topological Field Theories; Strings, Branes and Extended Objects Theory; Holography; Quantum Gravity, Loop Quantum Gravity and Quantum Cosmology; applications of Quantum Groups; Quantum Computation; Control Theory; Geometry of Chaos.",
      "categories": [
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2005-2025",
      "rank": 13064
    },
    {
      "id": "11700154321",
      "title": "International Journal of Innovation Management",
      "issn": [
        "17575877",
        "13639196"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.432,
        "sjrQuartile": "Q2",
        "hIndex": 61,
        "totalDocs2024": 52,
        "totalDocs3Years": 295,
        "citationsPerDoc": 1.63,
        "totalCitations3Years": 597
      },
      "scope": "The International Journal of Innovation (IJIM) is the official journal of the International Society of Professional Innovation Management (ISPIM). Both the IJIM and ISPIM adopt a multi-disciplinary approach to addressing the many challenges of managing innovation, rather than a narrow focus on a single aspect such as technology, R&D or new product development. Both are also international, inclusive & practical, and encourage active interaction between academics, managers and consultants.",
      "categories": [
        {
          "name": "Business and International Management",
          "quartile": "Q2"
        },
        {
          "name": "Management of Technology and Innovation",
          "quartile": "Q2"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 13065
    },
    {
      "id": "19900191975",
      "title": "Journal of Uncertain Systems",
      "issn": [
        "17528917",
        "17528909"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.422,
        "sjrQuartile": "Q2",
        "hIndex": 22,
        "totalDocs2024": 39,
        "totalDocs3Years": 88,
        "citationsPerDoc": 1.75,
        "totalCitations3Years": 163
      },
      "scope": "",
      "categories": [
        {
          "name": "Computer Vision and Pattern Recognition",
          "quartile": "Q2"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        },
        {
          "name": "Control and Optimization",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2011-2019, 2021-2025",
      "rank": 13304
    },
    {
      "id": "4900152403",
      "title": "International Journal of Computational Methods",
      "issn": [
        "02198762",
        "17936969"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.407,
        "sjrQuartile": "Q2",
        "hIndex": 45,
        "totalDocs2024": 96,
        "totalDocs3Years": 290,
        "citationsPerDoc": 1.74,
        "totalCitations3Years": 471
      },
      "scope": "The purpose of this journal is to provide a unique forum for the fast publication and rapid dissemination of original research results and innovative ideas on the state-of-the-art on computational methods. The methods should be innovative and of high scholarly, academic and practical value. The journal is devoted to all aspects of modern computational methods including mathematical formulations and theoretical investigations; interpolations and approximation techniques; error analysis techniques and algorithms; fast algorithms and real-time computation; multi-scale bridging algorithms; adaptive analysis techniques and algorithms; implementation, coding and parallelization issues; novel and practical applications. The articles can involve theory, algorithm, programming, coding, numerical simulation and/or novel application of computational techniques to problems in engineering, science, and other disciplines related to computations. Examples of fields covered by the journal are: Computational mechanics for solids and structures, Computational fluid dynamics, Computational heat transfer, Computational inverse problem, Computational mathematics, Computational meso/micro/nano mechanics, Computational biology, Computational penetration mechanics, Meshfree methods, Particle methods, Molecular and Quantum methods, Advanced Finite element methods, Advanced Finite difference methods, Advanced Finite volume methods, High-performance computing techniques.",
      "categories": [
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2006-2025",
      "rank": 13625
    },
    {
      "id": "21100409406",
      "title": "Journal of International Commerce, Economics and Policy",
      "issn": [
        "17939933",
        "17939941"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.407,
        "sjrQuartile": "Q2",
        "hIndex": 19,
        "totalDocs2024": 32,
        "totalDocs3Years": 60,
        "citationsPerDoc": 2.09,
        "totalCitations3Years": 114
      },
      "scope": "Journal of International Commerce, Economics and Policy (JICEP) is a peer-reviewed journal that seeks to publish high-quality research papers that explore important dimensions of the global economic system (including trade, finance, investment and labor flows). JICEP is particularly interested in potentially influential research that is analytical or empirical but with heavy emphasis on international dimensions of economics, business and related public policy. Papers must aim to be thought-provoking and combine rigor with readability so as to be of interest to both researchers as well as policymakers. JICEP is not region-specific and especially welcomes research exploring the growing economic interdependence between countries and regions.",
      "categories": [
        {
          "name": "Business, Management and Accounting (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        },
        {
          "name": "Finance",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2010-2025",
      "rank": 13628
    },
    {
      "id": "21100838016",
      "title": "Quarterly Journal of Finance",
      "issn": [
        "20101406",
        "20101392"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.407,
        "sjrQuartile": "Q3",
        "hIndex": 27,
        "totalDocs2024": 18,
        "totalDocs3Years": 64,
        "citationsPerDoc": 0.48,
        "totalCitations3Years": 43
      },
      "scope": "The Quarterly Journal of Finance publishes high-quality papers in all areas of finance, including corporate finance, asset pricing, financial econometrics, international finance, macro-finance, behavioral finance, banking and financial intermediation, capital markets, risk management and insurance, derivatives, quantitative finance, corporate governance and compensation, investments and entrepreneurial finance.",
      "categories": [
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        },
        {
          "name": "Finance",
          "quartile": "Q3"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2011-2024",
      "rank": 13643
    },
    {
      "id": "28073",
      "title": "International Journal of Modern Physics A",
      "issn": [
        "0217751X",
        "1793656X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.402,
        "sjrQuartile": "Q2",
        "hIndex": 113,
        "totalDocs2024": 247,
        "totalDocs3Years": 922,
        "citationsPerDoc": 1.2,
        "totalCitations3Years": 1155
      },
      "scope": "Started in 1986, IJMPA has gained international repute as a high-quality scientific journal. It consists of important review articles and original papers covering the latest research developments in Particles and Fields, and selected topics intersecting with Gravitation and Cosmology. The journal also features articles of long-standing value and importance which can be vital to research into new unexplored areas.",
      "categories": [
        {
          "name": "Nuclear and High Energy Physics",
          "quartile": "Q2"
        },
        {
          "name": "Astronomy and Astrophysics",
          "quartile": "Q3"
        },
        {
          "name": "Atomic and Molecular Physics, and Optics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1989, 1996-2025",
      "rank": 13739
    },
    {
      "id": "23197",
      "title": "Infinite Dimensional Analysis, Quantum Probability and Related Topics",
      "issn": [
        "17936306",
        "02190257"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.4,
        "sjrQuartile": "Q3",
        "hIndex": 34,
        "totalDocs2024": 52,
        "totalDocs3Years": 80,
        "citationsPerDoc": 0.91,
        "totalCitations3Years": 66
      },
      "scope": "In the past few years the fields of infinite dimensional analysis and quantum probability have undergone increasingly significant developments and have found many new applications, in particular, to classical probability and to different branches of physics. The number of first-class papers in these fields has grown at the same rate. This is currently the only journal which is devoted to these fields. It constitutes an essential and central point of reference for the large number of mathematicians, mathematical physicists and other scientists who have been drawn into these areas. Both fields have strong interdisciplinary nature, with deep connection to, for example, classical probability, stochastic analysis, mathematical physics, operator algebras, irreversibility, ergodic theory and dynamical systems, quantum groups, classical and quantum stochastic geometry, quantum chaos, Dirichlet forms, harmonic analysis, quantum measurement, quantum computer, etc. The journal reflects this interdisciplinarity and welcomes high quality papers in all such related fields, particularly those which reveal connections with the main fields of this journal.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Mathematical Physics",
          "quartile": "Q3"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q3"
        },
        {
          "name": "Statistics and Probability",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1998-2025",
      "rank": 13785
    },
    {
      "id": "21100307471",
      "title": "International Journal of Innovation and Technology Management",
      "issn": [
        "17936950",
        "02198770"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.391,
        "sjrQuartile": "Q3",
        "hIndex": 31,
        "totalDocs2024": 65,
        "totalDocs3Years": 205,
        "citationsPerDoc": 1.77,
        "totalCitations3Years": 474
      },
      "scope": "The main emphasis of the International Journal of Innovation and Technology Management (IJITM) is on the promotion and discussion of excellent research on technological innovation. As a platform for reporting, sharing, as well as exchanging ideas, IJITM encourages novel research findings, industry best practices, and reports on recent trends. In particular, the journal focuses on managerial issues and challenges (and ways to address them) motivated through the increasing pace of technological advancement globally. This international and interdisciplinary research dimension is emphasized in order to promote greater exchange between researchers of different disciplines as well as cultural and national backgrounds. This double-blind peer-reviewed journal encompasses all facets of the process of technological innovation from idea generation, conceptualization of new products and processes, R&D activities, and commercial application. Research on all firm sizes, from entrepreneurial ventures, small and medium sized enterprises (SMEs), as well as large organizations, is welcome.",
      "categories": [
        {
          "name": "Management of Technology and Innovation",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting"
      ],
      "country": "Singapore",
      "coverage": "2004-2025",
      "rank": 14023
    },
    {
      "id": "12183",
      "title": "Journal of Nonlinear Optical Physics and Materials",
      "issn": [
        "17936624",
        "02188635"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.389,
        "sjrQuartile": "Q2",
        "hIndex": 37,
        "totalDocs2024": 58,
        "totalDocs3Years": 80,
        "citationsPerDoc": 3.54,
        "totalCitations3Years": 266
      },
      "scope": "This journal is devoted to the rapidly advancing research and development in the field of nonlinear interactions of light with matter. Topics of interest include, but are not limited to, nonlinear optical materials, metamaterials and plasmonics, nano-photonic structures, stimulated scatterings, harmonic generations, wave mixing, real time holography, guided waves and solitons, bistabilities, instabilities and nonlinear dynamics, and their applications in laser and coherent lightwave amplification, guiding, switching, modulation, communication and information processing. Original papers, comprehensive reviews and rapid communications reporting original theories and observations are sought for in these and related areas. This journal will also publish proceedings of important international meetings and workshops. It is intended for graduate students, scientists and researchers in academic, industrial and government research institutions.",
      "categories": [
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Atomic and Molecular Physics, and Optics",
          "quartile": "Q3"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 14065
    },
    {
      "id": "21100871297",
      "title": "Journal of Theoretical and Computational Acoustics",
      "issn": [
        "25917811",
        "25917285"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.383,
        "sjrQuartile": "Q2",
        "hIndex": 44,
        "totalDocs2024": 33,
        "totalDocs3Years": 89,
        "citationsPerDoc": 1.2,
        "totalCitations3Years": 128
      },
      "scope": "The aim of this journal is to provide an international forum for the dissemination of the state-of-the-art information in the field of Computational Acoustics. Topics covered by this journal include research and tutorial contributions in OCEAN ACOUSTICS (a subject of active research in relation with sonar detection and the design of noiseless ships), SEISMO-ACOUSTICS (of concern to earthquake science and engineering, and also to those doing underground prospection like searching for petroleum), AEROACOUSTICS (which includes the analysis of noise created by aircraft), COMPUTATIONAL METHODS, and SUPERCOMPUTING. In addition to the traditional issues and problems in computational methods, the journal also considers theoretical research acoustics papers which lead to large-scale scientific computations.",
      "categories": [
        {
          "name": "Acoustics and Ultrasonics",
          "quartile": "Q2"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2018-2025",
      "rank": 14213
    },
    {
      "id": "24982",
      "title": "Singapore Economic Review",
      "issn": [
        "17936837",
        "02175908"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.382,
        "sjrQuartile": "Q3",
        "hIndex": 32,
        "totalDocs2024": 187,
        "totalDocs3Years": 425,
        "citationsPerDoc": 1.81,
        "totalCitations3Years": 774
      },
      "scope": "The Singapore Economic Review is a general economics journal devoted to quarterly publishing the best policy and applied economics papers, in addition to high-quality theoretical pieces. Widely regarded as a leading journal in the Asia-Pacific, it has a long history of publication on economic issues impinging on Southeast Asia and the broader Asia-Pacific region. Issues analysed are not specific only to Singapore but rather highlights rigorous empirical work across diverse economic issues of the contemporary world. This includes (but are not limited to) macroeconomic, microeconomic, financial and social aspects, with special emphasis on economic problems related to Asian countries. The journal also publishes papers of an interdisciplinary nature and welcomes this academic interface. It keeps scholars abreast of developments in the economic literature. Initially published as the Malayan Economic Review (MER) from 1956, the journal was subsequently renamed the Singapore Economic Review (SER) in 1969. Among its distinguished contributors were the late Sir John Hicks, Sydney Caine, the late H.G. Johnson, Ragnar Nurkse, H.W. Singer, W.M. Corden, Herbert Grubel, J.C.H. Fei, G. Ranis, Henry Wan, E.J. Mishan, Jerome L. Stein, Jack L. Knetsch, Ng Yew-Kwang, Murray Kemp, Karl Shell and Ronald I. McKinnon. The journal has a wide international circulation; among the many subscribers are the libraries of Harvard University, Stanford University and University of Oxford. The SER's editorial board consists of prominent scholars with different areas of specializations from across the world. With World Scientific as the journal's publisher, the Singapore Economic Review has sections devoted to public policy, applied economics, markets and industry, commentaries, and short papers or notes. The SER also publishes selected book reviews. In addition, specially invited papers by very eminent economists are featured.",
      "categories": [
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "1983-2025",
      "rank": 14255
    },
    {
      "id": "23921",
      "title": "Journal of Knot Theory and its Ramifications",
      "issn": [
        "17936527",
        "02182165"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.381,
        "sjrQuartile": "Q3",
        "hIndex": 40,
        "totalDocs2024": 56,
        "totalDocs3Years": 342,
        "citationsPerDoc": 0.3,
        "totalCitations3Years": 108
      },
      "scope": "This Journal is intended as a forum for new developments in knot theory, particularly developments that create connections between knot theory and other aspects of mathematics and natural science. Our stance is interdisciplinary due to the nature of the subject. Knot theory as a core mathematical discipline is subject to many forms of generalization (virtual knots and links, higher-dimensional knots, knots and links in other manifolds, non-spherical knots, recursive systems analogous to knotting). Knots live in a wider mathematical framework (classification of three and higher dimensional manifolds, statistical mechanics and quantum theory, quantum groups, combinatorics of Gauss codes, combinatorics, algorithms and computational complexity, category theory and categorification of topological and algebraic structures, algebraic topology, topological quantum field theories). Papers that will be published include: -new research in the theory of knots and links, and their applications; -new research in related fields; -tutorial and review papers. With this Journal, we hope to serve well researchers in knot theory and related areas of topology, researchers using knot theory in their work, and scientists interested in becoming informed about current work in the theory of knots and its ramifications.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q3"
        },
        {
          "name": "Geometry and Topology",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 14284
    },
    {
      "id": "28075",
      "title": "International Journal of Modern Physics B",
      "issn": [
        "02179792",
        "17936578"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.378,
        "sjrQuartile": "Q3",
        "hIndex": 86,
        "totalDocs2024": 543,
        "totalDocs3Years": 1129,
        "citationsPerDoc": 3.41,
        "totalCitations3Years": 3128
      },
      "scope": "Launched in 1987, the International Journal of Modern Physics B covers the most important aspects and the latest developments in Condensed Matter Physics, Statistical Physics, as well as Atomic, Molecular and Optical Physics. A strong emphasis is placed on topics of current interest, such as cold atoms and molecules, new topological materials and phases, and novel low dimensional materials. One unique feature of this journal is its review section which contains articles with permanent research value besides the state-of-the-art research work in the relevant subject areas.",
      "categories": [
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q3"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 14359
    },
    {
      "id": "16373",
      "title": "Hong Kong Physiotherapy Journal",
      "issn": [
        "10137025",
        "1876441X"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.377,
        "sjrQuartile": "Q3",
        "hIndex": 25,
        "totalDocs2024": 16,
        "totalDocs3Years": 49,
        "citationsPerDoc": 1.32,
        "totalCitations3Years": 90
      },
      "scope": "The Hong Kong Physiotherapy Journal (HKPJ) is the official peer-reviewed, Open Access (OA) publication of the Hong Kong Physiotherapy Association. HKPJ publishes papers related to all areas of physiotherapy (education, research, practice, policies) and is committed to facilitating communication among educators, researchers and practitioners in the field with the aim of promoting evidence-based practice. We are particularly interested in publishing randomized controlled trials, systematic reviews and meta-analyses. Animal studies are also welcome if the study question and findings have important relevance to physiotherapy practice. HKPJ welcomes submissions from all over the world in the form of original research papers, reviews, editorials, treatment reports, technical notes, and correspondence.",
      "categories": [
        {
          "name": "Physical Therapy, Sports Therapy and Rehabilitation",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Health Professions"
      ],
      "country": "Singapore",
      "coverage": "2000-2025",
      "rank": 14391
    },
    {
      "id": "29052",
      "title": "Modern Physics Letters A",
      "issn": [
        "02177323",
        "17936632"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.376,
        "sjrQuartile": "Q2",
        "hIndex": 90,
        "totalDocs2024": 251,
        "totalDocs3Years": 773,
        "citationsPerDoc": 1.57,
        "totalCitations3Years": 1171
      },
      "scope": "This letters journal, launched in 1986, consists of research papers covering current research developments in Gravitation, Cosmology, Astrophysics, Nuclear Physics, Particles and Fields, Accelerator physics, and Quantum Information. A Brief Review section has also been initiated with the purpose of publishing short reports on the latest experimental findings and urgent new theoretical developments.",
      "categories": [
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Astronomy and Astrophysics",
          "quartile": "Q3"
        },
        {
          "name": "Nuclear and High Energy Physics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 14410
    },
    {
      "id": "21100907367",
      "title": "Water Economics and Policy",
      "issn": [
        "2382624X",
        "23826258"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.355,
        "sjrQuartile": "Q3",
        "hIndex": 17,
        "totalDocs2024": 34,
        "totalDocs3Years": 91,
        "citationsPerDoc": 1.32,
        "totalCitations3Years": 100
      },
      "scope": "Water resources management and other water-related decisions and policies are frequently guided by economic dimensions. Economic considerations, including efficiency, equity, production, allocation, and pollution, have expanded as water resources have become scarcer both in terms of quantity and quality. While economic analyses applied to the water sector are useful and educational, their policy implications are less obvious for guiding policymakers. Water Economics and Policy (WEP) will address the economic-policy interaction by publishing highly technical water economics research with clear relevance for policy. WEP will aim to target a wide range of economic questions at local, regional, national and international levels. It will accommodate work that is focused on specific sectors (such as urban, hydropower, irrigation, and environment) as well as work that is inter-sectoral in nature. Theoretical and empirical papers are sought as well as those that demonstrate the integration of economics with scientific perspectives to support policy analysis. WEP will also publish book reviews and selected featured policy articles by policymakers in the field of water.",
      "categories": [
        {
          "name": "Business and International Management",
          "quartile": "Q3"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        },
        {
          "name": "Management, Monitoring, Policy and Law",
          "quartile": "Q3"
        },
        {
          "name": "Water Science and Technology",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance",
        "Environmental Science"
      ],
      "country": "Singapore",
      "coverage": "2015-2025",
      "rank": 15024
    },
    {
      "id": "13499",
      "title": "Asian Development Review",
      "issn": [
        "01161105",
        "19967241"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.354,
        "sjrQuartile": "Q2",
        "hIndex": 29,
        "totalDocs2024": 31,
        "totalDocs3Years": 59,
        "citationsPerDoc": 1.24,
        "totalCitations3Years": 104
      },
      "scope": "The Asian Development Review (ADR) is the journal of the Asian Development Bank (ADB) and the Asian Development Bank Institute (ADBI). It publishes research on development issues relevant to the countries of the Asia and Pacific region, specifically ADBs member countries. The ADR publishes empirical papers, survey articles, historical analyses, and policy-oriented work. It bridges theoretical work and rigorous empirical studies that advance the understanding of Asias development, and it is open to discussions of alternative perspectives on all aspects of development, including globalization, inequality, structural transformation, and poverty. The ADR aims to disseminate the best research, with contributions from scholars in all fields, with the objective of providing the knowledge necessary for designing, implementing, and sustaining effective development policies. Its intended audience comprises a worldwide readership of economists and other social scientists.",
      "categories": [
        {
          "name": "Geography, Planning and Development",
          "quartile": "Q2"
        },
        {
          "name": "Development",
          "quartile": "Q3"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "1983-2000, 2002-2025",
      "rank": 15033
    },
    {
      "id": "21101023625",
      "title": "Chinese Journal of Urban and Environmental Studies",
      "issn": [
        "2345752X",
        "23457481"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.351,
        "sjrQuartile": "Q2",
        "hIndex": 9,
        "totalDocs2024": 19,
        "totalDocs3Years": 79,
        "citationsPerDoc": 1.58,
        "totalCitations3Years": 134
      },
      "scope": "Chinese Journal of Urban and Environmental Studies (CJUES) is a peer-reviewed journal that seeks to publish high-quality research papers and book reviews to explore a wide range of academic and policy concerns of urban and environmental studies. CJUES publishes scholarly work with a special emphasis on the following fields:  theoretical and conceptual frameworks for urban and environmental studies  the trend of urban and environmental development in both China and international context  issues of urban studies, including urbanization, urban planning, urban form, urban problems, urban land use, urban transportation  issues of sustainability and environmental developments, including environmental protection, environmental policy, climate change  linkage between urban, environmental and other areas of social and economic policy  international comparison and developments",
      "categories": [
        {
          "name": "Geography, Planning and Development",
          "quartile": "Q2"
        },
        {
          "name": "Urban Studies",
          "quartile": "Q2"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        },
        {
          "name": "Global and Planetary Change",
          "quartile": "Q3"
        },
        {
          "name": "Management, Monitoring, Policy and Law",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance",
        "Environmental Science",
        "Social Sciences"
      ],
      "country": "United States",
      "coverage": "2019-2025",
      "rank": 15112
    },
    {
      "id": "4700152208",
      "title": "International Journal of Humanoid Robotics",
      "issn": [
        "17936942",
        "02198436"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.342,
        "sjrQuartile": "Q3",
        "hIndex": 44,
        "totalDocs2024": 32,
        "totalDocs3Years": 72,
        "citationsPerDoc": 4.58,
        "totalCitations3Years": 244
      },
      "scope": "The International Journal of Humanoid Robotics (IJHR) covers all subjects on the mind and body of humanoid robots. It is dedicated to advancing new theories, new techniques, and new implementations contributing to the successful achievement of future robots which not only imitate human beings, but also serve human beings. While IJHR encourages the contribution of original papers which are solidly grounded on proven theories or experimental procedures, the journal also encourages the contribution of innovative papers which venture into the new, frontier areas in robotics. Such papers need not necessarily demonstrate, in the early stages of research and development, the full potential of new findings on a physical or virtual robot. IJHR welcomes original papers in the following categories: Research papers, which disseminate scientific findings contributing to solving technical issues underlying the development of humanoid robots, or biologically-inspired robots, having multiple functionality related to either physical capabilities (i.e. motion) or mental capabilities (i.e. intelligence) Review articles, which describe, in non-technical terms, the latest in basic theories, principles, and algorithmic solutions Short articles (e.g. feature articles and dialogues), which discuss the latest significant achievements and the future trends in robotics R&D Papers on curriculum development in humanoid robot education Book reviews.",
      "categories": [
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        },
        {
          "name": "Mechanical Engineering",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2004-2024",
      "rank": 15364
    },
    {
      "id": "4000152131",
      "title": "Global Economy Journal",
      "issn": [
        "15535304",
        "21945659"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.328,
        "sjrQuartile": "Q2",
        "hIndex": 24,
        "totalDocs2024": 5,
        "totalDocs3Years": 42,
        "citationsPerDoc": 1.23,
        "totalCitations3Years": 51
      },
      "scope": "The official peer-reviewed journal of the International Trade and Finance Association (IT&FA), Global Economy Journal (GEJ) is a well-established venue for peer-reviewed research on globalization and the institutions, laws, and agreements that structure the global economy, such as the WTO, the IMF, and the World Bank. The Global Economy Journal (GEJ) seeks to publish original and innovative research, as well as novel analysis, relating to the global economy. While its main emphasis is economic, GEJ is a multi-disciplinary journal. Its content mirrors the diverse interests and approaches of scholars involved with the international dimensions of business, economics, finance, history, law, marketing, management, political science, and related areas. GEJ also welcomes scholarly contributions from officials with government agencies, international agencies, and non-governmental organizations.",
      "categories": [
        {
          "name": "Economics, Econometrics and Finance (miscellaneous)",
          "quartile": "Q2"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2006-2024",
      "rank": 15775
    },
    {
      "id": "24616",
      "title": "Algebra Colloquium",
      "issn": [
        "02191733",
        "10053867"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.325,
        "sjrQuartile": "Q3",
        "hIndex": 32,
        "totalDocs2024": 52,
        "totalDocs3Years": 154,
        "citationsPerDoc": 0.48,
        "totalCitations3Years": 69
      },
      "scope": "Algebra Colloquium is an international mathematical journal founded at the beginning of 1994. It is edited by the Academy of Mathematics & Systems Science, Chinese Academy of Sciences, jointly with Suzhou University, and published quarterly in English in every March, June, September and December. Algebra Colloquium carries original research articles of high level in the field of pure and applied algebra. Papers from related areas which have applications to algebra are also considered for publication. This journal aims to reflect the latest developments in algebra and promote international academic exchanges.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q3"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2024",
      "rank": 15876
    },
    {
      "id": "28077",
      "title": "International Journal of Modern Physics C",
      "issn": [
        "01291831",
        "17936586"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.317,
        "sjrQuartile": "Q3",
        "hIndex": 72,
        "totalDocs2024": 202,
        "totalDocs3Years": 508,
        "citationsPerDoc": 1.81,
        "totalCitations3Years": 892
      },
      "scope": "International Journal of Modern Physics C (IJMPC) is a journal dedicated to Computational Physics and aims at publishing both review and research articles on the use of computers to advance knowledge in physical sciences and the use of physical analogies in computation. Topics covered include: algorithms; computational biophysics; computational fluid dynamics; statistical physics; complex systems; computer and information science; condensed matter physics, materials science; socio- and econophysics; data analysis and computation in experimental physics; environmental physics; traffic modelling; physical computation including neural nets, cellular automata and genetic algorithms.",
      "categories": [
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Mathematical Physics",
          "quartile": "Q3"
        },
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 16107
    },
    {
      "id": "24326",
      "title": "International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems",
      "issn": [
        "02184885",
        "17936411"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.315,
        "sjrQuartile": "Q3",
        "hIndex": 68,
        "totalDocs2024": 49,
        "totalDocs3Years": 198,
        "citationsPerDoc": 1.29,
        "totalCitations3Years": 291
      },
      "scope": "The International Journal of Uncertainty, Fuzziness and Knowledge-Based Systems is a forum for research on various methodologies for the management of imprecise, vague, uncertain or incomplete information. The aim of the journal is to promote theoretical or methodological works dealing with all kinds of methods to represent and manipulate imperfectly described pieces of knowledge, excluding results on pure mathematics or simple applications of existing theoretical results. It is published bimonthly, with worldwide distribution to researchers, engineers, decision-makers, and educators.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Information Systems",
          "quartile": "Q3"
        },
        {
          "name": "Software",
          "quartile": "Q3"
        },
        {
          "name": "Theoretical Computer Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 16168
    },
    {
      "id": "21100198431",
      "title": "Asian-European Journal of Mathematics",
      "issn": [
        "17937183",
        "17935571"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.31,
        "sjrQuartile": "Q3",
        "hIndex": 22,
        "totalDocs2024": 124,
        "totalDocs3Years": 683,
        "citationsPerDoc": 0.63,
        "totalCitations3Years": 430
      },
      "scope": "Asian-European Journal of Mathematics is an international journal which is devoted to original research in the field of pure and applied mathematics. The aim of the journal is to provide a medium by which new ideas can be discussed among researchers from diverse fields in mathematics. It publishes high quality research papers in the fields of contemporary pure and applied mathematics with a broad range of topics including algebra, analysis, topology, geometry, functional analysis, number theory, differential equations, operational research, combinatorics, theoretical statistics and probability, theoretical computer science and logic. Although the journal focuses on the original research articles, it also welcomes survey articles and short notes. All papers will be peer-reviewed within approximately four months.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 16310
    },
    {
      "id": "21100867681",
      "title": "Journal of Hand Surgery Asian-Pacific Volume",
      "issn": [
        "24248363",
        "24248355"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.307,
        "sjrQuartile": "Q3",
        "hIndex": 33,
        "totalDocs2024": 94,
        "totalDocs3Years": 385,
        "citationsPerDoc": 0.54,
        "totalCitations3Years": 248
      },
      "scope": "The Journal of Hand Surgery Asian-Pacific Volume is an international, peer-reviewed journal. It is the official journal of the Asian-Pacific Federation of Societies for Surgery of the Hand (APFSSH). This journal publishes original and review articles and cover all fields of clinical and basic science research related to hand surgery. It will serve as a source of information and education for hand surgeons and interested readers. The aim of this journal is to promote communication regarding problems of the hand and their management. All manuscripts should be creative, informative, and useful for the diagnosis and treatment of conditions related to hand surgery.",
      "categories": [
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Orthopedics and Sports Medicine",
          "quartile": "Q3"
        },
        {
          "name": "Surgery",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Medicine"
      ],
      "country": "Singapore",
      "coverage": "2016-2025",
      "rank": 16427
    },
    {
      "id": "21101194976",
      "title": "Journal of Artificial Intelligence and Consciousness",
      "issn": [
        "27050793",
        "27050785"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.306,
        "sjrQuartile": "Q3",
        "hIndex": 9,
        "totalDocs2024": 16,
        "totalDocs3Years": 49,
        "citationsPerDoc": 0.53,
        "totalCitations3Years": 57
      },
      "scope": "The Journal of Artificial Intelligence and Consciousness (JAIC) will offer a multidisciplinary platform to discuss AI and consciousness in the light of robotics and artificial systems, computational science, psychology, philosophy of mind, ethics, and neuroscience. The aims and scope of the journal are: (i) articles that take inspiration from biological consciousness and/or that explore theoretical issues of consciousness to build robots and AI systems that show forms of functional consciousness; (ii) articles that employ robots and AI systems as tools to model and better understand biological mechanisms of consciousness; (iii) articles that discuss ethical problems emerging or uncovered through the overlap of AI and consciousness, and that investigate the ethical and societal impact of consciousness and the limits of it, and (iv) to pursue the hybridization between the field of AI and the field of consciousness studies.",
      "categories": [
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2020-2024",
      "rank": 16451
    },
    {
      "id": "18374",
      "title": "Surface Review and Letters",
      "issn": [
        "17936667",
        "0218625X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.304,
        "sjrQuartile": "Q3",
        "hIndex": 51,
        "totalDocs2024": 219,
        "totalDocs3Years": 487,
        "citationsPerDoc": 2.09,
        "totalCitations3Years": 864
      },
      "scope": "This international journal is devoted to the elucidation of properties and processes that occur at the boundaries of materials. The scope of the journal covers a broad range of topics in experimental and theoretical studies of surfaces and interfaces. Both the physical and chemical properties are covered. The journal also places emphasis on emerging areas of cross-disciplinary research where new phenomena occur due to the presence of a surface or an interface. Representative areas include surface and interface structures; their electronic, magnetic and optical properties; dynamics and energetics; chemical reactions at surfaces; phase transitions, reconstruction, roughening and melting; defects, nucleation and growth; and new surface and interface characterization techniques.",
      "categories": [
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q3"
        },
        {
          "name": "Materials Chemistry",
          "quartile": "Q3"
        },
        {
          "name": "Surfaces and Interfaces",
          "quartile": "Q3"
        },
        {
          "name": "Surfaces, Coatings and Films",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 16516
    },
    {
      "id": "23110",
      "title": "Asia-Pacific Journal of Operational Research",
      "issn": [
        "02175959",
        "17937019"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.3,
        "sjrQuartile": "Q3",
        "hIndex": 39,
        "totalDocs2024": 86,
        "totalDocs3Years": 217,
        "citationsPerDoc": 1.32,
        "totalCitations3Years": 305
      },
      "scope": "The Asia-Pacific Journal of Operational Research (APJOR) provides a forum for practitioners, academics and researchers in Operational Research and related fields, within and beyond the Asia-Pacific region. APJOR will place submissions in one of the following categories: General, Theoretical, OR Practice, Reviewer Survey, OR Education, and Communications (including short articles and letters). Theoretical papers should carry significant methodological developments. Emphasis is on originality, quality and importance, with particular emphasis given to the practical significance of the results. Practical papers, illustrating the application of Operation Research, are of special interest.",
      "categories": [
        {
          "name": "Management Science and Operations Research",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Decision Sciences"
      ],
      "country": "Singapore",
      "coverage": "1991, 1996-2025",
      "rank": 16632
    },
    {
      "id": "21101052736",
      "title": "Journal of Computational Biophysics and Chemistry",
      "issn": [
        "27374173",
        "27374165"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.297,
        "sjrQuartile": "Q3",
        "hIndex": 33,
        "totalDocs2024": 103,
        "totalDocs3Years": 208,
        "citationsPerDoc": 2.39,
        "totalCitations3Years": 475
      },
      "scope": "Journal of Computational Biophysics and Chemistry (JCBC) is an interdisciplinary journal aimed at providing comprehensive coverage on the latest developments and applications of research in the ever-expanding field of computational biophysics and chemistry. JCBC publishes regular articles and reviews on new methodology, software, web server and database developments. The applications of existing theoretical and computational methods which produce significant new insights into important problems are also welcomed. Papers reporting joint computational and experimental investigations are encouraged. The journal will not consider manuscripts reporting straightforward calculations of the properties of molecules with existing software packages without addressing a significant scientific problem. Areas covered by the journal include molecular dynamics, computer-aided molecular design, modeling effects of mutations on stability, dynamics and binding of macromolecules, quantum mechanics and statistical mechanics studies on relevant biological phenomena and other related topics.",
      "categories": [
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Physical and Theoretical Chemistry",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Chemistry",
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2021-2025",
      "rank": 16750
    },
    {
      "id": "4700152645",
      "title": "International Journal on Artificial Intelligence Tools",
      "issn": [
        "02182130",
        "17936349"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.296,
        "sjrQuartile": "Q3",
        "hIndex": 41,
        "totalDocs2024": 64,
        "totalDocs3Years": 203,
        "citationsPerDoc": 1.83,
        "totalCitations3Years": 383
      },
      "scope": "The International Journal on Artificial Intelligence Tools (IJAIT) provides an interdisciplinary forum in which AI scientists and professionals can share their research results and report new advances on AI tools or tools that use AI. Tools refer to architectures, languages or algorithms, which constitute the means connecting theory with applications. So, IJAIT is a medium for promoting general and/or special purpose tools, which are very important for the evolution of science and manipulation of knowledge. IJAIT can also be used as a test ground for new AI tools. Topics covered by IJAIT include but are not limited to: AI in Bioinformatics, AI for Service Engineering, AI for Software Engineering, AI for Ubiquitous Computing, AI for Web Intelligence Applications, AI Parallel Processing Tools (hardware/software), AI Programming Languages, AI Tools for CAD and VLSI Analysis/Design/Testing, AI Tools for Computer Vision and Speech Understanding, AI Tools for Multimedia, Cognitive Informatics, Data Mining and Machine Learning Tools, Heuristic and AI Planning Strategies and Tools, Image Understanding, Integrated/Hybrid AI Approaches, Intelligent System Architectures, Knowledge-Based/Expert Systems, Knowledge Management and Processing Tools, Knowledge Representation Languages, Natural Language Understanding, Neural Networks for AI, Object-Oriented Programming for AI, Reasoning and Evolution of Knowledge Bases, Self-Healing and Autonomous Systems, and Software Engineering for AI.",
      "categories": [
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2005-2025",
      "rank": 16784
    },
    {
      "id": "29055",
      "title": "Modern Physics Letters B",
      "issn": [
        "02179849",
        "17936640"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.293,
        "sjrQuartile": "Q3",
        "hIndex": 60,
        "totalDocs2024": 618,
        "totalDocs3Years": 1200,
        "citationsPerDoc": 2.17,
        "totalCitations3Years": 2239
      },
      "scope": "MPLB opens a channel for the fast circulation of important and useful research findings in Condensed Matter Physics, Statistical Physics, as well as Atomic, Molecular and Optical Physics. A strong emphasis is placed on topics of current interest, such as cold atoms and molecules, new topological materials and phases, and novel low-dimensional materials. The journal also contains a Brief Reviews section with the purpose of publishing short reports on the latest experimental findings and urgent new theoretical developments.",
      "categories": [
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q3"
        },
        {
          "name": "Statistical and Nonlinear Physics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 16879
    },
    {
      "id": "11700154320",
      "title": "Journal of Developmental Entrepreneurship",
      "issn": [
        "1793706X",
        "10849467"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.29,
        "sjrQuartile": "Q3",
        "hIndex": 34,
        "totalDocs2024": 32,
        "totalDocs3Years": 96,
        "citationsPerDoc": 0.91,
        "totalCitations3Years": 124
      },
      "scope": "The Journal of Developmental Entrepreneurship (JDE) provides a forum for the dissemination of descriptive, empirical, and theoretical research that focuses on issues concerning microenterprise and small business development, especially under conditions of adversity. The intended audiences for JDE are scholars who study issues of developmental entrepreneurship and professionals involved in governmental and non-governmental efforts to facilitate entrepreneurship in economic and community development programs around the world. Articles will cover a broad range of topics, including: -Entrepreneurship and self-employment in developing contexts -Challenges and opportunities unique to minority and women entrepreneurs -Microenterprise funds and private-sector small business lending practices -Legislation, regulation, and tax policy that impact entrepreneurship and economic development -Processes that facilitate growth and development within emerging enterprises -Networks within and among entrepreneurial ventures -Marketing patterns and approaches in venture growth and development -International developmental entrepreneurship programs -Entrepreneurship in the informal economic sector -Education and training for aspiring entrepreneurs -Industry practices that adversely affect microenterprise development -Economic and social impacts of microenterprise activity",
      "categories": [
        {
          "name": "Business and International Management",
          "quartile": "Q3"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q3"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2008-2024",
      "rank": 16967
    },
    {
      "id": "144884",
      "title": "WSEAS Transactions on Mathematics",
      "issn": [
        "11092769"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.29,
        "sjrQuartile": "Q3",
        "hIndex": 26,
        "totalDocs2024": 107,
        "totalDocs3Years": 293,
        "citationsPerDoc": 0.88,
        "totalCitations3Years": 242
      },
      "scope": "",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q3"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Control and Optimization",
          "quartile": "Q3"
        },
        {
          "name": "Discrete Mathematics and Combinatorics",
          "quartile": "Q3"
        },
        {
          "name": "Management Science and Operations Research",
          "quartile": "Q3"
        },
        {
          "name": "Statistics and Probability",
          "quartile": "Q3"
        },
        {
          "name": "Endocrinology, Diabetes and Metabolism",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Decision Sciences",
        "Mathematics",
        "Medicine"
      ],
      "country": "Greece",
      "coverage": "2005-2014, 2017-2025",
      "rank": 16973
    },
    {
      "id": "21101039445",
      "title": "Journal of Micromechanics and Molecular Physics",
      "issn": [
        "24249149",
        "24249130"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.287,
        "sjrQuartile": "Q3",
        "hIndex": 18,
        "totalDocs2024": 18,
        "totalDocs3Years": 64,
        "citationsPerDoc": 1.0,
        "totalCitations3Years": 84
      },
      "scope": "The Journal of Micromechanics and Molecular Physics (JMMP) provides an international academic forum to disseminate fundamental research and developments in the nanomechanics and micromechanics of materials and with regard to molecular physics. JMMP focuses on theoretical developments, experimental innovations, and computational and simulation methods in the fields of micromechanics and molecular physics, and the discovery of nanoscale and nanostructured materials, composite materials, and novel advanced materials, with emphasis on the mechanics and physics of microstructures, characterization and modeling, material design, processing and manufacturing, and the interrelation and correlation between the micro-/nanostructures of materials and their macroscale functions.",
      "categories": [
        {
          "name": "Atomic and Molecular Physics, and Optics",
          "quartile": "Q3"
        },
        {
          "name": "Ceramics and Composites",
          "quartile": "Q3"
        },
        {
          "name": "Mechanics of Materials",
          "quartile": "Q3"
        },
        {
          "name": "Polymers and Plastics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2016-2024",
      "rank": 17063
    },
    {
      "id": "17334",
      "title": "International Journal of Theoretical and Applied Finance",
      "issn": [
        "02190249",
        "17936322"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.282,
        "sjrQuartile": "Q2",
        "hIndex": 40,
        "totalDocs2024": 31,
        "totalDocs3Years": 106,
        "citationsPerDoc": 0.38,
        "totalCitations3Years": 54
      },
      "scope": "The International Journal of Theoretical and Applied Finance (IJTAF) brings together experts involved in the mathematical modelling of financial instruments and the application of these models to global financial markets. Financial instruments that have been designed to serve the needs of mature capital markets and established trading forums need to be adapted for application in emerging markets and evolving trading venues. The development of new financial products and trading methodologies has also led to new challenges for regulatory bodies. Issues addressed in IJTAF include: (a) development of sophisticated mathematical models based on the principles of modern finance theory, (b) calibration of these models to market data, (c) simulation of such models using efficient computational algorithms, (d) updating of these models in line with evolving market developments, and (e) adaptation of these models by the practitioners in the industry; emphasis will also be placed on (f) development and application of modern stochastic methods in finance. State-of-the-art financial modelling draws upon expertise from various disciplines besides finance; in particular, experts from mathematics, statistics, economics, and computer science have made significant contributions to this field. IJTAF brings together experts from these multi-disciplines and provides a platform for the synthesis of the various specializations that are actively involved in financial modelling. The disciplines covered by IJTAF include: mathematical finance; financial engineering; applications of modern probability theory and stochastic analysis in finance; models for interest rate, equity, foreign exchange, commodity, credit and inflation-linked products; portfolio theory and long-term investment; quantification of risk; ...",
      "categories": [
        {
          "name": "Economics, Econometrics and Finance (miscellaneous)",
          "quartile": "Q2"
        },
        {
          "name": "Finance",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2003-2025",
      "rank": 17238
    },
    {
      "id": "4000149107",
      "title": "International Journal of Wavelets, Multiresolution and Information Processing",
      "issn": [
        "1793690X",
        "02196913"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.28,
        "sjrQuartile": "Q3",
        "hIndex": 31,
        "totalDocs2024": 82,
        "totalDocs3Years": 196,
        "citationsPerDoc": 1.2,
        "totalCitations3Years": 234
      },
      "scope": "International Journal of Wavelets, Multiresolution and Information Processing (hereafter referred to as IJWMIP) is a bi-monthly publication for theoretical and applied papers on the current state-of-the-art results of wavelet analysis, multiresolution and information processing. Papers related to the IJWMIP theme are especially solicited, including theories, methodologies, algorithms and emerging applications. Topics of interest of the IJWMIP include, but are not limited to: 1. Wavelets: Wavelets and operator theory Frame and applications Time-frequency analysis and applications Sparse representation and approximation Sampling theory and compressive sensing Wavelet based algorithms and applications 2. Multiresolution: Multiresolution analysis Multiscale approximation Multiresolution image processing and signal processing Multiresolution representations Deep learning and neural networks Machine learning theory, algorithms and applications High dimensional data analysis 3. Information Processing: Data sciences Big data and applications Information theory Information systems and technology Information security Information learning and processing Artificial intelligence and pattern recognition Image/signal processing.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Information Systems",
          "quartile": "Q3"
        },
        {
          "name": "Signal Processing",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2006-2025",
      "rank": 17330
    },
    {
      "id": "14500154706",
      "title": "International Journal of Computational Intelligence and Applications",
      "issn": [
        "14690268",
        "17575885"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.279,
        "sjrQuartile": "Q3",
        "hIndex": 26,
        "totalDocs2024": 36,
        "totalDocs3Years": 92,
        "citationsPerDoc": 2.22,
        "totalCitations3Years": 180
      },
      "scope": "The International Journal of Computational Intelligence and Applications, IJCIA, is a refereed journal dedicated to the theory and applications of computational intelligence (artificial neural networks, fuzzy systems, evolutionary computation and hybrid systems). The main goal of this journal is to provide the scientific community and industry with a vehicle whereby ideas using two or more conventional and computational intelligence based techniques could be discussed. The IJCIA welcomes original works in areas such as neural networks, fuzzy logic, evolutionary computation, pattern recognition, hybrid intelligent systems, symbolic machine learning, statistical models, image/audio/video compression and retrieval. The IJCIA greatly encourages new ideas, combining two or more areas, such as neuro-fuzzy, neuro-symbolic, neuro-evolutionary, neuro-symbolic, neuro-pattern recognition, fuzzy-evolutionary, evolutionary-symbolic, fuzzy-evolutionary, evolutionary-symbolic, fuzzy-symbolic, etc. to be submitted.",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Software",
          "quartile": "Q3"
        },
        {
          "name": "Theoretical Computer Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 17366
    },
    {
      "id": "21101067491",
      "title": "Journal of Medical Robotics Research",
      "issn": [
        "24249068",
        "2424905X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.278,
        "sjrQuartile": "Q3",
        "hIndex": 18,
        "totalDocs2024": 20,
        "totalDocs3Years": 33,
        "citationsPerDoc": 1.2,
        "totalCitations3Years": 44
      },
      "scope": "The Journal of Medical Robotics Research (JMRR) invites fundamental scientific and technological contributions as well as clinical evaluation studies in several areas, including, but not limited to:  Robot-assisted Surgery  Image-guided Interventions  Rehabilitation Robotics  Assistive Robotics  Surgical simulation  Image-guided Diagnosis and Therapy  Nano-scale and micro-scale Interventions  Telesurgery  Haptics for Medical Robotics  Smart instrumented tools for surgery  Surgical Navigation  Surgical Workflow  Wearable Rehabilitation Systems",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q3"
        },
        {
          "name": "Biomedical Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Human-Computer Interaction",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2016-2025",
      "rank": 17401
    },
    {
      "id": "24310",
      "title": "International Journal of Pattern Recognition and Artificial Intelligence",
      "issn": [
        "02180014",
        "17936381"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.273,
        "sjrQuartile": "Q3",
        "hIndex": 64,
        "totalDocs2024": 188,
        "totalDocs3Years": 652,
        "citationsPerDoc": 1.5,
        "totalCitations3Years": 911
      },
      "scope": "The International Journal of Pattern Recognition and Artificial Intelligence (IJPRAI) welcomes both theory-oriented and innovative applications articles on new developments and is of interest to both researchers in academia and industry. The current scope of this journal includes:  Pattern Recognition  Machine Learning  Deep Learning  Document Analysis  Image Processing  Signal Processing  Computer Vision  Biometrics  Biomedical Image Analysis  Artificial Intelligence In addition to regular papers describing original research work, survey articles on timely and important research topics are highly welcome. Special issues with focused topics within the scope of this journal are also published.",
      "categories": [
        {
          "name": "Computer Vision and Pattern Recognition",
          "quartile": "Q3"
        },
        {
          "name": "Software",
          "quartile": "Q3"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "1995-2025",
      "rank": 17618
    },
    {
      "id": "21101060452",
      "title": "Vietnam Journal of Computer Science",
      "issn": [
        "21968896"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.272,
        "sjrQuartile": "Q3",
        "hIndex": 11,
        "totalDocs2024": 38,
        "totalDocs3Years": 77,
        "citationsPerDoc": 2.02,
        "totalCitations3Years": 127
      },
      "scope": "Representation and management of knowledge: Conceptual knowledge models. Knowledge representation techniques. Knowledge manipulation languages and techniques. Knowledge engineering techniques. Architectures of knowledge-based and intelligent systems: New architectures for knowledge base / expert and intelligent systems, design and implementation techniques, languages and user interfaces, distributed architectures. Data Science: All methods for data engineering including big data techniques and their applications. Construction of knowledge bases and intelligent systems: Knowledge base design methodologies and tools, knowledge acquisition methods, intelligent systems design methods, integrity/security/maintenance issues. Applications, case studies, and management issues: Knowledge administration issues, knowledge engineering practice, intelligent systems practice, office and engineering applications. Tools: Specifying and developing knowledge engineering methods and intelligent systems using tools based on Artificial Intelligence methods and techniques. Web aspects: implementing, designing and using knowledge-based systems and intelligent systems for Web. Foundation of Computer Science: Cryptography, theory of computation, models of computation, algorithms and data structures, programming language theory",
      "categories": [
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Computer Vision and Pattern Recognition",
          "quartile": "Q3"
        },
        {
          "name": "Information Systems",
          "quartile": "Q3"
        },
        {
          "name": "Software",
          "quartile": "Q3"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2019-2025",
      "rank": 17680
    },
    {
      "id": "21100837973",
      "title": "Discrete Mathematics, Algorithms and Applications",
      "issn": [
        "17938317",
        "17938309"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.271,
        "sjrQuartile": "Q3",
        "hIndex": 25,
        "totalDocs2024": 190,
        "totalDocs3Years": 397,
        "citationsPerDoc": 0.59,
        "totalCitations3Years": 265
      },
      "scope": "The aim of this journal is to advance and promote the theory and applications of discrete mathematics, which is a research area in mathematics with applications in computer science, industrial engineering, bio-informatics, chemistry and communication networks. The journal encourages contributions from the two important parts of discrete mathematics, graph theory and combinatorics. The former includes structural graph theory, extremal graph theory, algebraic graph theory, random graphs and internet graphs. The latter consists of combinatorial design, combinatorial enumeration, coding theory, combinatorial probabilistic method, etc.",
      "categories": [
        {
          "name": "Discrete Mathematics and Combinatorics",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2009-2025",
      "rank": 17707
    },
    {
      "id": "15629",
      "title": "International Journal of Cooperative Information Systems",
      "issn": [
        "02188430",
        "17936365"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.268,
        "sjrQuartile": "Q3",
        "hIndex": 48,
        "totalDocs2024": 20,
        "totalDocs3Years": 25,
        "citationsPerDoc": 1.71,
        "totalCitations3Years": 49
      },
      "scope": "The paradigm for the next generation of information systems (ISs) will involve large numbers of ISs distributed over large, complex computer/communication networks. Such ISs will manage or have access to large amounts of information and computing services and will interoperate as required. These support individual or collaborative human work. Communication among component systems will be done using protocols that range from conventional ones to those based on distributed AI. We call such next generation ISs Cooperative Information Systems (CIS). The International Journal of Cooperative Information Systems (IJCIS) addresses the intricacies of cooperative work in the framework of distributed interoperable information systems. It provides a forum for the presentation and dissemination of research covering all aspects of CIS design, requirements, functionality, implementation, deployment, and evolution.",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Information Systems",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "1996-2024",
      "rank": 17841
    },
    {
      "id": "26046",
      "title": "Journal of Circuits, Systems and Computers",
      "issn": [
        "17936454",
        "02181266"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.263,
        "sjrQuartile": "Q3",
        "hIndex": 43,
        "totalDocs2024": 399,
        "totalDocs3Years": 991,
        "citationsPerDoc": 1.57,
        "totalCitations3Years": 1480
      },
      "scope": "Journal of Circuits, Systems, and Computers covers a wide scope, ranging from mathematical foundations to practical engineering design in the general areas of circuits, systems, and computers with focus on their circuit aspects. Although primary emphasis will be on research papers, survey, expository and tutorial papers are also welcome. The journal consists of two sections: Papers - Contributions in this section may be of a research or tutorial nature. Research papers must be original and must not duplicate descriptions or derivations available elsewhere. The author should limit paper length whenever this can be done without impairing quality. Letters - This section provides a vehicle for speedy publication of new results and information of current interest in circuits, systems, and computers. Focus will be directed to practical design- and applications-oriented contributions, but publication in this section will not be restricted to this material. These letters are to concentrate on reporting the results obtained, their significance and the conclusions, while including only the minimum of supporting details required to understand the contribution. Publication of a manuscript in this manner does not preclude a later publication with a fully developed version.",
      "categories": [
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Hardware and Architecture",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "1996-2000, 2002-2025",
      "rank": 18052
    },
    {
      "id": "25885",
      "title": "Issues and Studies",
      "issn": [
        "2529802X",
        "10132511"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.261,
        "sjrQuartile": "Q2",
        "hIndex": 24,
        "totalDocs2024": 20,
        "totalDocs3Years": 49,
        "citationsPerDoc": 0.94,
        "totalCitations3Years": 48
      },
      "scope": "ISSUES & STUDIES (ISSN 1013-2511) is published quarterly by the Institute of International Relations, National Chengchi University, Taipei. IS is an internationally peer-reviewed journal dedicated to publishing quality social science research on issues C mainly of a political nature C related to the domestic and international affairs of contemporary China, Taiwan, and East Asia, as well as other closely related topics. The editors particularly welcome manuscripts related to China and Taiwan.",
      "categories": [
        {
          "name": "Political Science and International Relations",
          "quartile": "Q2"
        },
        {
          "name": "Sociology and Political Science",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Social Sciences"
      ],
      "country": "Taiwan",
      "coverage": "1972-1975, 1978, 1980, 1985, 1995-2024",
      "rank": 18128
    },
    {
      "id": "19900192598",
      "title": "International Journal of Modeling, Simulation, and Scientific Computing",
      "issn": [
        "17939623",
        "17939615"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.259,
        "sjrQuartile": "Q3",
        "hIndex": 25,
        "totalDocs2024": 97,
        "totalDocs3Years": 256,
        "citationsPerDoc": 1.54,
        "totalCitations3Years": 364
      },
      "scope": "The International Journal of Modeling, Simulation, and Scientific Computing (IJMSSC) is a bimonthly journal which provides an international forum for researchers, scholars, and engineers in the fields of system modeling, simulation and scientific computing to publish high-quality and refereed papers, and disseminate the latest theoretical results and their practical applications. The scope of the journal covers, but is not limited to Modeling and simulation (M&S) theory and methodology Modeling and simulation languages Verification, validation and accreditation theory and technology Model Engineering / Model Based System Engineering Optimization in M&S Artificial Intelligence / Machine Learning / Big Data in M&S Finite element methods, finite difference methods Distributed Computing/High Performance Computing/Pervasive Computing/Grid Computing/Cloud Computing/Edge Computing/Fog Computing M&S of continuous systems/discrete systems/hybrid systems/Intelligent systems M&S technology of complex systems/system of systems/cyber physical systems Simulation Based Acquisition /Virtual Prototyping / Digital Twin Cloud / mobile / embedded simulation Agent based M&S Data driven M&S High performance simulation Serious Games Simulation supporting tools and platforms Simulators Simulation application techniques.",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2010-2025",
      "rank": 18226
    },
    {
      "id": "21100206263",
      "title": "New Mathematics and Natural Computation",
      "issn": [
        "17937027",
        "17930057"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.258,
        "sjrQuartile": "Q3",
        "hIndex": 20,
        "totalDocs2024": 112,
        "totalDocs3Years": 143,
        "citationsPerDoc": 1.44,
        "totalCitations3Years": 174
      },
      "scope": "Recognizing the world is full of vagueness and uncertainty, this journal has chosen three very focused areas of research: Mathematics of Uncertainty Economics & Finances Cognitive Science The close cooperation of the above three areas is of paramount importance. This journal strongly encourages the suggestions of any topic within these three general areas of research. The journal has demonstrated there is room for artificial intelligence & modern control theory in contributing solutions to some selected economic problems. We shall continue to explore other possibilities. A new initiative on cognitive science and economics is a good example. Over the years, this journal has published some papers on pattern recognition, image processing, and natural languages vis-a-vis artificial intelligence. We welcome any proposal on worthy new initiatives.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Human-Computer Interaction",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2012-2025",
      "rank": 18281
    },
    {
      "id": "19700182027",
      "title": "Functional Materials Letters",
      "issn": [
        "17936047",
        "17937213"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.255,
        "sjrQuartile": "Q3",
        "hIndex": 36,
        "totalDocs2024": 88,
        "totalDocs3Years": 302,
        "citationsPerDoc": 0.95,
        "totalCitations3Years": 315
      },
      "scope": "Functional Materials Letters is an international peer-reviewed scientific journal for original contributions to research on the synthesis, behavior and characterization of functional materials. The journal seeks to provide a rapid forum for the communication of novel research of high quality and with an interdisciplinary flavor. The journal is an ideal forum for communication amongst materials scientists and engineers, chemists and chemical engineers, and physicists in the dynamic fields associated with functional materials. Functional materials are designed to make use of their natural or engineered functionalities to respond to changes in electrical and magnetic fields, physical and chemical environment, etc. These design considerations are fundamentally different to those relevant for structural materials and are the focus of this journal. Functional materials play an increasingly important role in the development of the field of materials science and engineering. The scope of the journal covers theoretical and experimental studies of functional materials, characterization and new applications-related research on functional materials in macro-, micro- and nano-scale science and engineering. Among the topics covered are ferroelectric, multiferroic, ferromagnetic, magneto-optical, optoelectric, thermoelectric, energy conversion and energy storage, sustainable energy and shape memory materials.",
      "categories": [
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Materials Science"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 18383
    },
    {
      "id": "18761",
      "title": "Advances in Complex Systems",
      "issn": [
        "02195259",
        "17936802"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.252,
        "sjrQuartile": "Q2",
        "hIndex": 40,
        "totalDocs2024": 17,
        "totalDocs3Years": 66,
        "citationsPerDoc": 0.8,
        "totalCitations3Years": 61
      },
      "scope": "Advances in Complex Systems aims to provide a unique medium of communication for multidisciplinary approaches, either empirical or theoretical, to the study of complex systems. The latter are seen as systems comprised of multiple interacting components, or agents. Nonlinear feedback processes, stochastic influences, specific conditions for the supply of energy, matter, or information may lead to the emergence of new system qualities on the macroscopic scale that cannot be reduced to the dynamics of the agents. Quantitative approaches to the dynamics of complex systems have to consider a broad range of concepts, from analytical tools, statistical methods and computer simulations to distributed problem solving, learning and adaptation. This is an interdisciplinary enterprise.",
      "categories": [
        {
          "name": "Multidisciplinary",
          "quartile": "Q2"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Engineering",
        "Multidisciplinary"
      ],
      "country": "Singapore",
      "coverage": "2004-2025",
      "rank": 18491
    },
    {
      "id": "21100869464",
      "title": "International Journal of Image and Graphics",
      "issn": [
        "02194678",
        "17936756"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.251,
        "sjrQuartile": "Q3",
        "hIndex": 26,
        "totalDocs2024": 150,
        "totalDocs3Years": 240,
        "citationsPerDoc": 1.63,
        "totalCitations3Years": 352
      },
      "scope": "International Journal of Image and Graphics (IJIG) will emphasize on efficient and effective image and graphics technologies and systems, and provide a central forum for scientists, researchers, engineers and vendors from different disciplines to exchange ideas, identify problems, investigate relevant issues, share common interests, explore new directions, and initiate possible collaborative research and system development. This journal will significantly benefit a large variety of academic and industrial sectors. More specifically, this journal will cover the following research and application issues: Image Processing  Image acquisition and storage  Image pre-processing  Image coding and transmission  Image indexing and retrieval Image Analysis and Understanding  Image segmentation and measurement  Texture and motion analysis  Image matching and scene interpretation  3-D modeling Pattern Recognition Application  Statistical, structural and neural approaches  Character, speech, image and video applications  Biometrics technologies and system Computer Vision  Active, real-time and stereo computer vision  VLSI image model, algorithm and architecture  Multi-modal image systems Graphics Modeling, Rendering and Animation  Graphics algorithms  Modeling methods  Rendering algorithms  Animation....",
      "categories": [
        {
          "name": "Computer Graphics and Computer-Aided Design",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q3"
        },
        {
          "name": "Computer Vision and Pattern Recognition",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2001-2025",
      "rank": 18554
    },
    {
      "id": "29018",
      "title": "International Journal of Modern Physics E",
      "issn": [
        "17936608",
        "02183013"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.251,
        "sjrQuartile": "Q3",
        "hIndex": 60,
        "totalDocs2024": 100,
        "totalDocs3Years": 322,
        "citationsPerDoc": 0.83,
        "totalCitations3Years": 273
      },
      "scope": "This journal covers the topics on experimental and theoretical nuclear physics, and its applications and interface with astrophysics and particle physics. The journal publishes research articles as well as review articles on topics of current interest.",
      "categories": [
        {
          "name": "Nuclear and High Energy Physics",
          "quartile": "Q3"
        },
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 18555
    },
    {
      "id": "12415",
      "title": "International Journal of Reliability, Quality and Safety Engineering",
      "issn": [
        "02185393",
        "17936446"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.25,
        "sjrQuartile": "Q3",
        "hIndex": 34,
        "totalDocs2024": 59,
        "totalDocs3Years": 127,
        "citationsPerDoc": 1.49,
        "totalCitations3Years": 185
      },
      "scope": "IJRQSE is a refereed journal focusing on both the theoretical and practical aspects of reliability, quality, and safety in engineering. The journal is intended to cover a broad spectrum of issues in manufacturing, computing, software, aerospace, control, nuclear systems, power systems, communication systems, and electronics. Papers are sought in the theoretical domain as well as in such practical fields as industry and laboratory research. The journal is published six issues per year. It is intended to bridge the gap between the theoretical experts and practitioners in the academic, scientific, government, and business communities. Review articles and case studies are also welcome in addition to innovative works in all key areas of the journal. Submission topics include but are not limited to the following: Reliability, quality assurance and engineering, software, algorithms, design and manufacturing, fuzzy logic, reliability growth and prediction, safety engineering, software testing and reliability, modeling and control issues, concurrent engineering, optimization of system reliability, performance analysis of systems, quality planning and measurements, risk assessment and analysis, fault-tolerant computing, and critical systems design.",
      "categories": [
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Energy Engineering and Power Technology",
          "quartile": "Q3"
        },
        {
          "name": "Industrial and Manufacturing Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Nuclear Energy and Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Safety, Risk, Reliability and Quality",
          "quartile": "Q3"
        },
        {
          "name": "Aerospace Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Energy",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 18604
    },
    {
      "id": "4700152641",
      "title": "International Journal of Foundations of Computer Science",
      "issn": [
        "17936373",
        "01290541"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.245,
        "sjrQuartile": "Q3",
        "hIndex": 45,
        "totalDocs2024": 71,
        "totalDocs3Years": 175,
        "citationsPerDoc": 0.87,
        "totalCitations3Years": 147
      },
      "scope": "The International Journal of Foundations of Computer Science is a bimonthly journal that publishes articles which contribute new theoretical results in all areas of the foundations of computer science. The theoretical and mathematical aspects covered include: - Algebraic theory of computing and formal systems - Algorithm and system implementation issues - Approximation, probabilistic, and randomized algorithms - Automata and formal languages - Automated deduction - Combinatorics and graph theory - Complexity theory - Computational biology and bioinformatics - Cryptography - Database theory - Data structures - Design and analysis of algorithms - DNA computing - Foundations of computer security - Foundations of high-performance computing",
      "categories": [
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2000-2025",
      "rank": 18802
    },
    {
      "id": "19700186869",
      "title": "WSEAS Transactions on Applied and Theoretical Mechanics",
      "issn": [
        "19918747",
        "22243429"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.244,
        "sjrQuartile": "Q3",
        "hIndex": 13,
        "totalDocs2024": 20,
        "totalDocs3Years": 95,
        "citationsPerDoc": 0.95,
        "totalCitations3Years": 83
      },
      "scope": "",
      "categories": [
        {
          "name": "Civil and Structural Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Computational Mechanics",
          "quartile": "Q3"
        },
        {
          "name": "Fluid Flow and Transfer Processes",
          "quartile": "Q3"
        },
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Mechanical Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Mechanics of Materials",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Chemical Engineering",
        "Engineering",
        "Materials Science"
      ],
      "country": "Greece",
      "coverage": "2008-2013, 2015, 2017-2025",
      "rank": 18869
    },
    {
      "id": "19900193684",
      "title": "Journal of Multiscale Modelling",
      "issn": [
        "17569737",
        "17569745"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.244,
        "sjrQuartile": "Q4",
        "hIndex": 12,
        "totalDocs2024": 10,
        "totalDocs3Years": 47,
        "citationsPerDoc": 0.76,
        "totalCitations3Years": 50
      },
      "scope": "Multiscale Modelling is a relatively new research field which has in a short time had a significant impact on many scientific and engineering disciplines including material science, fluid dynamics, chemistry, and biology. In these areas problems are often multiphysics and have important features at multiple scales, particularly multiple spatial scales. Multiscale Modelling is an international peer-reviewed journal that presents forefront fundamental works in the above field of research. It features timely scientific reports of advances in modelling and computation, theoretical breakthroughs and also contains interesting review articles about emerging issues. Multiscale Modelling provides a common platform for exchange of views and presentation of original papers (theoretical, computational and experimental) with a general emphasis on Multiscale issues in this rapidly developing field. Papers reporting advancement of the theory and applications of single scale problems (i.e. Nano, Micro, etc.) which pave the way for multiscale implementation are also appropriate for the journal. Research areas of interest include for example multiscale modelling and computation in: composite and polymer materials, crystalline microstructures, nanomaterials, opto electronics for the development of materials with particular optical, magnetic and electrical properties, flow through porous media, dendritic solidification, turbulent transport in high Reylonds number flows, spray combustion, large-scale molecular dynamic simulation, environmental applications such as separation of gas, toxicological properties, environmental impact, chemistry and biological systems.",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2009-2010, 2019-2025",
      "rank": 18870
    },
    {
      "id": "29428",
      "title": "Fluctuation and Noise Letters",
      "issn": [
        "17936780",
        "02194775"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.243,
        "sjrQuartile": "Q3",
        "hIndex": 36,
        "totalDocs2024": 107,
        "totalDocs3Years": 189,
        "citationsPerDoc": 1.26,
        "totalCitations3Years": 281
      },
      "scope": "Fluctuation and Noise Letters (FNL) is unique. It is the only specialist journal for fluctuations and noise, and it covers that topic throughout the whole of science in a completely interdisciplinary way. High standards of refereeing and editorial judgment are guaranteed by the selection of Editors from among the leading scientists of the field. FNL places equal emphasis on both fundamental and applied science and the name \"Letters\" is to indicate speed of publication, rather than a limitation on the lengths of papers. The journal uses on-line submission and provides for immediate on-line publication of accepted papers. FNL is interested in interdisciplinary articles on random fluctuations, quite generally. For example: noise enhanced phenomena including stochastic resonance; 1/f noise; shot noise; fluctuation-dissipation; cardiovascular dynamics; ion channels; single molecules; neural systems; quantum fluctuations; quantum computation; classical and quantum information; statistical physics; degradation and aging phenomena; percolation systems; fluctuations in social systems; traffic; the stock market; environment and climate; etc.",
      "categories": [
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2004-2008, 2010-2025",
      "rank": 18894
    },
    {
      "id": "21100237436",
      "title": "Journal of Information and Knowledge Management",
      "issn": [
        "02196492",
        "17936926"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.234,
        "sjrQuartile": "Q3",
        "hIndex": 28,
        "totalDocs2024": 108,
        "totalDocs3Years": 247,
        "citationsPerDoc": 1.65,
        "totalCitations3Years": 373
      },
      "scope": "JIKM is a refereed journal published quarterly by World Scientific and dedicated to the exchange of the latest research and practical information in the field of information processing and knowledge management. The journal publishes original research and case studies by academic, business and government contributors on all aspects of information processing, information management, knowledge management, tools, techniques and technologies, knowledge creation and sharing, best practices, policies and guidelines. JIKM is an international journal aimed at providing quality information to subscribers around the world. Managed by an international editorial board, JIKM positions itself as one of the leading scholarly journals in the field of information processing and knowledge management. It is a good reference for both information and knowledge management professionals. The journal covers key areas in the field of information and knowledge management. Research papers, practical applications, working papers, and case studies are invited in the following areas: -Business intelligence and competitive intelligence -Communication and organizational culture -e-Learning and life long learning -Electronic records and document management -Information processing and information management -Information organization, taxonomies and ontology -Intellectual capital -Knowledge creation, retention, sharing and transfer -Knowledge discovery, data and text mining -Knowledge management and innovations -Knowledge management education -Knowledge management tools and technologies -Knowledge management measurements -Knowledge professionals and leadership -Learning organization and organizational learning -Practical implementations of knowledge management",
      "categories": [
        {
          "name": "Computer Networks and Communications",
          "quartile": "Q3"
        },
        {
          "name": "Library and Information Sciences",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2002-2025",
      "rank": 19345
    },
    {
      "id": "29556",
      "title": "Journal of Bioinformatics and Computational Biology",
      "issn": [
        "02197200",
        "17576334"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.234,
        "sjrQuartile": "Q4",
        "hIndex": 49,
        "totalDocs2024": 33,
        "totalDocs3Years": 135,
        "citationsPerDoc": 0.75,
        "totalCitations3Years": 134
      },
      "scope": "The Journal of Bioinformatics and Computational Biology aims to publish high quality, original research articles, expository tutorial papers and review papers as well as short, critical comments on technical issues associated with the analysis of cellular information. The research papers will be technical presentations of new assertions, discoveries and tools, intended for a narrower specialist community. The tutorials, reviews and critical commentary will be targeted at a broader readership of biologists who are interested in using computers but are not knowledgeable about scientific computing, and equally, computer scientists who have an interest in biology but are not familiar with current thrusts nor the language of biology. Such carefully chosen tutorials and articles should greatly accelerate the rate of entry of these new creative scientists into the field.",
      "categories": [
        {
          "name": "Biochemistry",
          "quartile": "Q4"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Molecular Biology",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Biochemistry, Genetics and Molecular Biology",
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2003-2024",
      "rank": 19364
    },
    {
      "id": "27676",
      "title": "Journal of Advanced Manufacturing Systems",
      "issn": [
        "17936896",
        "02196867"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.232,
        "sjrQuartile": "Q3",
        "hIndex": 26,
        "totalDocs2024": 55,
        "totalDocs3Years": 128,
        "citationsPerDoc": 1.7,
        "totalCitations3Years": 208
      },
      "scope": "Journal of Advanced Manufacturing Systems publishes original papers pertaining to the state-of-the-art research and development, product development, process planning, resource planning, applications and tools in the areas related to advanced manufacturing including advanced manufacturing technologies. The journal addresses: Manufacturing Systems Collaborative Design Collaborative Decision Making Product Simulation In-Process Modeling Resource Planning Resource Simulation Tooling Design Planning and Scheduling Virtual Reality Technologies and Applications CAD/CAE/CAM Systems Networking and Distribution Supply Chain Management Advanced Manufacturing Technologies.",
      "categories": [
        {
          "name": "Industrial and Manufacturing Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Computer Science",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2004-2025",
      "rank": 19439
    },
    {
      "id": "21100922608",
      "title": "International Journal of Computational Materials Science and Engineering",
      "issn": [
        "2047685X",
        "20476841"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.231,
        "sjrQuartile": "Q3",
        "hIndex": 16,
        "totalDocs2024": 44,
        "totalDocs3Years": 103,
        "citationsPerDoc": 1.44,
        "totalCitations3Years": 137
      },
      "scope": "The objective of the journal is the publication and wide electronic dissemination of innovative and consequential research in all aspects computational materials science and engineering, featuring the most advanced mathematical modeling and numerical methodology developments. It will aim to attract and solicit high-quality original research papers in all aspects of computational materials science and engineering with special emphasis on the most current topics of interest to the associated research communities. The journal will also serve as an effective platform for the promotion of scientific exchange between active materials scientists and engineers. The journal aims to promote international exchange of new knowledge and recent developments in all aspects of computational materials science and engineering, featuring the most advanced mathematical modeling and numerical methodology developments. It includes all classes of materials (metals, polymers, ceramics, composites, biomaterials, nanomaterials, etc.) and their structures (functional solids, soft matter, multiphase materials, coatings, etc.). Of specific interest are the underlying physics and chemistry governing the functional elements of the materials, and these functions include (but are not limited to) structural, electronic, thermal, chemical, magnetic, optical, or a combination of any of these. Although the analytical and numerical analyses of these materials' functional elements will constitute the main highlights of this journal, important computational studies of others aspects will also be welcome, such as imperfections in materials and their resulting limitations, novel processes for advanced materials synthesis, engineering of material properties, environmental consideration in material performance, etc.",
      "categories": [
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Mechanics of Materials",
          "quartile": "Q4"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q4"
        },
        {
          "name": "Numerical Analysis",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Materials Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2012-2025",
      "rank": 19501
    },
    {
      "id": "24646",
      "title": "Journal of Porphyrins and Phthalocyanines",
      "issn": [
        "10991409",
        "10884246"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.228,
        "sjrQuartile": "Q3",
        "hIndex": 71,
        "totalDocs2024": 83,
        "totalDocs3Years": 390,
        "citationsPerDoc": 0.9,
        "totalCitations3Years": 348
      },
      "scope": "The Journal of Porphyrins and Phthalocyanines (JPP) covers research in the chemistry, physics, biology and technology of porphyrins, phthalocyanines and related macrocycles. Research papers, review articles and short communications deal with the synthesis, spectroscopy, processing and applications of these compounds.",
      "categories": [
        {
          "name": "Chemistry (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Chemistry"
      ],
      "country": "Singapore",
      "coverage": "1997-2025",
      "rank": 19634
    },
    {
      "id": "21101075726",
      "title": "Journal of Financial Management, Markets and Institutions",
      "issn": [
        "2282717X"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.225,
        "sjrQuartile": "Q3",
        "hIndex": 6,
        "totalDocs2024": 13,
        "totalDocs3Years": 36,
        "citationsPerDoc": 0.67,
        "totalCitations3Years": 45
      },
      "scope": "The Journal of Financial Management, Markets and Institutions is an editorial enterprise launched in 2011 by ADEIMF, the Italian Association of Scholars of Economics and Management of Financial Institutions and Markets. The Journal publishes two issues per year, one issue in July and one issue in December. The aim of the Journal is to publish high quality, original and rigorous research papers with a strong emphasis on the managerial perspectives and policy implications to provide insight to the financial industry and supervisory authorities, in addition to academia. The following areas of finance are covered:  Financial Institutions  Financial Markets  Risk Management  Investments  Corporate Finance. A list of JEL classification items that are particularly suitable for the journal contents are:  F3 International Finance  F65 Economic Impacts of Globalization - Finance  G Financial Economics  O16 Economic Development: Financial Markets; Saving and Capital Investment; Corporate Finance and Governance",
      "categories": [
        {
          "name": "Economics, Econometrics and Finance (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2019-2024",
      "rank": 19802
    },
    {
      "id": "11300153732",
      "title": "Nano",
      "issn": [
        "17937094",
        "17932920"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.225,
        "sjrQuartile": "Q3",
        "hIndex": 38,
        "totalDocs2024": 192,
        "totalDocs3Years": 419,
        "citationsPerDoc": 1.07,
        "totalCitations3Years": 438
      },
      "scope": "NANO is an international peer-reviewed monthly journal for nanoscience and nanotechnology that presents forefront fundamental research and new emerging topics. It features timely scientific reports of new results and technical breakthroughs and also contains interesting review articles about recent hot issues. NANO provides an ideal forum for presenting original reports of theoretical and experimental nanoscience and nanotechnology research. Research areas of interest include: nanomaterials including nano-related biomaterials, new phenomena and newly developed characterization tools, fabrication methods including by self-assembly, device applications, and numerical simulation, modeling, and theory. However, in light of the current stage development of nanoscience, manuscripts on numerical simulation, modeling, and/or theory only without experimental evidences are considered as not pertinent to the scope of NANO.",
      "categories": [
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q4"
        },
        {
          "name": "Nanoscience and Nanotechnology",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 19806
    },
    {
      "id": "15489",
      "title": "International Journal of Nanoscience",
      "issn": [
        "17935350",
        "0219581X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.221,
        "sjrQuartile": "Q3",
        "hIndex": 34,
        "totalDocs2024": 71,
        "totalDocs3Years": 176,
        "citationsPerDoc": 1.63,
        "totalCitations3Years": 236
      },
      "scope": "This inter-disciplinary, internationally-reviewed research journal covers all aspects of nanometer scale science and technology. Articles in any contemporary topical areas are sought, from basic science of nanoscale physics and chemistry to applications in nanodevices, quantum engineering and quantum computing. IJN will include articles in the following research areas (and other related areas): Properties Effected by Nanoscale Dimensions Atomic Manipulation, Coupling of Properties at the Nanoscale Controlled Synthesis, Fabrication and Processing at the Nanoscale Nanoscale Precursors and Assembly, Nanostructure Arrays, Fullerenes, Carbon Nanotubes and Organic Nanostructures Quantum Dots, Quantum Wires, Quantum Wells, Superlattices Nanoelectronics, Single Electron Electronics and Devices, Molecular Electronics, Quantum Computing Nanomechanics, Nanobiological Function and Life Sciences Nanoscale Instrumentation and Characterization Nano-optics, Photonic Crystals with Nanoscale Structural Fidelity.",
      "categories": [
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Bioengineering",
          "quartile": "Q4"
        },
        {
          "name": "Biotechnology",
          "quartile": "Q4"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q4"
        },
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Nanoscience and Nanotechnology",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Biochemistry, Genetics and Molecular Biology",
        "Chemical Engineering",
        "Computer Science",
        "Engineering",
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2004-2025",
      "rank": 20010
    },
    {
      "id": "4700152704",
      "title": "International Journal of Quantum Information",
      "issn": [
        "02197499",
        "17936918"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.22,
        "sjrQuartile": "Q3",
        "hIndex": 46,
        "totalDocs2024": 77,
        "totalDocs3Years": 127,
        "citationsPerDoc": 0.8,
        "totalCitations3Years": 105
      },
      "scope": "The International Journal of Quantum Information (IJQI) provides a forum for the interdisciplinary field of Quantum Information Science. In particular, we welcome contributions in these areas of experimental and theoretical research: Quantum Cryptography Quantum Computation Quantum Communication Fundamentals of Quantum Mechanics Authors are welcome to submit quality research and review papers as well as short correspondences in both theoretical and experimental areas. Submitted articles will be refereed prior to acceptance for publication in the Journal.",
      "categories": [
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2005-2025",
      "rank": 20062
    },
    {
      "id": "12753",
      "title": "International Game Theory Review",
      "issn": [
        "02191989",
        "17936675"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.218,
        "sjrQuartile": "Q3",
        "hIndex": 27,
        "totalDocs2024": 37,
        "totalDocs3Years": 79,
        "citationsPerDoc": 0.5,
        "totalCitations3Years": 54
      },
      "scope": "Rapid developments in technology, communication, industrial organization, economic integration, political reforms and international trade have made it increasingly imperative to recognize the causes and effects of strategic interdependencies and interactions. A strategic approach to decision-making is crucial in areas such as trade negotiations, foreign and domestic investments, capital accumulation, pollution control, market integration, regional cooperation, development and implementation of new technology, arms control, international resource extraction, network sharing, and competitive marketing.",
      "categories": [
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q3"
        },
        {
          "name": "Business and International Management",
          "quartile": "Q4"
        },
        {
          "name": "Statistics, Probability and Uncertainty",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Computer Science",
        "Decision Sciences"
      ],
      "country": "Singapore",
      "coverage": "2003-2025",
      "rank": 20171
    },
    {
      "id": "17700155820",
      "title": "WSEAS Transactions on Systems and Control",
      "issn": [
        "22242856",
        "19918763"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.215,
        "sjrQuartile": "Q4",
        "hIndex": 22,
        "totalDocs2024": 52,
        "totalDocs3Years": 203,
        "citationsPerDoc": 0.82,
        "totalCitations3Years": 180
      },
      "scope": "",
      "categories": [
        {
          "name": "Artificial Intelligence",
          "quartile": "Q4"
        },
        {
          "name": "Control and Optimization",
          "quartile": "Q4"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Mathematics"
      ],
      "country": "Greece",
      "coverage": "2008-2025",
      "rank": 20353
    },
    {
      "id": "19270",
      "title": "International Journal of Software Engineering and Knowledge Engineering",
      "issn": [
        "17936403",
        "02181940"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.206,
        "sjrQuartile": "Q3",
        "hIndex": 43,
        "totalDocs2024": 78,
        "totalDocs3Years": 220,
        "citationsPerDoc": 0.99,
        "totalCitations3Years": 208
      },
      "scope": "The International Journal of Software Engineering and Knowledge Engineering is intended to serve as a forum for researchers, practitioners, and developers to exchange ideas and results for the advancement of software engineering and knowledge engineering. Three types of papers will be published: Research papers reporting original research results Technology trend surveys reviewing an area of research in software engineering and knowledge engineering Survey articles surveying a broad area in software engineering and knowledge engineering In addition, tool reviews (no more than three manuscript pages) and book reviews (no more than two manuscript pages) are also welcome. A central theme of this journal is the interplay between software engineering and knowledge engineering: how knowledge engineering methods can be applied to software engineering, and vice versa. The journal publishes papers in the areas of software engineering methods and practices, object-oriented systems, rapid prototyping, software reuse, cleanroom software engineering, stepwise refinement/enhancement, formal methods of specification, ambiguity in software development, impact of CASE on software development life cycle, knowledge engineering methods and practices, logic programming, expert systems, knowledge-based systems, distributed knowledge-based systems, deductive database systems, knowledge representations, knowledge-based systems in language translation & processing, software and knowledge-ware maintenance, reverse engineering in software design, and applications in various domains of interest.",
      "categories": [
        {
          "name": "Computer Graphics and Computer-Aided Design",
          "quartile": "Q3"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q4"
        },
        {
          "name": "Computer Networks and Communications",
          "quartile": "Q4"
        },
        {
          "name": "Software",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "1996-2025",
      "rank": 20812
    },
    {
      "id": "17700156004",
      "title": "WSEAS Transactions on Fluid Mechanics",
      "issn": [
        "2224347X",
        "17905087"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.205,
        "sjrQuartile": "Q3",
        "hIndex": 15,
        "totalDocs2024": 30,
        "totalDocs3Years": 72,
        "citationsPerDoc": 1.14,
        "totalCitations3Years": 71
      },
      "scope": "",
      "categories": [
        {
          "name": "Computational Mechanics",
          "quartile": "Q3"
        },
        {
          "name": "Fluid Flow and Transfer Processes",
          "quartile": "Q4"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q4"
        },
        {
          "name": "Ocean Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Chemical Engineering",
        "Engineering",
        "Mathematics",
        "Physics and Astronomy"
      ],
      "country": "Greece",
      "coverage": "2009-2015, 2017-2025",
      "rank": 20863
    },
    {
      "id": "144808",
      "title": "WSEAS Transactions on Information Science and Applications",
      "issn": [
        "17900832",
        "22243402"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.197,
        "sjrQuartile": "Q4",
        "hIndex": 22,
        "totalDocs2024": 52,
        "totalDocs3Years": 101,
        "citationsPerDoc": 0.98,
        "totalCitations3Years": 90
      },
      "scope": "",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Information Systems",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Greece",
      "coverage": "2005-2014, 2019, 2021-2025",
      "rank": 21388
    },
    {
      "id": "21100889430",
      "title": "China Quarterly of International Strategic Studies",
      "issn": [
        "23777400",
        "23777419"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.196,
        "sjrQuartile": "Q3",
        "hIndex": 14,
        "totalDocs2024": 15,
        "totalDocs3Years": 58,
        "citationsPerDoc": 0.36,
        "totalCitations3Years": 32
      },
      "scope": "China Quarterly of International Strategic Studies (CQISS), the flagship journal of Shanghai Institutes for International Studies (SIIS) (http://en.siis.org.cn/), focuses on, though is not confined to, strategic issues related to China's role in global affairs, highlighting the Chinese perspective on strategic issues with policy concerns. An international editorial board and the double-blind review process ensure the incisive and impartial analysis of its papers. CQISS offers readers a unique perspective on how a rising China views various global strategic affairs with concrete policy relevance, especially China's role and responsibilities in, and contributions to, the international system. It sheds light on regional and world affairs related to China, and elaborates on China's strategic visions, and illustrates its policy concerns. It covers topics on China's International Strategy, China's Foreign Policy, World Economy, Global Governance, International Security, Regional Politics and International System Transformation.",
      "categories": [
        {
          "name": "Political Science and International Relations",
          "quartile": "Q3"
        },
        {
          "name": "Sociology and Political Science",
          "quartile": "Q3"
        }
      ],
      "areas": [
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2015-2025",
      "rank": 21414
    },
    {
      "id": "10300153374",
      "title": "WSEAS Transactions on Environment and Development",
      "issn": [
        "17905079",
        "22243496"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.196,
        "sjrQuartile": "Q3",
        "hIndex": 27,
        "totalDocs2024": 93,
        "totalDocs3Years": 382,
        "citationsPerDoc": 0.71,
        "totalCitations3Years": 322
      },
      "scope": "",
      "categories": [
        {
          "name": "Geography, Planning and Development",
          "quartile": "Q3"
        },
        {
          "name": "Development",
          "quartile": "Q4"
        },
        {
          "name": "Ecological Modeling",
          "quartile": "Q4"
        },
        {
          "name": "Energy (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Environmental Chemistry",
          "quartile": "Q4"
        },
        {
          "name": "Environmental Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Environmental Science (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Management, Monitoring, Policy and Law",
          "quartile": "Q4"
        },
        {
          "name": "Waste Management and Disposal",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Energy",
        "Environmental Science",
        "Social Sciences"
      ],
      "country": "Greece",
      "coverage": "2007-2015, 2017-2025",
      "rank": 21433
    },
    {
      "id": "21100825467",
      "title": "SPIN",
      "issn": [
        "20103247",
        "20103255"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.193,
        "sjrQuartile": "Q4",
        "hIndex": 25,
        "totalDocs2024": 49,
        "totalDocs3Years": 121,
        "citationsPerDoc": 0.87,
        "totalCitations3Years": 118
      },
      "scope": "Spin electronics encompasses a multidisciplinary research effort involving magnetism, semiconductor electronics, materials science, chemistry and biology. SPIN aims to provide a forum for the presentation of research and review articles of interest to all researchers in the field. The scope of the journal includes (but is not necessarily limited to) the following topics: *Materials: -Metals -Heusler compounds -Complex oxides: antiferromagnetic, ferromagnetic -Dilute magnetic semiconductors -Dilute magnetic oxides -High performance and emerging magnetic materials *Semiconductor electronics *Nanodevices: -Fabrication -Characterization *Spin injection *Spin transport *Spin transfer torque *Spin torque oscillators *Electrical control of magnetic properties *Organic spintronics *Optical phenomena and optoelectronic spin manipulation *Applications and devices: -Novel memories and logic devices -Lab-on-a-chip -Others *Fundamental and interdisciplinary studies: -Spin in low dimensional system -Spin in medical sciences -Spin in other fields -Computational materials discovery",
      "categories": [
        {
          "name": "Atomic and Molecular Physics, and Optics",
          "quartile": "Q4"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2011-2025",
      "rank": 21648
    },
    {
      "id": "19700190300",
      "title": "WSEAS Transactions on Power Systems",
      "issn": [
        "17905060",
        "2224350X"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.192,
        "sjrQuartile": "Q2",
        "hIndex": 18,
        "totalDocs2024": 41,
        "totalDocs3Years": 127,
        "citationsPerDoc": 0.81,
        "totalCitations3Years": 104
      },
      "scope": "",
      "categories": [
        {
          "name": "Cultural Studies",
          "quartile": "Q2"
        },
        {
          "name": "Anthropology",
          "quartile": "Q3"
        },
        {
          "name": "Industrial and Manufacturing Engineering",
          "quartile": "Q3"
        },
        {
          "name": "Sociology and Political Science",
          "quartile": "Q3"
        },
        {
          "name": "Urban Studies",
          "quartile": "Q3"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Energy (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Energy",
        "Engineering",
        "Social Sciences"
      ],
      "country": "Greece",
      "coverage": "2010-2014, 2018-2025",
      "rank": 21663
    },
    {
      "id": "17700156006",
      "title": "WSEAS Transactions on Business and Economics",
      "issn": [
        "11099526",
        "22242899"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.192,
        "sjrQuartile": "Q4",
        "hIndex": 24,
        "totalDocs2024": 189,
        "totalDocs3Years": 553,
        "citationsPerDoc": 0.95,
        "totalCitations3Years": 541
      },
      "scope": "",
      "categories": [
        {
          "name": "Business and International Management",
          "quartile": "Q4"
        },
        {
          "name": "Economics and Econometrics",
          "quartile": "Q4"
        },
        {
          "name": "Finance",
          "quartile": "Q4"
        },
        {
          "name": "Marketing",
          "quartile": "Q4"
        },
        {
          "name": "Organizational Behavior and Human Resource Management",
          "quartile": "Q4"
        },
        {
          "name": "Strategy and Management",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Business, Management and Accounting",
        "Economics, Econometrics and Finance"
      ],
      "country": "Greece",
      "coverage": "2009-2015, 2017-2025",
      "rank": 21704
    },
    {
      "id": "11300153744",
      "title": "Journal of Mechanics in Medicine and Biology",
      "issn": [
        "17936810",
        "02195194"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.187,
        "sjrQuartile": "Q4",
        "hIndex": 42,
        "totalDocs2024": 171,
        "totalDocs3Years": 462,
        "citationsPerDoc": 0.71,
        "totalCitations3Years": 335
      },
      "scope": "This journal has as its objective the publication and dissemination of original research (even for \"revolutionary concepts that contrast with existing theories\" & \"hypothesis\") in all fields of engineering-mechanics that includes mechanisms, processes, bio-sensors and bio-devices in medicine, biology and healthcare. The journal publishes original papers in English which contribute to an understanding of biomedical engineering and science at a nano- to macro-scale or an improvement of the methods and techniques of medical, biological and clinical treatment by the application of advanced high technology. Journal's Research Scopes/Topics Covered (but not limited to): Artificial Organs, Biomechanics of Organs. Biofluid Mechanics, Biorheology, Blood Flow Measurement Techniques, Microcirculation, Hemodynamics. Bioheat Transfer and Mass Transport, Nano Heat Transfer. Biomaterials. Biomechanics & Modeling of Cell and Molecular. Biomedical Instrumentation and BioSensors that implicate 'human mechanics' in details. Biomedical Signal Processing Techniques that implicate 'human mechanics' in details. Bio-Microelectromechanical Systems, Microfluidics. Bio-Nanotechnology and Clinical Application. Bird and Insect Aerodynamics. Cardiovascular/Cardiac mechanics. Cardiovascular Systems Physiology/Engineering. Cellular and Tissue Mechanics/Engineering. Computational Biomechanics/Physiological Modelling, Systems Physiology. Clinical Biomechanics. Hearing Mechanics. Human Movement and Animal Locomotion. Implant Design and Mechanics. Mathematical modeling. Mechanobiology of Diseases. Mechanics of Medical Robotics. Muscle/Neuromuscular/Musculoskeletal Mechanics and Engineering. Neural- & Neuro-Behavioral Engineering. Orthopedic Biomechanics. Reproductive and Urogynecological Mechanics. Respiratory System Engineering...",
      "categories": [
        {
          "name": "Biomedical Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 22041
    },
    {
      "id": "92049",
      "title": "Biomedical Engineering - Applications, Basis and Communications",
      "issn": [
        "10162372",
        "17937132"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.179,
        "sjrQuartile": "Q4",
        "hIndex": 27,
        "totalDocs2024": 62,
        "totalDocs3Years": 145,
        "citationsPerDoc": 0.66,
        "totalCitations3Years": 103
      },
      "scope": "Biomedical Engineering: Applications, Basis and Communications is an international, interdisciplinary journal aiming at publishing up-to-date contributions on original clinical and basic research in the biomedical engineering. Research of biomedical engineering has grown tremendously in the past few decades. Meanwhile, several outstanding journals in the field have emerged, with different emphases and objectives. We hope this journal will serve as a new forum for both scientists and clinicians to share their ideas and the results of their studies. Biomedical Engineering: Applications, Basis and Communications explores all facets of biomedical engineering, with emphasis on both the clinical and scientific aspects of the study. It covers the fields of bioelectronics, biomaterials, biomechanics, bioinformatics, nano-biological sciences and clinical engineering. The journal fulfils this aim by publishing regular research / clinical articles, short communications, technical notes and review papers. Papers from both basic research and clinical investigations will be considered.",
      "categories": [
        {
          "name": "Bioengineering",
          "quartile": "Q4"
        },
        {
          "name": "Biomedical Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Biophysics",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Biochemistry, Genetics and Molecular Biology",
        "Chemical Engineering",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "1992-2025",
      "rank": 22557
    },
    {
      "id": "144813",
      "title": "WSEAS Transactions on Systems",
      "issn": [
        "11092777"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.179,
        "sjrQuartile": "Q4",
        "hIndex": 29,
        "totalDocs2024": 50,
        "totalDocs3Years": 158,
        "citationsPerDoc": 0.87,
        "totalCitations3Years": 124
      },
      "scope": "",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering"
      ],
      "country": "Greece",
      "coverage": "2005-2014, 2019, 2021-2025",
      "rank": 22592
    },
    {
      "id": "21100872796",
      "title": "International Journal of Semantic Computing",
      "issn": [
        "17937108",
        "1793351X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.173,
        "sjrQuartile": "Q2",
        "hIndex": 22,
        "totalDocs2024": 36,
        "totalDocs3Years": 92,
        "citationsPerDoc": 0.79,
        "totalCitations3Years": 66
      },
      "scope": "Semantic Computing (SC) is defined as \"Computing with (machine processable) Descriptions of Content and Intentions.\" It brings together those disciplines concerned with connecting the (often vaguely formulated) intentions of humans with computational content that includes, but is not limited to, structured and semi-structured data, multimedia data, text, programs, services and, even, network behavior. International Journal of Semantic Computing (IJSC) addresses the computing technologies (e.g., artificial intelligence, natural language, software engineering, data and knowledge engineering, computer systems, signal processing, etc.), and their interactions, that may be used to extract or process computational content and descriptions. While some areas of Semantic Computing have appeared as isolated pieces in journals dedicated to individual disciplines, IJSC is a journal that glues these pieces together into an integrated theme with synergetic interactions. It addresses not only the analysis and transformation of signals (e.g., pixels, words) into useful information, but also how such information can be synthesized and accessed. IJSC publishes regular papers, review papers, case studies, tutorials, communications, book reviews, conference reports, industry trends, and product reviews.",
      "categories": [
        {
          "name": "Linguistics and Language",
          "quartile": "Q2"
        },
        {
          "name": "Artificial Intelligence",
          "quartile": "Q4"
        },
        {
          "name": "Computer Networks and Communications",
          "quartile": "Q4"
        },
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Information Systems",
          "quartile": "Q4"
        },
        {
          "name": "Software",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2007-2024",
      "rank": 22887
    },
    {
      "id": "26141",
      "title": "Parallel Processing Letters",
      "issn": [
        "1793642X",
        "01296264"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.173,
        "sjrQuartile": "Q4",
        "hIndex": 34,
        "totalDocs2024": 18,
        "totalDocs3Years": 61,
        "citationsPerDoc": 0.56,
        "totalCitations3Years": 34
      },
      "scope": "Parallel Processing Letters (PPL) aims to rapidly disseminate results on a worldwide basis in the field of parallel processing in the form of short papers. It fills the need for an information vehicle which can convey recent achievements and further the exchange of scientific information in the field. This journal has a wide scope and topics covered include: design and analysis of parallel and distributed algorithms theory of parallel computation parallel programming languages parallel programming environments parallel architectures and VLSI circuits unconventional computational problems (e.g., time-varying variables, interacting variables, time-varying complexity) unconventional computational paradigms (e.g., biomolecular computing, chemical computing, quantum computing) computing in nature (e.g., decision making in plant and animal groups and populations, bacterial communication, intra-cellular information processing) nature-inspired algorithms (e.g., genetic algorithms, neural networks, swarm intelligence) Letters of high scientific quality containing original results will be published. Experimental results are also welcome for publication if they contain an analysis corresponding to an abstract model of computation.",
      "categories": [
        {
          "name": "Hardware and Architecture",
          "quartile": "Q4"
        },
        {
          "name": "Software",
          "quartile": "Q4"
        },
        {
          "name": "Theoretical Computer Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1994-2025",
      "rank": 22943
    },
    {
      "id": "21100902918",
      "title": "Series on Analysis, Applications and Computation",
      "issn": [
        "17934702"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.166,
        "sjrQuartile": "Q4",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 11,
        "citationsPerDoc": 0.2,
        "totalCitations3Years": 2
      },
      "scope": "This is a high-quality series for monographs covering a broad spectrum of topics from graduate level courses to specialized research in analysis, its applications and computation.",
      "categories": [
        {
          "name": "Analysis",
          "quartile": "Q4"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2018, 2021, 2023",
      "rank": 23404
    },
    {
      "id": "16164",
      "title": "Review of Pacific Basin Financial Markets and Policies",
      "issn": [
        "17936705",
        "02190915"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.165,
        "sjrQuartile": "Q4",
        "hIndex": 22,
        "totalDocs2024": 32,
        "totalDocs3Years": 96,
        "citationsPerDoc": 0.56,
        "totalCitations3Years": 52
      },
      "scope": "Review of Pacific Basin Financial Markets and Policies deals with quantitative and qualitative research involving financial markets and policies of the Pacific Basin area. The papers published present useful theoretical and methodological results with the support of interesting empirical applications. Purely theoretical and methodological research with the potential for important applications is also published. This journal concentrates on global interdisciplinary research in finance, economics, and accounting. It particularly emphasizes interesting applications of financial econometrics, mathematics, statistics, and technology to the issue of financial market and policy among Pacific rim countries. The major topics include: Business, economic and financial relations among the Pacific rim countries. Financial markets and industries (Banking and Insurance of the United States and other Pacific rim countries). Options and futures markets of the United States and other Pacific rim countries. International accounting issues related to U.S. companies investing in Pacific rim countries. Marketing, management and business policy of the Pacific rim countries. Global monetary and foreign exchange policy, and Other high-quality interdisciplinary research in global accounting, business, economics and finance.",
      "categories": [
        {
          "name": "Economics and Econometrics",
          "quartile": "Q4"
        },
        {
          "name": "Finance",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2003-2025",
      "rank": 23456
    },
    {
      "id": "144806",
      "title": "WSEAS Transactions on Circuits and Systems",
      "issn": [
        "11092734",
        "2224266X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.16,
        "sjrQuartile": "Q4",
        "hIndex": 19,
        "totalDocs2024": 34,
        "totalDocs3Years": 91,
        "citationsPerDoc": 0.72,
        "totalCitations3Years": 58
      },
      "scope": "",
      "categories": [
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering"
      ],
      "country": "Greece",
      "coverage": "2005-2014, 2019, 2021-2024",
      "rank": 23797
    },
    {
      "id": "144807",
      "title": "WSEAS Transactions on Electronics",
      "issn": [
        "24151513",
        "11099445"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.152,
        "sjrQuartile": "Q4",
        "hIndex": 13,
        "totalDocs2024": 21,
        "totalDocs3Years": 60,
        "citationsPerDoc": 0.63,
        "totalCitations3Years": 35
      },
      "scope": "",
      "categories": [
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering"
      ],
      "country": "Greece",
      "coverage": "2005-2009, 2019-2025",
      "rank": 24425
    },
    {
      "id": "21101062041",
      "title": "Physics Educator",
      "issn": [
        "26613409",
        "26613395"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.148,
        "sjrQuartile": "Q4",
        "hIndex": 5,
        "totalDocs2024": 22,
        "totalDocs3Years": 74,
        "citationsPerDoc": 0.29,
        "totalCitations3Years": 17
      },
      "scope": "The Physics Educator is an international peer-reviewed journal published quarterly by World Scientific and the Institute of Physics Singapore. The focus of the journal is the teaching and learning of physics and related topics at the secondary school, high school, junior college and the introductory undergraduate level. Articles related to the history and philosophy of physics as well as the design of the physics curriculum may also be submitted. The aim of the journal is to enhance the teaching of physics in lecture rooms, classrooms and teaching laboratories through new approaches, insights and demonstrations, and to provide a lively forum for discussions on educational and curriculum developments, strategies for teaching and classroom management, pedagogy, equipment and other topics relevant to the teaching of physics. Book reviews relevant to the journal's aims may also be submitted.",
      "categories": [
        {
          "name": "Education",
          "quartile": "Q4"
        },
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Physics and Astronomy (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Mathematics",
        "Physics and Astronomy",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2019-2025",
      "rank": 24730
    },
    {
      "id": "17700156003",
      "title": "WSEAS Transactions on Computer Research",
      "issn": [
        "19918755"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.14,
        "sjrQuartile": "Q4",
        "hIndex": 9,
        "totalDocs2024": 52,
        "totalDocs3Years": 79,
        "citationsPerDoc": 0.6,
        "totalCitations3Years": 40
      },
      "scope": "",
      "categories": [
        {
          "name": "Computer Science Applications",
          "quartile": "Q4"
        },
        {
          "name": "Computer Science (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Engineering (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering"
      ],
      "country": "Greece",
      "coverage": "2008, 2019-2025",
      "rank": 25365
    },
    {
      "id": "28477",
      "title": "International Journal of Computational Geometry and Applications",
      "issn": [
        "17936357",
        "02181959"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.138,
        "sjrQuartile": "Q4",
        "hIndex": 41,
        "totalDocs2024": 4,
        "totalDocs3Years": 27,
        "citationsPerDoc": 0.35,
        "totalCitations3Years": 12
      },
      "scope": "The International Journal of Computational Geometry & Applications (IJCGA) is a quarterly journal devoted to the field of computational geometry within the framework of design and analysis of algorithms. Emphasis is placed on the computational aspects of geometric problems that arise in various fields of science and engineering including computer-aided geometry design (CAGD), computer graphics, constructive solid geometry (CSG), operations research, pattern recognition, robotics, solid modelling, VLSI routing/layout, and others. Research contributions ranging from theoretical results in algorithm design  sequential or parallel, probabilistic or randomized algorithms  to applications in the above-mentioned areas are welcome. Research findings or experiences in the implementations of geometric algorithms, such as numerical stability, and papers with a geometric flavour related to algorithms or the application areas of computational geometry are also welcome.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Computational Theory and Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Geometry and Topology",
          "quartile": "Q4"
        },
        {
          "name": "Theoretical Computer Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "1996-2024",
      "rank": 25506
    },
    {
      "id": "19600157349",
      "title": "WSEAS Transactions on Biology and Biomedicine",
      "issn": [
        "22242902",
        "11099518"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.136,
        "sjrQuartile": "Q4",
        "hIndex": 12,
        "totalDocs2024": 39,
        "totalDocs3Years": 33,
        "citationsPerDoc": 0.82,
        "totalCitations3Years": 27
      },
      "scope": "",
      "categories": [
        {
          "name": "Biochemistry, Genetics and Molecular Biology (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Biomedical Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Biotechnology",
          "quartile": "Q4"
        },
        {
          "name": "Molecular Biology",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Biochemistry, Genetics and Molecular Biology",
        "Engineering"
      ],
      "country": "Greece",
      "coverage": "2009-2015, 2023-2025",
      "rank": 25679
    },
    {
      "id": "19900192001",
      "title": "Advanced Series on Ocean Engineering",
      "issn": [
        "1793074X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.135,
        "sjrQuartile": "Q4",
        "hIndex": 7,
        "totalDocs2024": 1,
        "totalDocs3Years": 24,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 3
      },
      "scope": "This book series consists of undergraduate and graduate textbooks, research and engineering design reference books and monographs in the field of coastal and ocean engineering. The subject areas of the series include: ocean waves and currents ocean acoustics materials for marine structures offshore and coastal structures coastal morphology coastal oceanography.",
      "categories": [
        {
          "name": "Ocean Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Oceanography",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Earth and Planetary Sciences",
        "Engineering"
      ],
      "country": "Singapore",
      "coverage": "2008-2010, 2014, 2016-2024",
      "rank": 25708
    },
    {
      "id": "21100856758",
      "title": "Series on Contemporary China",
      "issn": [
        "17930847"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.133,
        "sjrQuartile": "Q3",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 17,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 1
      },
      "scope": "This series showcases the most significant and lasting contributions to scholarship in the studies of China's politics, society, and culture  whether for general readers or specialists. Each of the volumes is a quality work by a leading scholar or scholars in the field and may take the form of a research monograph, a multi-author edited volume, a conference proceeding, a textbook, or an annual review, among others. While the focus is on China, the series does not lose sight of the interplay of other regional and global forces and their influence and impact on China.",
      "categories": [
        {
          "name": "Anthropology",
          "quartile": "Q3"
        },
        {
          "name": "Cultural Studies",
          "quartile": "Q3"
        },
        {
          "name": "History",
          "quartile": "Q3"
        },
        {
          "name": "Economics, Econometrics and Finance (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Political Science and International Relations",
          "quartile": "Q4"
        },
        {
          "name": "Sociology and Political Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Arts and Humanities",
        "Economics, Econometrics and Finance",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2017-2021, 2023",
      "rank": 25969
    },
    {
      "id": "21100839216",
      "title": "Catalytic Science Series",
      "issn": [
        "23994495",
        "17931398"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.133,
        "sjrQuartile": "Q4",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 45,
        "citationsPerDoc": 0.03,
        "totalCitations3Years": 4
      },
      "scope": "Catalysis is at the forefront of the chemical industry and is essential to many fields in the chemical sciences. This series explores all aspects of catalysis in authored and edited volumes drawing on expertise from around the globe in a focussed manner. Volumes are accessible by postgraduate students and professionals in academia and industry.",
      "categories": [
        {
          "name": "Catalysis",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Chemical Engineering"
      ],
      "country": "Singapore",
      "coverage": "2017-2019, 2021-2023",
      "rank": 26017
    },
    {
      "id": "21100905630",
      "title": "Series on Chinese Economics Research",
      "issn": [
        "22511644"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.133,
        "sjrQuartile": "Q4",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 21,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 2
      },
      "scope": "This series aims at publishing top-quality research works on Chinese economics and finance. Since the reform in 1978, the Chinese economy has experienced three decades of unprecedented rapid growth and countless volumes have been written to explain the phenomenon. The series offers the best of the research works done by economists who specialized in Chinese economics and finance. The topics covered in this series are diverse, e.g. main drivers of economic growth, growing income disparity, rent-seeking behaviors, financial regulations, financial market, state-owned enterprises, food security, developmental strategy, RMB reform and service industry..",
      "categories": [
        {
          "name": "Economics, Econometrics and Finance (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Political Science and International Relations",
          "quartile": "Q4"
        },
        {
          "name": "Sociology and Political Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2019-2021, 2023",
      "rank": 26102
    },
    {
      "id": "21100823806",
      "title": "Series on Concrete and Applicable Mathematics",
      "issn": [
        "17931142"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.133,
        "sjrQuartile": "Q4",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 3,
        "citationsPerDoc": 0.33,
        "totalCitations3Years": 1
      },
      "scope": "The main purpose of this Series is to publish high quality books and monographs from all subareas of Non-Pure and/or Applicable Mathematics and the many real-life applications, as well as connections to other areas of Mathematical Sciences, as long as they are presented in a Concrete way. A sample list of connected mathematical areas with this book series includes and is not restricted to: Applied Analysis, Applied Functional Analysis, Probability Theory, Stochastic Processes, Approximation Theory, ODE, PDE, Wavelet, Neural Networks, Difference Equations, Summability, Fractals, Special Functions, Splines, Asymptotic Analysis, Fractional Analysis, Inequalities, Moment Theory, Numerical Functional Analysis, Tomography, Asymptotic Expansions, Fourier Analysis, Applied Harmonic Analysis, Integral Equations, Signal Analysis, Numerical Analysis, Optimization, Operations Research, Linear Programming, Fuzziness, Mathematical Finance, Stochastic Analysis, Game Theory, Mathematical Physics aspects, Applied Real and Complex Analysis, Computational Number Theory, Graph Theory, and Combinatorics.",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q4"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Computational Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Discrete Mathematics and Combinatorics",
          "quartile": "Q4"
        },
        {
          "name": "Management Science and Operations Research",
          "quartile": "Q4"
        },
        {
          "name": "Mathematical Physics",
          "quartile": "Q4"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q4"
        },
        {
          "name": "Statistics and Probability",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Decision Sciences",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2017, 2022-2023",
      "rank": 26103
    },
    {
      "id": "21101199244",
      "title": "Topics in Systems Engineering",
      "issn": [
        "28109090",
        "28109104"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.132,
        "sjrQuartile": "Q4",
        "hIndex": 1,
        "totalDocs2024": 0,
        "totalDocs3Years": 4,
        "citationsPerDoc": 0.33,
        "totalCitations3Years": 1
      },
      "scope": "",
      "categories": [
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q4"
        },
        {
          "name": "Control and Systems Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2021-2023",
      "rank": 26217
    },
    {
      "id": "26149",
      "title": "International Journal of High Speed Electronics and Systems",
      "issn": [
        "17936438",
        "01291564"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.125,
        "sjrQuartile": "Q4",
        "hIndex": 28,
        "totalDocs2024": 337,
        "totalDocs3Years": 56,
        "citationsPerDoc": 0.54,
        "totalCitations3Years": 34
      },
      "scope": "Launched in 1990, the International Journal of High Speed Electronics and Systems (IJHSES) has served graduate students and those in R&D, managerial and marketing positions by giving state-of-the-art data, and the latest research trends. Its main charter is to promote engineering education by advancing interdisciplinary science between electronics and systems and to explore high speed technology in photonics and electronics. IJHSES, a quarterly journal, continues to feature a broad coverage of topics relating to high speed or high performance devices, circuits and systems. Papers published will cover: New milestones in research and development New materials, device structures, processing technologies, circuit and system architectures that lead to speed and performance In-depth analyses or critical evaluation of pertinent topics in the field Tutorial, review papers and technical reports.",
      "categories": [
        {
          "name": "Electrical and Electronic Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q4"
        },
        {
          "name": "Hardware and Architecture",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Computer Science",
        "Engineering",
        "Materials Science"
      ],
      "country": "Singapore",
      "coverage": "2002-2009, 2011-2025",
      "rank": 26828
    },
    {
      "id": "21100426011",
      "title": "Nano LIFE",
      "issn": [
        "17939852",
        "17939844"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.125,
        "sjrQuartile": "Q4",
        "hIndex": 4,
        "totalDocs2024": 46,
        "totalDocs3Years": 41,
        "citationsPerDoc": 0.59,
        "totalCitations3Years": 24
      },
      "scope": "The tremendous success in developing new nanomaterial and fostering technological innovation arises from its focus on interdisciplinary research and collaboration between physical and medical scientists. The concept of nanobiomedicine is one of the most important ideas ever generated by the applications of nanoscience to medical fields. Although there have been extensive interdisciplinary activities, major collaborative efforts are needed to jointly address some of the most challenging issues in life and medical sciences. Nano LIFE is a quarterly international journal publishing peer-reviewed research covering all fields in between nano and biomedical sciences. The emphasis of this journal is based on its originality, importance, and interdisciplinary nature between nano and life sciences. Nano LIFE also provides current news and interpretations of critical issues in nanomedicine that caters to scientific communities and the general public. Nano LIFE will effectively facilitate interactions and collaborations between the nano and medical research communities that are more focused on solving key problems based on emerging nanoscience and technologies. This journal is also addressed to researchers in a broad spectrum of materials, chemical, biological and medical sciences, and engineering. In addition, it summarizes the wealth of experimental results in both nanomaterials and biomedicine and introduces new aspects of nanoscience relevant to biological and medical applications. It also demonstrates new trends in the field and cultivates a new research community in both frontier research and higher education. Nano LIFE includes review articles authored by authorities in both nano and biomedical sciences, and original research results that will address the most critical challenges in nanoscience and biomedicine.",
      "categories": [
        {
          "name": "Bioengineering",
          "quartile": "Q4"
        },
        {
          "name": "Biomedical Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Medicine (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Pharmaceutical Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Chemical Engineering",
        "Engineering",
        "Medicine",
        "Pharmacology, Toxicology and Pharmaceutics"
      ],
      "country": "Singapore",
      "coverage": "2014, 2022-2025",
      "rank": 26845
    },
    {
      "id": "21101064805",
      "title": "Advances in Planetary Science",
      "issn": [
        "25298062",
        "25298054"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.123,
        "sjrQuartile": "Q4",
        "hIndex": 2,
        "totalDocs2024": 0,
        "totalDocs3Years": 30,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 2
      },
      "scope": "The series on Advances in Planetary Science aims to provide readers with overviews on many exciting developments in planetary research and related studies of exoplanets and their habitability. Besides a running account of the most up-to-date research results, coverage will also be given to descriptions of milestones in space exploration in the recent past by leading experts in the field.",
      "categories": [
        {
          "name": "Astronomy and Astrophysics",
          "quartile": "Q4"
        },
        {
          "name": "Space and Planetary Science",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Earth and Planetary Sciences",
        "Physics and Astronomy"
      ],
      "country": "Singapore",
      "coverage": "2019, 2021-2022",
      "rank": 27030
    },
    {
      "id": "12234",
      "title": "Journal of Musculoskeletal Research",
      "issn": [
        "17936497",
        "02189577"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.123,
        "sjrQuartile": "Q4",
        "hIndex": 19,
        "totalDocs2024": 46,
        "totalDocs3Years": 113,
        "citationsPerDoc": 0.15,
        "totalCitations3Years": 21
      },
      "scope": "Journal of Musculoskeletal Research is an international, interdisciplinary journal aimed at publishing up-to-date contributions on clinical and basic research in the musculoskeletal system. Research into the musculoskeletal system has grown tremendously in the past few decades. Meanwhile, several outstanding journals in the field have appeared, but with a different emphasis and objective. With the growing number of studies in the field, the review process has become increasingly longer. We hope this journal will serve as a new forum for both scientists and clinicians to share their ideas and the results of their studies.",
      "categories": [
        {
          "name": "Orthopedics and Sports Medicine",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Medicine"
      ],
      "country": "Singapore",
      "coverage": "1997-2006, 2008-2025",
      "rank": 27060
    },
    {
      "id": "17700156005",
      "title": "WSEAS Transactions on Heat and Mass Transfer",
      "issn": [
        "17905044",
        "22243461"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.119,
        "sjrQuartile": "Q4",
        "hIndex": 11,
        "totalDocs2024": 13,
        "totalDocs3Years": 52,
        "citationsPerDoc": 0.15,
        "totalCitations3Years": 8
      },
      "scope": "",
      "categories": [
        {
          "name": "Condensed Matter Physics",
          "quartile": "Q4"
        },
        {
          "name": "Energy (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Industrial and Manufacturing Engineering",
          "quartile": "Q4"
        },
        {
          "name": "Mechanical Engineering",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Energy",
        "Engineering",
        "Physics and Astronomy"
      ],
      "country": "Greece",
      "coverage": "2009-2015, 2022-2025",
      "rank": 27446
    },
    {
      "id": "12100157151",
      "title": "Asian Case Research Journal",
      "issn": [
        "02189275",
        "17936772"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.116,
        "sjrQuartile": "Q4",
        "hIndex": 5,
        "totalDocs2024": 14,
        "totalDocs3Years": 67,
        "citationsPerDoc": 0.08,
        "totalCitations3Years": 9
      },
      "scope": "The Asian Case Research Journal's (ACRJ) principal objective is to publish high-quality teaching cases on Asian companies and companies operating in Asia. We accept submissions from various areas including strategic management, marketing, organizational behavior/human resources, entrepreneurship, operations management, management information systems (MIS), economics, finance and accounting, and other relevant business disciplines. Priority is given to recent cases highlighting Asia-related business challenges with broad appeal and relevance to instructors and students worldwide. The date of occurrence of the case event should be recent C no more than 3 years old. For cases that are older than 3 years, authors should provide a valid justification for this exception upon submission. All submissions should be based upon original research and will be selected through a double blind review process.",
      "categories": [
        {
          "name": "Business, Management and Accounting (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Business, Management and Accounting"
      ],
      "country": "Singapore",
      "coverage": "2008-2025",
      "rank": 27739
    },
    {
      "id": "21100823807",
      "title": "Series on Number Theory and Its Applications",
      "issn": [
        "17933161"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.116,
        "sjrQuartile": "Q4",
        "hIndex": 1,
        "totalDocs2024": 0,
        "totalDocs3Years": 9,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 0
      },
      "scope": "",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q4"
        },
        {
          "name": "Control and Optimization",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2016-2019, 2021, 2023",
      "rank": 27809
    },
    {
      "id": "21100892595",
      "title": "World Scientific Series in Finance",
      "issn": [
        "20101082"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.116,
        "sjrQuartile": "Q4",
        "hIndex": 3,
        "totalDocs2024": 20,
        "totalDocs3Years": 47,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 9
      },
      "scope": "This series of books is intended to provide up to date presentations of key topics in finance through single and multiple authored monographs, collected works of noted scholars, surveys of defined subfields of finance, research reference volumes written or edited, textbooks and other publications. The following are topics that might appear in the series: asset pricing, investment management, private value markets, speculative trading, private equities, hedge funds and absolute return investing, arbitrage, stochastic dominance, risk measures, utility and risk aversion theory and practice, incomplete markets, insurance, financial institutions, capital markets, market microstructure, the VIX volatility index, corporate restructuring, financial contracting, game theory in economics and in corporate finance and other areas, empirical aspects of corporate finance and governance, short term financial management, law in finance, financial regulation, analysis of financial market crises, stock and other market imperfections, international finance, behavioral finance, experimental finance, bond pricing, bond portfolio management, swaps, currency forecasting, long-short equity modeling, derivative pricing, exotic derivatives, bond and interest rate derivatives, financial volatility, risk management, credit risk, credit risk derivatives, bond rating, futures markets, security analysis accounting, emerging markets, the BRICs, the Chinese economy and stock markets.",
      "categories": [
        {
          "name": "Finance",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance"
      ],
      "country": "Singapore",
      "coverage": "2018-2024",
      "rank": 27824
    },
    {
      "id": "21101128525",
      "title": "International Journal of Mathematics for Industry",
      "issn": [
        "26613352",
        "26613344"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": 0.114,
        "sjrQuartile": "Q4",
        "hIndex": 5,
        "totalDocs2024": 29,
        "totalDocs3Years": 19,
        "citationsPerDoc": 0.27,
        "totalCitations3Years": 4
      },
      "scope": "The International Journal of Mathematics for Industry is an international, open-access journal, dedicated to enhancing the interaction between mathematics and industrial applications as a two-way process. It publishes original research articles from authors worldwide that illustrate how, through the utilization of mathematical results, questions about industrial problems including various scientific questions potentially connected to industrial problems are answered to yield new insight for both industry and mathematics. The journal also publishes survey articles that address specific mathematics-for-industry topics from an original perspective. Mathematics for industry is a recent research field in mathematics that aims to create new opportunities for industry, the development of new technologies and science, and the identification of new focal points for the evolution of mathematics. This new field is being developed through the integration and unification of pure and applied mathematics to highlight and reinforce their fundamental importance for the future solution of current industrial problems and the development of new industrial technologies. Consequently, the scope of this journal includes theoretical, numerical, and experimental studies in all fields of mathematics and the mathematical sciences, provided that their core and flavor retain the spirit of a mathematics-for-industry endeavor. Moreover, the journal welcomes articles that have the potential to identify and foster future opportunities for the development of mathematics.",
      "categories": [
        {
          "name": "Applied Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Computational Mechanics",
          "quartile": "Q4"
        },
        {
          "name": "Modeling and Simulation",
          "quartile": "Q4"
        },
        {
          "name": "Numerical Analysis",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Engineering",
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2019-2025",
      "rank": 28002
    },
    {
      "id": "21100842805",
      "title": "Materials and Energy",
      "issn": [
        "23356596",
        "2335660X"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.111,
        "sjrQuartile": "Q4",
        "hIndex": 4,
        "totalDocs2024": 0,
        "totalDocs3Years": 129,
        "citationsPerDoc": 0.06,
        "totalCitations3Years": 10
      },
      "scope": "This collection focuses onmaterials-based solutions to the energy problem through a series of case studies illustrating advances in energy-related materials research. The research studies employ creativity, discovery, rationale design and improvement of the physical and chemical properties of materials leading to new paradigms for competitive energy-production. The challenge tests both our fundamental understanding of material and our ability to manipulate and reconfigure materials into practical and useful configurations. Invariably these materials issues arise at the nano-scale! For electricity generation, dramatic breakthroughs are taking place in the fields of solar cells and fuel cells, the former giving rise to entirely new classes of semiconductors; the latter testing our knowledge of the behavior of ionic transport through a solid medium. Inenergy-storage exciting developments are emerging from the fields of rechargeable batteries and hydrogen storage. On the horizon are breakthroughs in thermoelectrics, high temperature superconductivity, and power generation. Still to emerge are the harnessing of systems that mimic nature, ranging from fusion, as in the sun, to photosynthesis, nature's photovoltaic. All of these approaches represent a body of materialsbased research employing the most sophisticated experimental and theoretical techniques dedicated to a commongoal. The aim of this series is to capture these advances, through a collection of volumes authored by leading physicists, chemists, biologists and engineers that represent the forefront of energy-related materials research.",
      "categories": [
        {
          "name": "Biomaterials",
          "quartile": "Q4"
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": "Q4"
        },
        {
          "name": "Energy Engineering and Power Technology",
          "quartile": "Q4"
        },
        {
          "name": "Fuel Technology",
          "quartile": "Q4"
        },
        {
          "name": "Materials Chemistry",
          "quartile": "Q4"
        },
        {
          "name": "Materials Science (miscellaneous)",
          "quartile": "Q4"
        },
        {
          "name": "Renewable Energy, Sustainability and the Environment",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Energy",
        "Materials Science"
      ],
      "country": "Singapore",
      "coverage": "2018-2019, 2021-2022",
      "rank": 28431
    },
    {
      "id": "21100831304",
      "title": "Series on Knots and Everything",
      "issn": [
        "02199769"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.106,
        "sjrQuartile": "Q4",
        "hIndex": 3,
        "totalDocs2024": 1,
        "totalDocs3Years": 72,
        "citationsPerDoc": 0.05,
        "totalCitations3Years": 3
      },
      "scope": "",
      "categories": [
        {
          "name": "Algebra and Number Theory",
          "quartile": "Q4"
        },
        {
          "name": "Applied Mathematics",
          "quartile": "Q4"
        },
        {
          "name": "Geometry and Topology",
          "quartile": "Q4"
        },
        {
          "name": "Logic",
          "quartile": "Q4"
        },
        {
          "name": "Mathematical Physics",
          "quartile": "Q4"
        },
        {
          "name": "Mathematics (miscellaneous)",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Mathematics"
      ],
      "country": "Singapore",
      "coverage": "2017-2021, 2023-2024",
      "rank": 29026
    },
    {
      "id": "21100892754",
      "title": "World Scientific Studies in International Economics",
      "issn": [
        "17933641"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": 0.102,
        "sjrQuartile": "Q4",
        "hIndex": 3,
        "totalDocs2024": 0,
        "totalDocs3Years": 119,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 7
      },
      "scope": "World Scientific Studies in International Economics includes works dealing with the theory, empirical analysis, and evaluation of international economic policies and institutions, with topics covering international macroeconomics and finance, international trade theory and policy, as well as international legal and political economy. Monographs and edited volumes will comprise the core of the publications. To submit a book proposal, please contact the Series Editor at[email protected].",
      "categories": [
        {
          "name": "Economics and Econometrics",
          "quartile": "Q4"
        },
        {
          "name": "Political Science and International Relations",
          "quartile": "Q4"
        }
      ],
      "areas": [
        "Economics, Econometrics and Finance",
        "Social Sciences"
      ],
      "country": "Singapore",
      "coverage": "2018-2019, 2021-2023",
      "rank": 29800
    },
    {
      "id": "21100824045",
      "title": "Computational and Experimental Methods in Structures",
      "issn": [
        "20449283"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": "",
        "sjrQuartile": "-",
        "hIndex": 5,
        "totalDocs2024": 8,
        "totalDocs3Years": 23,
        "citationsPerDoc": 0.22,
        "totalCitations3Years": 5
      },
      "scope": "This series will include books on state-of-the-art developments in computational and experimental methods in structures, and as such it will comprise several volumes covering the latest developments. Each volume will consist of single-authored work or several chapters written by the leading researchers in the field. The aim will be to provide the fundamental concepts of experimental and computational methods as well as their relevance to real world problems. The scope of the series covers the entire spectrum of structures in engineering. As such it will cover both classical topics in mechanics, as well as emerging scientific and engineering disciplines, such as: smart structures, nanoscience and nanotechnology; NEMS and MEMS; micro- and nano-device modelling; functional and smart material systems.",
      "categories": [
        {
          "name": "Ceramics and Composites",
          "quartile": null
        },
        {
          "name": "Civil and Structural Engineering",
          "quartile": null
        },
        {
          "name": "Computational Mechanics",
          "quartile": null
        },
        {
          "name": "Electronic, Optical and Magnetic Materials",
          "quartile": null
        },
        {
          "name": "Mechanical Engineering",
          "quartile": null
        }
      ],
      "areas": [
        "Engineering",
        "Materials Science"
      ],
      "country": "Singapore",
      "coverage": "2015, 2018, 2022-2024",
      "rank": 30904
    },
    {
      "id": "21101270451",
      "title": "Fertility and Reproduction",
      "issn": [
        "26613182",
        "26613174"
      ],
      "publisher": "World Scientific",
      "openAccess": true,
      "metrics": {
        "sjr": "",
        "sjrQuartile": "-",
        "hIndex": 0,
        "totalDocs2024": 5,
        "totalDocs3Years": 0,
        "citationsPerDoc": 0.0,
        "totalCitations3Years": 0
      },
      "scope": "",
      "categories": [
        {
          "name": "Medicine (miscellaneous)",
          "quartile": null
        },
        {
          "name": "Obstetrics and Gynecology",
          "quartile": null
        },
        {
          "name": "Reproductive Medicine",
          "quartile": null
        }
      ],
      "areas": [
        "Medicine"
      ],
      "country": "Singapore",
      "coverage": "2024",
      "rank": 30942
    },
    {
      "id": "12100157101",
      "title": "Journal of Interconnection Networks (discontinued)",
      "issn": [
        "17936713",
        "02192659"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": "",
        "sjrQuartile": "-",
        "hIndex": 17,
        "totalDocs2024": 9,
        "totalDocs3Years": 219,
        "citationsPerDoc": 2.88,
        "totalCitations3Years": 569
      },
      "scope": "The Journal of Interconnection Networks (JOIN) is an international scientific journal dedicated to advancing the state-of-the-art of interconnection networks. The journal addresses all aspects of interconnection networks which include structure, function, application and management in a variety of pervasive systems at the biological, cyber, physical and social level. Original research articles, both theoretical and applied, are solicited. Expository papers, which survey a matured or an emerging field, are also welcome. The topics covered by this journal include (but are not limited to) the following: System Structure and Management: Structures and Topologies: Multistage interconnection networks; various network properties including connectivity, diameter, wide diameter, reliability, reconfigurability, and fault-tolerance. Network Management: Routing, scheduling and load balancing; routing protocols; network design and traffic management; frequency equipment; network management policy and security. Domain Applications: Application of interconnection networks in parallel and distributed computing, reconfigurable network architecture, integrated circuits (VLSI layout design), multiprocessors and multi-core computers, and communication networks as diverse as telephone systems, cable network systems, computer networks, software defined networks, mobile communication networks, sensor networks, wireless networks, visualized networks, data center systems, clouds and satellite network systems Complex Network: Study of large networks defined with complex, typically probabilistic, structures; mathematical models; efficient algorithms; evolution of dynamic complex networks; big data implications of representing, managing, and analyzing large networks. Social Networks and Interaction: Semantic Network: Attention, consciousness, perception, knowledge presentation and association and proposition.",
      "categories": [
        {
          "name": "Computer Networks and Communications",
          "quartile": null
        }
      ],
      "areas": [
        "Computer Science"
      ],
      "country": "Singapore",
      "coverage": "2008-2013, 2015-2024",
      "rank": 31016
    },
    {
      "id": "21100898632",
      "title": "World Scientific-Now Publishers Series in Business",
      "issn": [
        "22513442"
      ],
      "publisher": "World Scientific",
      "openAccess": false,
      "metrics": {
        "sjr": "",
        "sjrQuartile": "-",
        "hIndex": 3,
        "totalDocs2024": 9,
        "totalDocs3Years": 22,
        "citationsPerDoc": 0.32,
        "totalCitations3Years": 7
      },
      "scope": "",
      "categories": [
        {
          "name": "Business, Management and Accounting (miscellaneous)",
          "quartile": null
        }
      ],
      "areas": [
        "Business, Management and Accounting"
      ],
      "country": "Singapore",
      "coverage": "2018-2020, 2023-2024",
      "rank": 31135
    }
  ]
}